[
  {
    "headline": "Man Utd news: Bruno Fernandes issues demand after derby loss as two stars singled out",
    "tags": [
      "Man Utd",
      "Fernandes"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-utd-news-bruno-fernandes-35902295",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Manchester United will lick their wounds this week after falling to a 3-0 loss in the Manchester derby. Erling Haaland bagged a brace after Phil Foden's opener to ensure Manchester City ended the weekend with three points and bragging rights.",
      "The result will only increase the scrutiny on Ruben Amorim, who has overseen just eight wins from 31 Premier League games since taking the reins at Old Trafford last November. And off the back of another disappointing performance, the inquest has already begun.",
      "For his part, Amorim insists he will not deviate from his principles as the scrutiny grows on him following another loss. The United chief will look to regroup before they host Chelsea in their next fixture on Saturday evening.",
      "Bruno Fernandes has called on his Manchester United team-mates to be braver and take more risks as they bid to make amends following their chastening 3-0 loss in the Manchester derby.",
      "Manchester City cantered to an easy win without hitting top gear on another difficult afternoon for Fernandes and Co. And speaking post-match, United's captain said: \"We need to score goals and not concede. We keep creating chances but were not able to score as much as we wanted. We have to be more in control. We concede three goals we could have avoided.",
      "\"When we go we have to take more risks and be more brave with the last line. When we pass to our centre-backs they go three against three and squeeze so much. The space is very narrow.\"",
      "Roy Keane tore into Luke Shaw and Bruno Fernandes for mistakes in the build-up to Phil Foden's opening goal in the Manchester derby.",
      "Foden arrived unmarked in the penalty area to plant a pinpoint header beyond the despairing Altay Bayindir in the 18th minute. And Keane felt that neither Shaw or Fernandes covered themselves in glory during the passage of play.",
      "After pointing out Shaw's positioning was all wrong when Jeremy Doku was bearing down on the penalty area, Keane added: \"It's like he [Shaw] has thrown the towel in. We know people can run off the back of Bruno, that's been going on for years. But my goodness, even before that, you've got two midfielders - they are too square. One pass takes them out. Far too easy. Shaw just throws the towel in there.\"",
      "Ruben Amorim insists he will not change his tactics as the pressure grows on him following Sunday's defeat to Manchester City.",
      "Amorim has made no secret of the fact he is wedded to his preferred 3-4-3 formation and made it clear that the only way United will see a change in their style is if they opt to make a change in the dugout following the loss against City.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Ruben Amorim makes Man United sack admission after Manchester City defeat",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/ruben-amorim-makes-man-united-35902183",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35902275.ece/ALTERNATES/n615/0_Screenshot-2025-09-14-212349.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Ruben Amorim has issued a stark warning to Manchester United after Sunday's defeat at Manchester City. The Red Devils' head coach has insisted that if there is a desire from above to alter the club's playing style, he will need to be replaced as manager.",
      "United suffered a 3-0 loss at the hands of City in the season's first derby - leaving them with a mere four points from their first four Premier League matches. It marks their worst start to a season since the 1992-93 campaign.",
      "Amorim, who took over the reins at Old Trafford on November 1 last year, has only managed to secure eight victories from the 31 Premier League games he has overseen. As a result, United are languishing at the bottom of the 17-team table - which includes all teams that have been consistently present in the league since his appointment.",
      "Despite being contracted with the club until 2027, the recent loss is likely to stoke further doubts about Amorim's future at United.",
      "\"Guys, I understand that and I accept,\" he said after Sunday's defeat to City. \"It is not a record you should have in Manchester United. There are a lot of things - you have no idea what happened during these months - but I accept that. I am not going to change.",
      "\"When I want to change my philosophy, I will change. If not, you have to change the man. We will talk about that every game that we lose. I don't believe in that, in the system, or whatever. I believe in my way and I am going to play my way until I want to change.",
      "\"My message is that I am going to give everything. I will do everything, always thinking about what is best for the club. That was always the same message. It is not my decision, the rest (on whether United change manager). Until I am here, I will do my best. I really want to win games. I am suffering more than them.\"",
      "Despite a lacklustre run of one victory in five matches, Amorim maintained that United have shown improvement over last season, although they've only managed to net one goal from open play in six hours of Premier League action.",
      "\"The results, again, I accept that,\" he conceded. \"I see that we are doing better but the results don't show that. I remember last year we played in the former club against City. We won 4-1 (with Sporting in the Champions League). It was not near the opportunities, the way we control the game compared to today.",
      "\"In certain moments we were not better than City. I understand that. It is hard and the record says everything. I understand.\"",
      "United's promising start faded when Phil Foden scored in the 18th minute, followed by two second-half goals from Erling Haaland sealing their fate. Haaland's physical prowess was on display as he overpowered Luke Shaw for his first goal and sprinted from his own half for another solo effort that beat Altay Bayindir. Amorim lamented United's lack of aggression, which he felt contributed to their defeat.",
      "\"If you look at the goals, we can avoid that kind of goal,\" he said. \"We have almost everyone behind the ball and we could be more aggressive.",
      "\"The second goal, in the moment of the game that we are pressing City. We suffer a goal in the throw-in when we want to recover the ball instead of covering the space and then to win the ball. We let two players of City one against one. The approach that we had in that play we can avoid and we can close our goal.",
      "\"The third goal, Haaland has all the space. A confusion with our players and then he has all the space to play. In these moments I felt that if you look at the goals, there are moments we could avoid. That is the key of the game, it's to take advantage of these moments and they took it.",
      "\"In transitions, a great shot from Bryan (Mbeumo). In those moments they were better than us.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Roy Keane tears into Ruben Amorim comments after Man Utd loss - 'He should be raging'",
    "tags": [
      "Man Utd",
      "Amorim",
      "Roy Keane"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-utd-roy-keane-amorim-35902179",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35902202.ece/ALTERNATES/n615/0_Screenshot-2025-09-14-203107.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Roy Keane was not impressed to hear Ruben Amorim defend his Manchester United team after watching them lose comprehensively against Manchester City in the derby.",
      "The Red Devils were beaten 3-0 by Pep Guardiola's side, who paid a fitting tribute to boxing legend and huge City fan Ricky Hatton following the sad news of his death earlier in the day. Phil Foden opened the scoring in the 18th minute before Erling Haaland notched twice after the break as City finished the derby in cruise control to condemn Amorim and United to another sobering afternoon.",
      "\"He is talking about moments, but football games are decided by moments. It always seems to be moments of the opposition than United at this moment in time, and I am including teams like Grimsby by the way.",
      "\"He should be raging, I like managers who are emotional but I like my managers to show anger as well. I just couldn't imagine being in a dressing room after losing a derby game 3-0 and everyone going 'did we all try?'\"",
      "Defeat against City in the derby means United have banked just four points from their opening four Premier League games. Amorim offered a defence of his team when he was asked where he felt United are right now post-match, though, saying: \"We play against one coach that won seven Premier League titles and we are building things, trying to fight against these teams. I am not going to defend myself, it's always the same question, trying to protect myself. We need to do better.",
      "\"If I look to the game, last year we draw and won against City and today we were a little bit better but in the small details it was clearly not goof enough. We are building things but of course we need to win.",
      "\"I'm not happier. I didn't see one player in my team not giving the maximum. The rest is with me. The disappointment sometimes I feel we could run more, but I didn't have that feeling today. It's my fault, not their fault and I am fine with that.",
      "\"I know it's hard on our fans but again, I cannot point to one player [about lack of] effort. With game intelligence we can improve but that is my fault and we can improve.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Bruno Fernandes demands two immediate Man Utd improvements after Manchester derby defeat",
    "tags": [
      "Man Utd",
      "Fernandes"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/bruno-fernandes-man-utd-city-35902102",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Bruno Fernandes called for Manchester United to be braver and take more risks with their play after they fell to a meek 3-0 derby defeat to Manchester City.",
      "United were well beaten at the Etihad Stadium, where Phil Foden - who admitted City were inspired by the sad death of legendary boxer and City superfan Ricky Hatton - headed home the opener before a second half brace from Erling Haaland.",
      "The Red Devils were never really in the game from the moment they fell behind, and captain Fernandes says they need to improve in at least two areas.",
      "\"What we did today was not enough to get a result and that's what we'll take from this game. Obviously look at what we have to do better and look to the next game.",
      "\"We need to score goals and not concede. We keep creating chances but were not able to score as much as we wanted. We have to be more in control. We concede three goals we could have avoided.",
      "\"When we go we have to take more risks and be more brave with the last line. When we pass to our centre-backs they go three against three and squeeze so much. The space is very narrow.\"",
      "Fernandes went on to try and put the result into perspective, with United having taken just four points from their opening four matches of the season, their worst start to a Premier League campaign since the very first one in 1992-93.",
      "\"The result is very bad, very bad on us but I think it's two ways of looking at this game,\" continued Fernandes. \"The goals could have been avoided. On the ball we were very positive, very brave, we were playing the ball forward. When we created chances we could have been more clean.",
      "\"We wanted what City got and that's the three points. City were smart to get the goals in the way they did, they have a very good team and good players.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Roy Keane forced to backtrack on brutal Erling Haaland claim by Man City star",
    "tags": [
      "Roy Keane"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-city-united-keane-haaland-35902072",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35902128.ece/ALTERNATES/n615/0_Screenshot-2025-09-14-195407.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Roy Keane claims the \"penny is now dropping\" for Erling Haaland after their bitter war of words. Keane and the Manchester City striker have been wrapped up in a back-and-forth exchange since the Man United icon compared his build-up play to a League Two player.",
      "Haaland certainly made the Red Devils icon eat his words on Sunday afternoon in the Manchester Derby. He netted a brace in City's 3-0 success against rivals Man United at the Etihad Stadium.",
      "And his afternoon could have been even more productive having hit the post and teed up teammate Tijjani Reijnders for another opportunity.",
      "Haaland's performance appears to have forced Keane to change his mind having joked that Haaland's hold-up play is not on par with second-tier players.",
      "Speaking after City's emphatic victory on Sunday afternoon, Keane said: \"Excellent. He's Championship now.",
      "\"There's no doubt about that (Haaland is a world class striker), I've never said that. But some of his general play...is is improving of course. He's 25 now yeah, the penny is dropping. Got to be more about the team as well.\"",
      "Meanwhile, Keane was also full of praise for Haaland's defensive work. He added: \"We know Haaland's strengths. You have one of the best strikers in the world running from the halfway line and there was never any doubt he was going to finish it.",
      "\"He probably could have scored a few more. You talk about a team player, you have to give him praise for coming back and doing a good job defensively.\"",
      "Haaland now has five goals from just four Premier League appearances in what is turning into yet another productive campaign. And he appears to have heeded Keane's warning.",
      "Speaking originally in March 2024 after a display against Arsenal, Keane said: \"In front of goal he's the best in the world, but his general play is so poor. He's almost like a League Two player - that's the way I look at him. His general play has to improve.\"",
      "Haaland had a brutal response to Keane, having completely dismissed his comments. He replied: \"I don't really care that much about that man, so that's all right.\"",
      "Haaland will certainly be aiming to extend his excellent form over the next week. City get their Champions League campaign underway against Italian giants Napoli ahead of next week's showdown with Arsenal.",
      "Speaking about his striker's form, City boss Guardiola said: \"Erling has been incredible since the start but this season he is better than ever. I would say better than the Treble year. He's dynamic and I don't judge him for the clearance, we want him to score goals and to help us.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "opinionRuben Amorim anger speaks volumes as Man Utd claim brutally exposed in derby loss",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/ruben-amorim-man-utd-derby-35902039",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35901929.ece/ALTERNATES/n615/1_GettyImages-2235386198.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Daily Mirror Manchester Football Correspondent, covering Manchester United and Manchester City. North-West Football Awards Journalist of the Year 2014, Highly Commended in Sports Journalists Association for Scoop of the Year 2010. Covered four World Cups and four European Championships.",
      "Midway through the first-half, with Manchester United trailing, Ruben Amorim slapped his thighs in frustration over the failure of his players to carry out his instructions.",
      "The image of Amorim as a tortured soul has been a recurring one over his 10 months in charge, with eight wins from 31 Premier League games yielding little joy for the United boss. It was a familiar story here, despite Amorim claiming ahead of the game that United were a “better team” than last season, his players reverting to type and again failing to deliver when it mattered.",
      "United may have gone into the derby above City in the table for the first time in five years, but Pep Guardiola's side, who suffered a poor start to the season with back-to-back league defeats, provided a sobering reminder of the enduring gulf in class between the teams with a ruthless demolition of their local rivals.",
      "After nearly a year in charge, and having presided over a £236million spend in the summer transfer window, United fans are entitled to expect their team to be in a better place.",
      "But they continue to regress, despite their summer additions and Amorim's bold rhetoric about clear signs of progress. Here, United were undone by basic mistakes that continue to cost them games, just as they did last season, when they limped to a 15th-place finish.",
      "Failure to qualify for Europe, we were told by Amorim, was a blessing in disguise for United, because they were not ready for it and because it would give him and his coaching staff more time to work with the players on tactics, principles and patterns of play.",
      "Five games into the new campaign and that take has been exposed, with United looking as dysfunctional and ragged as they did last season, committing the same errors and paying the same price by losing games.",
      "For City's first goal, Luke Shaw pulled out of a challenge on Jeremy Doku, allowing him to pick out Phil Foden, who was free to score with a header after United skipper Bruno Fernandes failed to track his run.",
      "United's players were also culpable for City's second, Bryan Mbeumo conceding a needless throw-in, from which City scored, Doku finding Erling Haaland, who was able to run between Shaw and Matthijs De Ligt, before executing an exquisite chip over Altay Bayindir.",
      "Even when United did threaten to score, such as in the 61st minute when Bryan Mbeumo sent a sublime volley arrowing towards the far corner of the net, they were thwarted, City's new keeper Gianluigi Donnarumma tipping the ball away.",
      "United may have offloaded players with a negative influence in Marcus Rashford, Alejandro Garnacho, Jadon Sancho and Antony, but a deeper malaise remains within the squad, one for which Amorim will pay the price if he cannot turn the team's fortunes around any time soon.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Phil Foden admits extra motivation to beat Man Utd after death of Man City fan Ricky Hatton",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/phil-foden-ricky-hatton-death-35902024",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35902062.ece/ALTERNATES/n615/1_Untitled-1.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Phil Foden paid tribute to Ricky Hatton after admitting the boxer’s untimely death gave Manchester City “extra motivation.”",
      "Former world champion Hatton was a huge City fan and the Etihad gave an emotional minute’s applause before kick-off ahead of the Manchester derby.",
      "Foden, also a boyhood City fan, then opened the scoring before Erling Haaland hit a brace as they saw off Manchester United with ease.",
      "City star Foden said: “100% I had extra motivation going into the game, it was for him and his family and for the people suffering right now.",
      "“The lads gave everything. It wasn't a pretty match but it was all for him.”",
      "City boss Pep Guardiola said: “I have been ten years and I don’t remember one so intense like today. Thank you so much to Manchester United fans.",
      "“I know he was a world champion in boxing. There are no words that can contain the pain that the family can feel right now.",
      "“We are close and I know how incredible he was as a Manchester City fan. He could live the good moments and the bad moments. The moment of silence was unbelievable, I will always remember it. A massive, massive City fan.”",
      "Foden also celebrated his goal with an extra passion as he ran to the fans and admitted that he struggled to live up to his own standards last season and the criticism has hurt him.",
      "England forward Foden, who was City’s best player in their last title-winning season in 2024, said: “There has been a lot of talk. Everything has been quite negative but that's the world that we live in when you are playing at the highest level.",
      "\"When you come off winning the player of the season award the standards are higher and I understand that. It's about reading those comments, reacting as well as possible and getting back to my level.”",
      "City issued a club statement to offer condolences to Hatton’s family which said: “Ricky was one of City's most loved and revered supporters, who will always be remembered for a glittering boxing career that saw him win world titles at welterweight and light-welterweight.",
      "“Everyone at the club would like to send our heartfelt condolences to his family and friends at this difficult time.”",
      "Former City captain Vincent Kompany posted a picture on X showing himself, Liam Gallagher and Hatton, alongside the words: “We'll miss you Ricky. Our thoughts are with the family and friends. Rest in piece legend.”",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "opinionMan City pay perfect tribute to Ricky Hatton with dominant Man Utd derby win",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/match-reports/man-city-united-ricky-hatton-35902005",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35902029.ece/ALTERNATES/n615/0_GettyImages-2234875334.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Football loving writer who spends much of his life on motorways getting to games all over the country. Passionate about football, my job and the Mirror. The Premier League is the best in the world and always believe England has a chance. Author of Arsene Wenger: The Inside Story of Arsenal Under Wenger.",
      "This was the best possible tribute Manchester City could have paid to Ricky Hatton. The Etihad rose as one before kick-off with a highly emotional and moving minute’s applause in tribute to the boxing hero and City fan after his untimely death.",
      "Then City delivered a performance which would have made Hatton proud as they blew bitter rivals Manchester United away on the day they lost one of their greatest supporters. Fittingly, Phil Foden, also a boyhood City fan, was at the heart of the victory as he had promised before kick-off to win the derby for Hatton - and duly delivered.",
      "Erling Haaland scored twice as his strength and finishing destroyed United’s creaking defence and, incredibly, the giant Norway striker is into double figures for club and country this season. Eleven goals and it’s still only September!",
      "It was Foden who got the opener and you could tell the way he celebrated by running to the crowd that it was a particularly poignant moment for him.",
      "We have been here far too many times with City already to suggest they are back to their best, especially on the back of one performance in an otherwise indifferent start. But you cannot underestimate the importance of £27m signing Gianluigi Donnarumma because suddenly they have a keeper to be reckoned with and immediately looked better at the back.",
      "While United continue to mess around with dodgy keepers, Donnarumma showed his quality with one outstanding save from a Bryan Mbeumo volley and his mere presence gave City confidence.",
      "Meanwhile, United keeper Altay Bayindir started ahead of deadline day signing Senne Lammens - another bit-part signing - and looked an absolute shambles. Bayindir should be nowhere near a United first team and, sure enough, his poor control early on nearly let in Haaland and his sloppiness spread and reduced his defenders to a bag of nerves.",
      "United blew all their big money on forwards and yet it was another blank day for Benjamin Sesko who was hauled off and, despite all the optimism before the season, Ruben Amorim looks as far away as ever.",
      "Frankly, if ever you need an opponent to boost confidence then United are the perfect tonic. Even Mbeumo missed a sitter in the closing stages. That is what United does to players: it ruins them.",
      "City, meanwhile, were fast, intense and up for the fight. They were ahead after just 18 minutes. Rodri had his best game since returning from injury and started the move by feeding Jeremy Doku who was electric on the wing. When Doku’s first cross was blocked, he refused to give up and supplied another and there was Foden to glance home with real style. It is a big season for Foden - and he sparkled.",
      "City took charge eight minutes after the restart. Doku supplied his second assist of the game by threading it through for Haaland who burst between Luke Shaw and Matthijs de Ligt and then lifted the ball over the keeper.",
      "Haaland will still be wondering how he missed an even easier chance when he hit the post soon after. But he soon made up for it.",
      "United failed to clear their lines, substitute Harry Maguire’s ball went straight to Bernardo Silva and his pass released Haaland and he raced clear before slotting his 11th goal of the season. City were now in cruise control. They could - and should - have scored more. Tijjani Reijnders went through but fired wide.",
      "By the final whistle, the away end was virtually empty as the United fans had long since given up on their team. They have admirably stuck with Amorim but you have to wonder how long can their blind faith last.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Erling Haaland proves Pep Guardiola's point as Man City batter Man Utd - 5 talking points",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/match-reports/man-utd-city-goals-highlights-35901779",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35901913.ece/ALTERNATES/n615/0_Untitled-1.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Phil Foden and Erling Haaland were once again Manchester United's tormentors-in-chief as Manchester City cruised to a 3-0 win over their bitter rivals in the derby.",
      "After a poignant - and exemplary - tribute from fans in both blue and red to boxing great Ricky Hatton following his sad death earlier in the day, City flew out of the blocks and almost took the lead inside 60 seconds when Haaland sent a strike narrowly wide of Altay Bayindir's post. The United keeper stood no chance, though, when Foden ghosted into the box to plant a header inside his far post 18 minutes in.",
      "Foden and Haaland have both been prolific in recent derbies and it came as no surprise when the latter got in on the act shortly after the break following neat work from Nico O'Reilly, Foden and Jeremy Doku. The dazzling Doku grabbed his second assist of the afternoon by feeding City's imperious No 9, who made no mistake with a neat dink over Bayindir.",
      "And it was Haaland who put the game to bed in the 68th minute when, after being played clean through with a run which started from his own half, he clinically threaded the ball into the bottom corner for his second goal.",
      "On a week where Pep Guardiola unofficially coronated Haaland as the world's best striker amid suggestions from Arne Slot that Liverpool new boy Alexander Isak was, perhaps, top of the pops, Manchester City's goal machine emphatically proved his manager's point.",
      "For a striker with such a phenomenal goal record since arriving in the Premier League, there's also been plenty of talk about his lack of involvement in games. But he had plenty of touches here (31 for anyone counting) and was just as influential in his own penalty area before dispatching two textbook finishes to consign United to a derby defeat, with his six clearances the best defensive contribution of anybody in a blue shirt.",
      "With eight goals in nine games against City's bitter rivals it's no wonder Guardiola says he wouldn't change Haaland for anyone. On this showing, would anyone?",
      "For someone who needed a fast start to the new Premier League campaign, Ruben Amorim has overseen just one win from Manchester United's first four games.",
      "The Portuguese coach will be given time to get things right after United spent big on a new attack in the summer but this was not a derby day performance which will live long in the memory and few left an impression in their rivals' backyard.",
      "United may have spurned a flurry of good opportunities in the final 15 minutes to bump their stats, but the game was already done as a contest. And more concerningly, they were shoddy in defence and midfield still looks an area of concern.",
      "Per Opta, this is now United's worst start to a league season since they also mustered four points from their opening four games back in the 1992-93 campaign. And after spending more than £200m this summer, it feels like we still have more questions than answers when it comes to Amorim and this Manchester United team.",
      "Foden has made a habit of scoring in Manchester derbies. But his seventh in as many fixtures could be his most important yet if it turns out to be the start of a renaissance for the influential attacking midfielder, who has not hit top form for club or country for quite some time. The fact that his goal here was his first since January tells the story.",
      "A return to form would be most welcome for Guardiola, who has seen his all-conquering team turn mortal before his eyes over the last 12 months. Following Kevin de Bruyne's removal from the City throne this summer, the previously formidable former champions have a vacancy for a new kingpin. Foden, though always influential in his own right, had long been touted as De Bruyne's natural successor. He and City will hope Sunday's latest derby moment will turn out to be the prelude to that.",
      "The talk in the build-up of this was largely over who would start in goal for both teams. And while Gianluigi Donnarumma and Altay Bayindir got the nod between the sticks, only one is likely to stay there.",
      "Donnarumma is widely regarded as one of the world's best keepers and arrives at The Etihad off the back of conquering Europe with Paris Saint-Germain. He is elite right now - as he showed with his fine save to thwart Bryan Mbeumo in the second half - whereas Bayindir was signed two years ago primarily as a deputy.",
      "Senne Lammens, United's newly acquired keeper, is seen as a player capable of growing into the club's next No 1. Amorim decided against handing the highly-rated 23-year-old Belgium prospect a baptism of fire in the derby despite the fact Bayindir has never really convinced when playing in place of the erratic Andre Onana. But like Donnarumma for City, Lammens will be drafted in as United's new No 1 sooner rather than later.",
      "On an afternoon where City's attackers dazzled, two thirds of United's new-look frontline were forced to feed off scraps until the dying embers of the game. While we've seen little of Benjamin Sesko since his big-money arrival, Bryan Mbeumo - and the injured Matheus Cunha - have already shown enough in glimpses that they can improve United's record in front of goal and the Cameroon star was unfortunate not to find the net with a fine volley on the hour.",
      "Sesko's first Premier League start went by without the striker having any real chance of note as United struggled to fashion much in the way of clear-cut opportunities until City were 3-0 up and in cruise control. United may have seen enough in recent games to suggest their new-look attack will click, but it didn't quite fire on derby day.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Man City barman serving drinks in Man Utd shirt sparks outrage before club take action",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-utd-fan-etihad-barman-35901900",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35901907.ece/ALTERNATES/n615/0_manutdfan.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "A cheeky barman at the Etihad Stadium sparked outrage when he was spotted donning a Manchester United shirt while serving drinks.",
      "The Red Devils had descended upon the blue side of Manchester for a crucial derby match on Sunday afternoon, with both teams aiming to shake off their sluggish starts to the season. One audacious United supporter decided to get one over City before the game even kicked off.",
      "This fan, who was pulling pints behind the bar at the Etihad, unzipped his jacket to reveal a United shirt, much to the annoyance of the City fans he was serving.",
      "\"Absolute joke @ManCity - letting one of the bar staff in block 315 wear a United shirt on Derby Day,\" one disgruntled fan tweeted, sharing a photo of the man serving him an Asahi.",
      "\"The game is too far gone,\" another supporter responded. While a third quipped: \"Some fella turns up in fancy dress and that's your biggest concern, £4 for a sausage roll is an outrage?\", reports the Daily Star.",
      "As United fans revelled in the unexpected victory, City caught wind of the social media post and promptly issued a statement on their Fan Support page.",
      "It read: \"Thank you for making us aware of this. We can confirm that this individual has now been removed from their position.",
      "\"Scenes when united win and hire him,\" one fan joked. Another chimed in: \"Make this the 118th charge..\"",
      "City supporters had another reason to cheer during the first half, as local hero Phil Foden netted a goal to put Pep Guardiola's team in the lead. It was a poignant day for Foden, following the tragic passing of Ricky Hatton.",
      "\"Today is for him and we're going to try and get the win and do the best for him.\"",
      "When asked if it could serve as extra motivation, Foden added: \"Definitely, we've got to use it as motivation and try and get the win for him.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Roy Keane savages TWO Man Utd stars for howlers in Manchester Derby",
    "tags": [
      "Man Utd",
      "Roy Keane"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/breaking-roy-keane-united-city-35900360",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35901821.ece/ALTERNATES/n615/0_GettyImages-2234330167.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Manchester United icon Roy Keane tore into Luke Shaw and Bruno Fernandes for their roles in Phil Foden's opening strike in the Manchester Derby.",
      "The Manchester City star nodded home midway through the first-half to give his side the lead. And Keane was far from pleased with the contributions from two United stars in particular.",
      "Fernandes had allowed goalscorer Foden to ghost into the box undetected, while Shaw failed to deal with Jeremy Doku - the Belgian wideman producing the cross from which City scored their opener.",
      "\"It's a nice bit of skill, but Shaw's an England international player. He's got hundreds of games under his belt, he doesn't even get his body position right.",
      "\"It's like he has thrown the towel in. We know people can run off the back of Bruno, that's been going on for years. But my goodness, even before that, you've got two midfielders - they are too square. One pass takes them out. Far too easy. Shaw just throws the towel in there.\"",
      "Ex-City star Micah Richards also shared his thoughts and was far from convinced with both Shaw and Fernandes' attempts at defending.",
      "He added: \"I just want to look at Fernandes' position here, though. He's playing in that two in midfield and once the ball is over at that side, now you have got to read the danger and he just loses Foden there. Just switches off and it wasn't good enough.\"",
      "Things got worse for City shortly after the break, with Erling Haaland doubling the lead. Doku was once again the man at the heart of things as he rolled the Norwegian through, while the City forward lifted a brilliant finish into the net for his fourth goal of the season.",
      "Doku should have had a hat-trick of assists minutes later after playing Haaland through again but somehow Haaland hit the base of the post having gone around Altay Bayindir.",
      "Man City are back in action midweek as they open up their Champions League campaign against Italian giants Napoli. Having failed to secure any European football, United now have to wait until next weekend for their next game against Chelsea.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more."
    ]
  },
  {
    "headline": "Emotional Ricky Hatton tribute paid before Manchester derby after boxing legend's deathVIDEO",
    "tags": [],
    "link": "https://www.mirror.co.uk/sport/football/news/breaking-manchester-derby-ricky-hatton-35901593",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "A poignant tribute to Ricky Hatton took place before the Manchester derby following the tragic news of the boxing legend's death at the age of 46 earlier in the day.",
      "Hatton, a huge Manchester City fan, was expected to attend Sunday's big game. But news of his death emerged shortly before kick off, with City releasing a statement expressing their sadness at the news.",
      "A tribute to Hatton in the form of a minute's applause took place before kick-off while both teams donned black armbands to remember 'The Hitman'.",
      "Both sets of supporters joined together in unison to chant \"there's only one Ricky Hatton\" while a picture of the former world champion was shared on the big screen.",
      "Earlier in the day, City released a statement expressing their sadness at Hatton's death. The statement read: \"Manchester City are devastated to learn Ricky Hatton has passed away, aged 46.",
      "\"Ricky was one of City’s most loved and revered supporters, who will always be remembered for a glittering boxing career that saw him win world titles at welterweight and light-welterweight.",
      "\"Everyone at the Club would like to send our heartfelt condolences to his family and friends at this difficult time. We can confirm there will be a minute’s appreciation ahead of today’s game against Manchester United.\"",
      "Tyson Fury and Amir Khan were among those who paid tribute to Hatton from the world of boxing. The latter posted: \"Ricky, thank you for everything. For your fights, your moments of glory, your grit. Thank you for pushing us, showing us what’s possible. To everyone reading this: if you’re hurting or struggling, you are not alone. Talk. Reach out. Because we need more light, more compassion, more understanding. Rest well, Ricky. You’ll always have your place in the ring of our memories.\"",
      "Manny Pacquiao, one of Hatton's former opponents, wrote on X: \"I am deeply saddened to hear about the passing of Ricky Hatton. He was not only a great fighter inside the ring but also a brave and kind man in life.",
      "\"We shared unforgettable moments in boxing history and I will always honor the respect and sportsmanship he showed. Ricky fought bravely, not just in the ring, but in his journey through life.",
      "\"He truly had a good fight, and we are all blessed to have been part of his wonderful journey. My prayers and deepest condolences go out to the Hatton family and all his loved ones. May the Lord give you strength and comfort in this difficult time. May he rest in peace.\"",
      "A title race you can't miss. Get City news for FREE sent directly to your inbox!"
    ]
  },
  {
    "headline": "Sir Alex Ferguson's private meeting with Pep Guardiola and his thoughts on Ruben Amorim",
    "tags": [
      "Ferguson",
      "Amorim"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/alex-ferguson-amorim-guardiola-manchester-35900637",
    "image": "https://i2-prod.mirror.co.uk/sport/article34702743.ece/ALTERNATES/n615/1_GettyImages-136622774.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Sir Alex Ferguson is no stranger to holding private talks with either Pep Guardiola or Ruben Amorim. Guardiola's Manchester City host rivals Manchester United, managed by Amorim, in the Manchester derby on Sunday afternoon.",
      "Despite both clubs enjoying vast Premier League success in the past, neither side has started the season well. City, despite their hopes that last term was merely a blip, are down in 16th, having won one and lost two games so far.",
      "Less surprisingly, given United's decline since Ferguson's departure in 2013 and a woeful 15th-place finish last season, Amorim's Red Devils are in 11th place. And it is entirely possible that the Portuguese head coach may have leaned on Sir Alex for some advice ahead of the short trip to the Etihad Stadium.",
      "That's because Amorim revealed last season in January, midway through United's turbulent campaign, that he was in regular contact with the 83-year-old. Allowing Amorim to tap into his vast knowledge suggests that Ferguson has a reasonably close relationship with Amorim and wants to help the young head coach.",
      "\"I speak with Sir Alex several times. I try to call him to keep being positive,\" Amorim told BBC Radio 5 Live. \"It's really good because I feel the history of the club but it's really hard, as they did such a good job, to be the guy leading the team at this moment. It's really hard but we have to believe.\"",
      "In the opposition dugout on Sunday will be a man whom Ferguson will also know well. The Scot had formerly handpicked David Moyes as his successor, only for his compatriot to be sacked less than a year into the United job in 2014.",
      "Ryan Giggs took charge on an interim basis before Louis van Gaal was eventually appointed. But before the Dutchman's arrival, Ferguson had sought to make amends by apparently trying to snap up Guardiola - then at Bayern Munich, and regarded as the best manager in the world.",
      "Guardiola, who ironically joined City in 2016 and has won six Premier League titles since, recalled once being invited to a private meeting by Ferguson, where he was left unsure of whether the Scotsman was offering him the United job or not.",
      "\"He invited me to [a] super restaurant and we had a very, very good time. My English [was] not so good when Sir Alex [Ferguson] spoke a little bit quickly, I had sometimes had a problem understanding him,\" explained Guardiola.",
      "\"That's why I didn't understand if I received an offer or not. It was a friendly dinner, like always with me when I started as a coach, he was so, so gentle and we spent a very, very good time together.\"",
      "Ferguson's record in Manchester derbies is 26 wins, 10 draws, and 11 losses. Guardiola, meanwhile, has won eight of his 15 league clashes with the Red Devils but lost both times he faced Amorim last year. One loss came against Amorim's Sporting CP side in the Champions League and then to United in December.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Ricky Hatton was due to attend Manchester derby before tragic death aged 46VIDEO",
    "tags": [],
    "link": "https://www.mirror.co.uk/sport/football/news/ricky-hatton-dead-manchester-derby-35900674",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "British boxing legend Ricky Hatton was due to attend Sunday's Manchester derby before his tragic death aged 46. Hatton, a passionate Man City supporter, was found dead at his home in Hyde, Greater Manchester at 6:45am on Sunday.",
      "Greater Manchester Police say that they are not treating his death as suspicious. Hatton had a table in hospitality booked for the Premier League match between City and Manchester United, and there will now be a minute's applause before kick-off at 4:30pm.",
      "The club shared a heartfelt tribute which read: \"Manchester City are devastated to learn Ricky Hatton has passed away, aged 46. Ricky was one of City's most loved and revered supporters, who will always be remembered for a glittering boxing career that saw him win world titles at welterweight and light-welterweight.",
      "\"Everyone at the Club would like to send our heartfelt condolences to his family and friends at this difficult time. We can confirm there will be a minute’s appreciation ahead of today's game against Manchester United.\"",
      "Tributes are flooding in for Hatton, one of Britain's most popular fighters. He is survived by his three children; son Campbell, and daughters Fearne Grace and Millie.",
      "A GMP spokesperson said: \"We can confirm that we have found a body at an address on Bowlacre Road in Gee Cross at 6.45am today, Sunday, September 14. The death is not being treated as suspicious.\"",
      "Hatton was scheduled to return to the boxing ring in early December, 13 years after his last professional fight. The Hitman was set to face Dubai's first-ever professional boxer, Eisa Al Dah, in the Middle East.",
      "His last professional bout was against Vyacheslav Senchenko of Ukraine in Manchester. That came three-and-a-half years after he hung up his gloves following a loss to Manny Pacquiao in Las Vegas.",
      "Aside from boxing, Hatton loved his football and attended the PFA awards less than a month ago. He wore sky blue shorts in the ring and walked out to City's anthem, Blue Moon.",
      "He fulfilled a childhood dream by fighting at the City of Manchester Stadium in 2008, beating Mexico's Juan Lazcano. Speaking on the club's official podcast in 2024, Hatton explained: \"I go to the same pubs and I go to the match on Saturdays. I think that's why the fan base I had was so massive.",
      "\"I had an exciting boxing style, I was a body puncher and aggressive but I was just one of the boys. People in town could relate to me. They see me in town, at the darts, at the match, you don't see me on a red carpet. The fans could see me as one of them.",
      "\"It's the way I was brought up. My mum and dad brought me up right and I've always had good friends around me. No outsiders, it's always been the same group.",
      "\"If I ever got too big for my boots, my mates would tell me and they wouldn't want to know me. City fans I've no doubt will get behind Campbell because he's he same, he's one of us.\"",
      "He added: \"It's always been a family club. They've invested in the ground and facilities and the team but the club has kept its feet on the ground. When a few quid comes in you can lose that but we've not lost it, it's still the massive family club it is.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "'We're cursed!' - Man Utd fans react as Rasmus Hojlund makes immediate Napoli impact",
    "tags": [
      "Man Utd",
      "Hojlund"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/manchester-united-rasmus-hojlund-napoli-35900350",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Manchester United fans have been left feeling that the club is 'cursed' after Rasmus Hojlund took less than a quarter of an hour to score on his debut for Napoli. Hojlund, 22, joined the Italian champions on a season-long loan in the final knockings of the summer transfer window, having been pushed down the pecking order at Old Trafford.",
      "The Danish striker wasn't included in any of Ruben Amorim's squads for the four matches before his departure on deadline day, with new signing Benjamin Sesko preferred. United agreed a fee of up to £73.7million for Slovenia international Sesko and Amorim was happy to have him and Joshua Zirkzee as his options up front.",
      "Napoli needed a replacement for ex-Red Devils striker Romelu Lukaku, who suffered a thigh injury in pre-season and is set to spend the next two to three months on the sidelines. The Serie A title winners have paid a £5m loan fee and will be obligated to sign Hojlund permanently if they qualify for the Champions League, with a £38m deal already in place.",
      "The United loanee previously played in Italy for Atalanta, where he convinced the Red Devils to fork out an initial £64m for his signature two years ago. Hojlund bagged his first goal of the season as a substitute in Denmark's 3-0 victory over Greece during the international break.",
      "He took his shooting boots back to Napoli and netted with just 14 minutes on the clock in Saturday's trip to Fiorentina, making it 2-0. Antonio Conte's side ran out 3-1 winners, with former Manchester City star Kevin De Bruyne also getting on the scoresheet.",
      "Although he'd scored in Champions League games, United fans had to wait a painstaking 1,027 minutes for Hojlund to finally notch his first Premier League goal on Boxing Day 2023. So it was no surprise that the Old Trafford faithful reacted strongly to the Denmark international's early goal for Napoli.",
      "\"Debut goal, Utd are cursed,\" one fan said. A second lamented: \"Hojlund scores on his debut? Wow we're cursed.\" A third bemoaned: \"We're really cursed.\" Another asked: \"So the problem is Manchester United?\"",
      "Post-match, Conte hailed his new striker, joking that Napoli signed Hojlund because Scott McTominay was a success after coming from Old Trafford last season. \"Hojlund is only 22 years old, we got him from Manchester United, seeing as it brought us luck doing that with McTominay,\" the Napoli boss told Sky Sport Italia.",
      "\"We knew his qualities; he has great potential and can improve. You can see he's a lad with great prospects.\"",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "'I refused to shake Man Utd legend's hand after what he did - Sir Alex Ferguson backed me'",
    "tags": [
      "Man Utd",
      "Ferguson"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/gary-neville-peter-schmeichel-united-35900201",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Gary Neville famously refused to shake hands with Peter Schmeichel during the 2002 Manchester derby. The pair had formed a close bond during Schmeichel's eight-year tenure at Old Trafford in the 1990s.",
      "However, Schmeichel's decision to join City in 2002 after successful stints with Sporting CP and Aston Villa was seen as a betrayal by many United fans. The move also particularly irked Neville due to the intense rivalry between the two Manchester clubs.",
      "An awkward moment ensued during the Manchester derby in November, 23 years ago, when both teams were lining up in the tunnel at Maine Road. Schmeichel, leading out City, offered his hand to Neville, who was standing in as United's captain, but the full-back remained silent, briefly locking eyes with Schmeichel before brushing his hand aside.",
      "Neville then stood firm, a stern expression on his face, before leading his team onto the pitch to face their fierce rivals. Reflecting on the incident in 2018, Neville defended his decision to snub Schmeichel. During an appearance on the Quickly Kevin, Will He Score? podcast, he explained: \"When you look back now and you're 43, like I am, there are two things about that.",
      "\"One, he left Man United at the age of whatever he was, 35, and he said he was retiring, basically to go abroad. At the time when he came back, he played for Manchester City. You can't play for Manchester City. I'm a United fan and I can't play for Manchester City, I can't play for Leeds and I can't play for Liverpool. That's just written in stone.",
      "\"You just don't play for those clubs, irrespective of what happens. He'd won the treble with United in '99, said that he was retiring... he should have carried on playing for United for the next two or three years if that was the case. We struggled for a keeper between Peter and Edwin [van der Sar].",
      "\"The other thing was at that time I hated everybody, we all did. Everybody hated us, we all hated everybody. That's the way it was. With Sir Alex [Ferguson], you're on an island and we were [in a] siege mentality. If you're not on the island, do one.\"",
      "Neville also revealed he maintained a strict policy of refusing to shake hands with opposing players before kick-off, regardless of their identity or allegiance. He added: \"Shake hands at the end of the game when you've had the battle. I just think, I'm focusing before a game.",
      "\"I'm focusing on my first pass, which wasn't always a good one, my first touch, my first tackle, my opponent and how I'm going to affect him in the first five minutes of that game. I can't let him go past me on my first one-on-one - that's impossible - because if he goes past me the first time he's going to get confidence.",
      "\"I'm also going to run off him going forward to make him think he's got to run back. The first time the ball is in the air, I'm going to win that header. All I'm thinking about before that game is that. The idea of talking to a player from the opposition - that would distract me.",
      "\"So you say about not shaking hands with Peter Schmeichel, but I didn't shake hands with my brother [Phil Neville] when he was captain of Everton. And that's not because I don't like my brother - I do like him, he's all right.\"",
      "During that memorable Manchester derby, City thrashed United 3-1 at home, with Shaun Goater netting twice and Nicolas Anelka also on target to overshadow Ole Gunnar Solskjaer's consolation goal. The revelation comes ahead of Sunday's clash between the Manchester rivals at the Etihad Stadium, more than two decades after Neville's confrontation with Schmeichel.",
      "Pep Guardiola's Manchester City are desperate to find their footing at home after a mixed start to the season, with a victory over Wolves but defeats to Tottenham Hotspur and Brighton. The Citizens are keen to get back on track in one of the most high-stakes games of the season.",
      "Meanwhile, United have had a varied start to the season, with a loss, a draw and a win against Arsenal, Fulham and Burnley respectively. Manager Ruben Amorim is under pressure to deliver this season, having received full support from the board this summer, following a disappointing 15th-place finish in the Premier League last term.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "opinionMan City vs Man Utd is 'must-win' match for both Pep Guardiola and Ruben Amorim",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-city-vs-man-utd-35900208",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35899948.ece/ALTERNATES/n615/0_Manchester-City-v-Manchester-United-Premier-League.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "The first Manchester derby of the season is upon us, and it is shaping up to be a crucial clash for both Manchester City and Manchester United. The two titans will lock horns at the Etihad Stadium on Sunday at 4.30pm.",
      "It's the prime slot for the biggest Premier League game of the weekend, but there's more than just three points at stake. As with every derby, local bragging rights are up for grabs. The victorious fans will claim Manchester as either blue or red until the return fixture at Old Trafford on January 26, 2026.",
      "However, this time around, the stakes seem higher. Both teams currently languish in the bottom half of the table.",
      "It is surprising to see City in 16th place, even after only three games. Pep Guardiola's men have suffered back-to-back defeats against Tottenham Hotspur and Brighton & Hove Albion, following an opening-day victory over Wolverhampton Wanderers.",
      "United, on the other hand, sit in 11th position. Ruben Amorim's side have had a mixed start to the season, winning one, drawing one, and losing one of their first three matches, requiring a late Bruno Fernandes penalty to secure all three points against newly promoted Burnley last time out.",
      "United's Carabao Cup journey was cut short last month, following a penalty shootout defeat to League Two side Grimsby Town. In the wake of that match, United boss Amorim seemed to doubt his future at the club.",
      "However, their victory over Burnley silenced the speculation for a while. Losing to rivals Man City, though, could reignite those rumours.",
      "United hope to carry forward the momentum they built up before the international break into the upcoming game. A win would give City the boost they need to kick off their season.",
      "United's next challenge is Chelsea at Old Trafford on Saturday. While they have nearly a week to prepare, City face Napoli in their opening Champions League match on Thursday.",
      "City will undoubtedly aim for a positive result against their rivals to set them up nicely for the challenging fixture. Meanwhile, United will appreciate the extra preparation time before their next match, and no one wants to arrive at Carrington this week with the pressure to make amends.",
      "Given it's still early days in the season, securing three points could significantly alter the table standings. A win for United would bring them level with Everton and Sunderland, who currently sit in sixth and seventh place, respectively.",
      "A victory for City would catapult them into the top half of the table, two points clear of their city rivals - a much-needed morale boost following the disappointment of their last two matches. However, defeat could spell disaster, solidifying a sluggish start to the Premier League season.",
      "City learned the hard way last season; escaping a rut can be daunting. Their poor form almost ended their chances of securing a spot in the Champions League.",
      "A loss against United this weekend could effectively knock them out of the title race with Liverpool and Arsenal, despite the season being in its infancy. United find themselves in a similar predicament; defeat could resurrect the doubts that haunted last season, dampening morale both on and off the pitch and potentially jeopardising their European ambitions.",
      "The significance of the Manchester derby is never to be underestimated, but Sunday's match may carry more weight than previous encounters and those yet to come. It already feels like a do-or-die situation for both teams, a sentiment rarely felt this early in the campaign.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Brighton boss reveals how Carlos Baleba has been 'affected' by Man Utd transfer talk",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/carlos-baleba-man-utd-brighton-35900126",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35900177.ece/ALTERNATES/n615/1_GettyImages-2232416343.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Brighton boss Fabian Hurzeler has admitted midfielder Carlos Baleba has been \"affected by the noise\" around his failed move to Manchester United.",
      "Baleba was strongly linked with a move to Old Trafford during the summer transfer window and became one of United's top targets as Ruben Amorim sought a new No 6 to play alongside Bruno Fernandes in midfield.",
      "But United were put off by Brighton's reported valuation of £115million and moved onto other targets - though they were ultimately unable to bring in the defensive midfield player they wanted.",
      "Hurzeler insisted he was confident Baleba would not be sold and his prediction came true, but not without consequences. The 21-year-old was benched for his side's 2-1 loss to Bournemouth on Saturday and instead came off the bench.",
      "The German coach said Baleba had been affected mentally by the speculation surrounding a move to United, saying \"sometimes young players don't have the face we want to see\".",
      "\"I think it’s normal for a young player when the media creates the noise around him,\" the Brighton boss said.",
      "\"It’s not easy for this player to handle it. Therefore we need to give him the time and support so he comes back to his best performance.",
      "\"But he’s a young player and I think that’s something we have to accept, that young players don’t always have the face we want to see. ‘It’s our responsibility to help them in the right moments.",
      "\"I think everyone gets affected, especially when you are that young and you hear these kinds of things, no matter if they are wrong or right. But it’s just noise we don’t need.\"",
      "Hurzeler was speaking after his Brighton side's defeat to the Cherries, in which Baleba played the final 24 minutes.",
      "It was the first time Baleba has not started a game in the Premier League this season. He's played a total of 200 minutes in the top flight in 2025-26 so far and has been a key player for the Seagulls since his arrival in 2023.",
      "He's played 82 times for the club, scoring four goals, becoming the latest successful midfield signing to star for Brighton after Yves Bissouma, Moises Caicedo and Alexis Mac Allister.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "opinionAndre Onana's departure is latest sign of the official start of Ruben Amorim's revolution",
    "tags": [
      "Amorim",
      "Onana"
    ],
    "link": "https://www.mirror.co.uk/sport/football/andre-onanas-departure-latest-sign-35900038",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35737799.ece/ALTERNATES/n615/0_GettyImages-2214839679.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Andy Dunn is the Mirror's chief sports writer.",
      "Despite the hullabaloo that has accompanied Manchester United’s modern-day struggles, it should be no surprise if the derby goes their way at the Etihad today. After all, Pep Guardiola has managed to win only four of his nine Premier League home fixtures against United. Pep has lost four of those games, with one drawn.",
      "As City manager, his overall record against United - who have had five different, official managers during Guardiola’s Etihad tenure (if you count Ralf Rangnick’s six-month spell as official) - is good.",
      "But, in the context of City’s all-conquering era, it is not startling. In all competitions, City have faced United 25 times since Guardiola took over in the summer of 2016 and have lost nine of those matches, winning 13 and playing out three goalless draws.",
      "Only against Liverpool and Spurs have Guardiola’s City suffered more defeats (10). And Guardiola’s record against Ruben Amorim is underwhelming, having won only one of their five meetings, drawing two and losing two.",
      "Both United and City have made unconvincing starts to the season, Amorim’s team a point ahead of their local rivals. United have created plenty of chances but still look limited in the goalscoring department while City’s defensive vulnerability - which emerged quite emphatically last season - remains there for all to see and exploit.",
      "So, while bookmakers have City as favourites for the latest edition of the Manchester derby, it is a very tough one to call. And also, it would probably be unwise to read too much into the outcome.",
      "After all, despite United’s good record at the Etihad in the Guardiola years, City have won six Premier League titles in that timespan. Getting a home beating at the hands of United has rarely knocked City out of their successful stride.",
      "But a win for United in this latest encounter WOULD carry extra significance. By any means, it has not been a spectacular start to the current campaign but given he joined when a grim season was already well underway, this feels like the real beginning of the Amorim regime.",
      "The departure of Andre Onana, who has gone on loan to Trabzonspor, is starkly symbolic as the goalkeeper was one of the previous regime’s flagship signings. In contrast, for all the transfer business done by City in this year’s two transfer windows, perhaps the most significant move in or out of the Etihad in 2025 was the departure of Kevin de Bruyne.",
      "He was a flagship player of the entire Guardiola-City era. And of all the incomings, it is still hard to pinpoint one as a certainty to follow in the influential footsteps of serial winners such as De Bruyne.",
      "It still takes a huge leap of imagination to see this season marking the decline of Pep’s Premier League powers and the emergence of Amorim’s excellence. But another United victory at the Etihad would certainly bring that scenario an unlikely step closer.",
      "Sky will show at least 215 live Premier League games next season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Sky Bet offer: 50/1 odds on Man City to get 1 or more SoT against Man United",
    "tags": [],
    "link": "https://www.mirror.co.uk/betting/football/sky-bet-manchester-derby-offer-35899352",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Manchester City and Manchester United go head-to-head on Sunday evening in what promises to be a thrilling Manchester Derby in the Premier League.",
      "Sky Bet are offering NEW customers enhanced odds of 50/1 on Man City to register just 1+ shot on target! City failed to win either of their Premier League meetings with United last season, so they'll be eager to get back on track against their fierce rivals—and to return to winning ways in the league overall.",
      "City have suffered back-to-back league defeats to Brighton and Tottenham, and the fixtures keep coming thick and fast, with a huge Champions League tie next Thursday followed by a clash with Arsenal just three days later.",
      "Click here to back the offer from Sky Bet.",
      "Here is your guide on how to make the most out of this offer with Sky Bet:",
      "Here are the key terms and conditions from Sky Bet:",
      "Eligibility restriction and further T&C's apply. Please gamble responsibly.",
      "Reach plc is committed to promoting safer gambling. All of our content and recommended bets are advised to those aged 18 or over. Odds are subject to change too.",
      "We strongly encourage our readers to only ever bet what they can afford to lose. For more information, please call the National Gambling Helpline on 0808 8020 133 or visit gambleaware.org.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "LUCKHURST: Manchester United player ratings vs Man City with a 4/10 in derby defeat",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-player-ratings-vs-32473998",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United suffered defeat in the Manchester derby on Sunday as they lost 3-0 to Manchester City.",
      "Phil Foden put the home side ahead on 18 minutes as he guided Jeremy Doku’s pull-back beyond Altay Bayindir.",
      "Erling Haaland doubled his side’s lead shortly after the half time break and he nearly made it 3-0 moments later but somehow managed to hit the post with the goal gaping. Haaland ended the game as a contest midway through the second half as he raced clear of the United defence and slotted home.",
      "Here are how the players rated at the Etihad Stadium:",
      "Altay Bayindir",
      "Had a jittery early moment when the ball almost got away from him. Shrank when Haaland bore down on him to make it 2-0. 5",
      "Leny Yoro",
      "More than kept up with Doku, who switched sides to create the opening goal. Came off for Harry Maguire to improve United's goal threat. 6",
      "Matthijs de Ligt",
      "Battled competitively with Haaland until the Norwegian got between De Ligt and Luke Shaw to make it 2-0. A dodgy pass almost resulted in a goal. 5",
      "Luke Shaw",
      "Did okay in the first half but was made to look like the auxiliary centre back that he is when Haaland bulldozed past him. Sloppy for the third goal, too. 4",
      "Noussair Mazraoui",
      "A confident return on his first start since the Europa League final until he was found to be off the pace for the second goal. Substituted just after the hour. 6",
      "Manuel Ugarte",
      "A striking recall yet Ugarte was United's best player in the first half and operated at a level that was the polar opposite of his 45 minutes at Grimsby. Unable to halt City's second-half charge. 6",
      "Bruno Fernandes",
      "Guilty of failing to track the runner for another goal that United conceded three weeks after Emile Smith Rowe evaded him at Fulham. 5",
      "Patrick Dorgu",
      "Could have intercepted the switch of play which eventually led to Foden's goal. Had chances to service Sesko but his crossing was abject. 4",
      "Bryan Mbeumo",
      "Had plenty of the ball without having any impact in the first half before he was denied by a great save by Gianluigi Donnarumma. 6",
      "Amad",
      "Played on the left of the two No.10s for probably the first time and miscued a volley. Nowhere near as influential as he was here last season. 5",
      "Benjamin Sesko",
      "Asked an early question of Donnarumma and had United's only attempts at goal in the first half. Quieter in the second half. 6",
      "Subs",
      "Harry Maguire",
      "Came on essentially to improve United's goal threat. 5",
      "Kobbie Mainoo",
      "No impact. 5",
      "Joshua Zirkzee",
      "Same as Mainoo. 5",
      "Casemiro",
      "Replaced Ugarte to provide balance and missed a good chance. 5",
      "Manager",
      "Ugarte's improved performance rendered Mainoo's absence from the starting XI moot but Shaw and Fernandes in unfamiliar roles led to goals. 5",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "LUCKHURST: Man City fans' chant should worry Ruben Amorim after Manchester United lose derby",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/man-city-fans-chant-should-32474000",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester City fans unfurled banners quoting Oasis classics Live Forever and Acquiesce at kick-off: \"We see things they'll never see.\" United will be glad to see the back of this derby.",
      "After a season unbeaten against City, normality was restored against a gettable City side. As much as Pep Guardiola's squad has changed over the last 12 months, two familiar faces did the damage.",
      "Phil Foden and Erling Haaland got their first derby goals in the 6-3 drubbing in October 2022. In the absence of the stellar support cast City boasted three years ago, they were the difference again. All seven of Foden's derby goals have come within the past three years, as have Haaland's. He got his seventh and eighth in the second half.",
      "And so Ruben Amorim has another inquest to endure. United were not as supine as on past visits to the Etihad when City were in their pomp under Guardiola but this was a toothless performance from a squad that invested more than £200million in attackers alone.",
      "This was the seventh time Guardiola's City beat United by scoring at least three goals. After Ole Gunnar Solskjaer and Erik ten Hag, Amorim is the latest United manager to be heckled by City matchgoers. They did not survive for much longer.",
      "\"They're never gonna win again, they're crying in the Stretford End, the reds are going down, Ruben Amorim,\" the City fans cackled. There was also a rendition of 'Old Trafford is falling down'. The Etihad's south stand roof, only ten years old, leaked onto United supporters.",
      "This was not a defeat set to be filed with some of the drubbings City have doled out to United until Haaland's second and contest-killing goal on 68 minutes. Then United were subjected to the City fans' Poznan and a couple of choruses of \"tearing Cockneys apart again\".",
      "That this City side is a work in progress and still inflicted nearly the same margin of defeat on United as Wolves ought to worry Amorim. United are taking backward steps week after week, recording worse results than in the corresponding fixtures last season. United drew at home with Arsenal and beat Fulham and City in 2024-25.",
      "United had gone into this derby above City in the table for the first time in nearly five years. The prospect of overtaking them again this season will now feel remote.",
      "Amorim is picking players out of position and out of their depth. United do not have a first-choice goalkeeper, Luke Shaw is not a centre back, Bruno Fernandes is not a central midfielder and Benjamin Sesko is goalless after seven games for club and country. A handful of City fans heckled Sesko upon his removal.",
      "Patrick Dorgu, recalled by virtue that he is the only senior left winger in this squad, demanded Bryan Mbeumo play him the pass. He was so far offside the linesman flagged immediately. Mbeumo voiced his dismay. The chipper Dorgu offered a high five. Overpromoted and in over his head.",
      "Shaw could not keep up with Haaland for the decisive second goal. That gulf is not easy to remedy but United had specialist centre backs on their bench.",
      "Three of the seven Premier League goals United have conceded this term have been down to a midfield runner failing to track an opponent. Fernandes was the closest to Foden and Matthijs de Ligt's exasperated reaction suggested he had seen that unfold before.",
      "In six hours of Premier League football, United have scored once from open play. Mbeumo, responsible for that solitary strike against Burnley, went the closest at City.",
      "Gianluigi Donnarumma was one of the first off the City coach and James Trafford one of the last. That all but confirmed Trafford was out of the team only three games into the season and Donnarumma was worked inside four minutes by the alert Benjamin Sesko. The best was yet to come from Mbeumo's 61st-minute volley that seemed destined to bounce off the side of the net.",
      "If City have two number ones, United have three number twos and all three were in the matchday squad. Tom Heaton bullishly addressed his teammates in a pre-warm up huddle. Senne Lammens' starrier status elicited selfie requests from supporters in the City section.",
      "The broadcasters homed in on Lammens within ten minutes after more dicey goalkeeping from Altay Bayindir. The culpability for Phil Foden's goal was on the dozy Fernandes rather than the stop-gap goalkeeper. Bayindir still shrank for Haaland's one-on-one. Donnarumma, in contrast, is so big he could block out the glare of the floodlights.",
      "Until Foden's header, Amorim was bullish on the touchline. Suddenly he looked vexed, smacking his hands angrily and outstretching his arms frequently. The much-improved Manuel Ugarte did earn an ovation for his urgent pressing.",
      "This Manchester derby began with a poignant and rousing tribute to a Mancunian. The stadium announcer was on the brink of tears as he read a eulogy to Ricky Hatton that was drowned out by the din from supporters red and blue.",
      "Fernandes preached calm, possibly spooked by the swiftness of Haaland's effort that flashed wide inside the first seconds. The United captain soon offered Sesko a thumbs up for his fourth-minute pot-shot.",
      "United's approach play was so promising that Guardiola's shoulders slumped more than once. None of it amounted to a chance before Foden guided Jeremy Doku's cross in on 18 minutes.",
      "Sesko was responsible for United's only two attempts in the first 45 minutes. There were not many of much consequence thereafter. The away end started emptying long before the final shrill.",
      "They had seen enough.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "LUCKHURST: 'It is not my decision' - Ruben Amorim speaks out on Manchester United future",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/it-not-decision-ruben-amorim-32474929",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Ruben Amorim has said if Manchester United want to change their playing style they will have to change manager.",
      "United lost 3-0 at Manchester City in the first derby of the season to leave them with four points after their first four Premier League games in what is their worst start to a season since 1992-93.",
      "Amorim has overseen only eight wins out of the 31 Premier League games he has taken charge of and United are bottom of the 17-team table that consists of the league's ever-present teams dating back to his appointment.",
      "United hired Amorim on November 1 last year and he is under contract at the club until 2027 but the latest defeat is bound to fuel more uncertainty over his future.",
      "\"Guys, I understand that and I accept,\" Amorim said. \"It is not a record you should have in Manchester United. There are a lot of things - you have no idea what happened during these months - but I accept that. I am not going to change.",
      "\"When I want to change my philosophy, I will change. If not, you have to change the man. We will talk about that every game that we lose. I don't believe in that, in the system, or whatever. I believe in my way and I am going to play my way until I want to change.",
      "\"My message is that I am going to give everything. I will do everything, always thinking about what is best for the club. That was always the same message.",
      "\"It is not my decision, the rest (on whether United change manager). Until I am here, I will do my best. I really want to win games. I am suffering more than them.\"",
      "Amorim reiterated his belief United are better than last season, despite one win in five matches. They have also only scored one goal from open play in six hours of Premier League football.",
      "\"The results, again, I accept that,\" Amorim added. \"I see that we are doing better but the results don't show that. I remember last year we played in the former club against City. We won 4-1 (with Sporting in the Champions League). It was not near the opportunities, the way we control the game compared to today.",
      "\"In certain moments we were not better than City. I understand that. It is hard and the record says everything. I understand.\"",
      "United started promisingly but Phil Foden nodded past Altay Bayindir in the 18th minute and two second-half goals from Erling Haaland secured victory.",
      "Haaland bulldozed Luke Shaw for his first goal and ran from inside his own half for another one-on-one with Bayindir that he converted. Not for the first time, Amorim felt United lacked aggression.",
      "\"If you look at the goals, we can avoid that kind of goal,\" he opined. \"We have almost everyone behind the ball and we could be more aggressive.",
      "\"The second goal, in the moment of the game that we are pressing City. We suffer a goal in the throw-in when we want to recover the ball instead of covering the space and then to win the ball. We let two players of City one against one. The approach that we had in that play we can avoid and we can close our goal.",
      "\"The third goal, Haaland has all the space. A confusion with our players and then he has all the space to play. In these moments I felt that if you look at the goals, there are moments we could avoid. That is the key of the game, it's to take advantage of these moments and they took it.",
      "\"In transitions, a great shot from Bryan (Mbeumo). In those moments they were better than us.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Bruno Fernandes gives simple solution to Manchester United problem - 'We need to'",
    "tags": [
      "Man Utd",
      "Fernandes"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/bruno-fernandes-gives-simple-solution-32474939",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Bruno Fernandes has urged his Manchester United teammates to \"take more risks and be braver\" after their defeat in the Manchester derby.",
      "Manchester City secured a dominant 3-0 win at the Etihad on Sunday afternoon. Phil Foden scored the opener in the 18th minute and Erling Haaland scored a second-half brace to wrap up the victory.",
      "The pressure on Ruben Amorim increased after last month's shock defeat to Grimsby Town in the Carabao Cup, but United were able to win against Burnley before the international break.",
      "The return to action against City in the Premier League was a chance for Amorim to win successive league games for the first time, but United suffered a humiliating defeat to their rivals.",
      "\"Obviously look at what we have to do better and look to the next game. We need to score goals and not concede. We keep creating chances but were not able to score as much as we wanted. We have to be more in control. We concede three goals we could have avoided.",
      "\"When we go we have to take more risks and be more brave with the last line. When we pass to our centre-backs they go three against three and squeeze so much. The space is very narrow.\"",
      "Fernandes was asked whether United are heading in the right direction and said: \"The result is very bad, very bad on us but I think it's two ways of looking at this game. The goals could have been avoided.",
      "\"On the ball we were very positive, very brave, we were playing the ball forward. When we created chances we could have been more clean. We wanted what City got and that's the three points. City were smart to get the goals in the way they did, they have a very good team and good players.\"",
      "United are next in action against Chelsea at Old Trafford on Saturday.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Man City vs Manchester United live score and goal updates",
    "tags": [
      "Man Utd",
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-man-city-live-32472668",
    "image": null,
    "date": "2025-09-14 21:11:00",
    "source": "manchestereveningnews",
    "body": [
      "Manchester City claimed a dominant derby day victory as Erling Haaland starred in a 3-0 win over a disjointed Manchester United.",
      "The Norwegian struck twice in the second period to add to Phil Foden's first half header as the Blues pulled clear of United.",
      "Haaland almost opened the scoring inside the first 20 seconds of the contest when he flashed a shot wide, while City debutant Gianluigi Donnarumma kept out a Benjamin Sesko effort in a frantic first five minutes.",
      "The breakthrough came on 18 minutes when Foden pounced to put City ahead, guiding home a header after some mesmerising footwork from Jeremy Doku.",
      "Tijjani Reijnders forced a save from Altay Bayindir as City hunted a second, while United had their moments but couldn't fashion a truly clear cut chance in the opening 45.",
      "The Reds began brightly enough after the break but City found a second seven minutes into the second half when Haaland finished expertly from Doku's through ball.",
      "Haaland nearly had a second moments later when City capitalised on some sloppy United play, but he nudged his shot against the post having rounded Bayindir.",
      "The home side were then thankful to Donnarumma for keeping United out as the Italian produced a magnificent save to tip Bryan Mbeumo's well struck volley behind.",
      "But City put the game to bed midway through the half when Haaland raced clear from inside his own half with the United defence AWOL to slot past Bayindir.",
      "There was still time for Reijnders to miss a golden chance to make it four when he raced onto Haaland's through ball and clipped the ball over Bayindir but wide of the far post.",
      "Thanks for following the coverage with us today.",
      "As ever we will have all the best analysis and reaction across the MEN over the coming hours, including new podcasts from Manchester is Red and Talking City.",
      "Bruno Fernandes has urged his Manchester United teammates to \"take more risks and be braver\" after their defeat in the Manchester derby.",
      "Manchester City secured a dominant 3-0 win at the Etihad on Sunday afternoon. Phil Foden headed the opener in the 18th minute and Erling Haaland scored a second-half brace to wrap up the victory.",
      "The game against City in the Premier League was a chance for Amorim to win successive league games for the first time, but United suffered a humiliating defeat to their rivals.",
      "After the match Fernandes gave this verdict",
      "Pep Guardiola hailed Gianluigi Donnarumma's Manchester City debut, but the reaction from his teammates to the Italian's stunning save from Bryan Mbeumo was what pleased him most of all.",
      "The 26-year-old produced a faultless display at the Etihad, commanding his area from crosses and then making a sensational one-handed save to keep out Mbeumo's volley.",
      "After that several of his City teammates went over to celebrate with the £26million deadline day save and that reaction suggested to Guardiola that his squad are building the spirit required for success.",
      "Read what the boss had to say here",
      "Pep Guardiola said the tribute to Ricky Hatton before Sunday's Manchester derby will stay with him for the rest of his life, calling it the most intense and emotional tribute he can remember in his 10 years at the Etihad Stadium.",
      "Hatton was found dead in his home on Sunday morning and the two sets of supporters joined a thunderous minute's applause before Manchester City ran out 3-0 winners against Manchester United on derby day.",
      "The former world champion boxer was a huge Blue and was due to be at at the Etihad for the game. His boxing exploits made him a hero across the city and chants of 'one Ricky Hatton' rang out around the stadium.",
      "Guardiola looked visibly emotional during the tributes to Hatton, 46, having got to know the boxer during his decade in Manchester. He didn't speak about Hatton to the team on Sunday but was awestruck by the way the crowd reacted.",
      "Read what the boss had to say here",
      "Ruben Amorim has said if Manchester United want to change their playing style they will have to change manager.",
      "United lost 3-0 at Manchester City in the first derby of the season to leave them with four points after their first four Premier League games in what is their worst start to a season since 1992-93.",
      "Amorim has overseen only eight wins out of the 31 Premier League games he has taken charge of and United are bottom of the 17-team table that consists of the league's ever-present teams dating back to his appointment.",
      "United hired Amorim on November 1 last year and he is under contract at the club until 2027 but the latest defeat is bound to fuel more uncertainty over his future.",
      "Read what he had to say here",
      "You could feel it as well from the fans, we needed this. You always want to win the derby but you could feel it extra today. I'm so relieved, so happy we managed to do it altogether. We have to keep going. Today we're super happy.",
      "This is the Phil we need. City were waiting for this and we are going to help him as much as we can to make him as good as he was the season before last.",
      "Manchester City fans unfurled banners quoting Oasis classics Live Forever and Acquiesce at kick-off: \"We see things they'll never see.\" United will be glad to see the back of this derby.",
      "After a season unbeaten against City, normality was restored against a gettable City side. As much as Pep Guardiola's squad has changed over the last 12 months, two familiar faces did the damage.",
      "Phil Foden and Erling Haaland got their first derby goals in the 6-3 drubbing in October 2022. In the absence of the stellar support cast City boasted three years ago, they were the difference again. All seven of Foden's derby goals have come within the past three years, as have Haaland's. He got his seventh and eighth in the second half.",
      "And so Ruben Amorim has another inquest to endure. United were not as supine as on past visits to the Etihad when City were in their pomp under Guardiola but this was a toothless performance from a squad that invested more than £200million in attackers alone.",
      "Here's the match analysis from the United point of view.",
      "The mercurial Mancunian with the everyman appeal, there was only ever going to be one match winner in the derby on a day when this city lost one of its greatest ever sportsmen.",
      "Before kick-off at the Etihad, red and blue alike paid tribute to Ricky Hatton with a thunderous round of applause that left TV cameras shaking and viewers back at home feeling dizzy. The Hitman might have been a die-hard Manchester City fan, but his personality and his pugilistic prowess made him a hero across Greater Manchester and beyond. Plenty of those situated in the away end would have been present at some of Hatton's greatest nights.",
      "He was also honest about his troubles away from the ring. Hatton faced his battles outside of his sporting arena, just as Phil Foden has fought his. The boyhood City fan spoke openly and honestly in May about how he had struggled mentally at times last season with issues off the pitch.",
      "So 20 minutes after this ground had rocked to the sound of people singing about 'walking in a Hatton wonderland', it was Foden's wonderland once again. Jeremy Doku got his cross right at the second time of asking and Foden guided a lovely header beyond Altay Bayindir for his first Premier League goal in eight months.",
      "Read the full City analysis here",
      "A disappointing defeat for United and it was difficult to point to too many positives for the visitors this afternoon.",
      "Here's how we rated the United players",
      "It was comfortable in the end for City.",
      "There were encouraging performances aplenty and here's how we rated the City players this afternoon",
      "That's the final whistle at the Etihad.",
      "Foden scored the opener and Haaland scored a brace.",
      "Dominant win for Manchester City in the derby.",
      "Four minutes added time at the Etihad.",
      "That's the chant coming from the City fans.",
      "Haaland and Bernardo have just been replaced by Bobb and Ake.",
      "City are set to record a dominant victory after two bad results against Spurs and Brighton.",
      "Rico and Savinho ON.",
      "Rodri and Dorgu OFF.",
      "Another heavy defeat in the Manchester derby is staring them in the face at the Etihad.",
      "Haaland is onside because he was in his own half when the pass was played.",
      "He was never going to miss when he was one-on-one against Bayindir.",
      "Mbeumo just burst into the box but he was pushed to running the ball out of play.",
      "Mainoo and Maguire ON.",
      "Yoro and Mazroaui OFF.",
      "Mbeumo has just been denied a stunning goal by an incredible Donnarumma save.",
      "That is a lovely City move. Foden injecting some fizz into it and Doku stepping up with a second assist. He said last week he was paying more attention to his stats this season and he needed to offer more. This is a great start for him.",
      "How haven't City scored? Guardiola is shocked on the touchline. That all started with Bayindir.",
      "I wonder how many mistakes he'll be allowed to make in the coming weeks until Lammens starts?",
      "Haaland is played into the box and he finished brilliantly above Bayindir.",
      "That was a smart finish from a deadly goalscorer.",
      "Guardiola looks strangely resigned down below us. Haaland has been over to him twice this half already and United fans are sounding quite chipper in that away end, despite the scoreline.",
      "Harry Maguire has just played ball boy to hasten the restart. He is one of four subs warming up (Zirkzee, Mainoo and Casemiro are the others).",
      ".",
      "We're back under way for the second half at the Etihad.",
      "Here are City's half-time ratings:",
      "Donnarumma",
      "Commanding 7",
      "Khusanov",
      "Been tested 6",
      "Dias",
      "Fine 6",
      "Gvardiol",
      "Quiet 6",
      "O’Reilly",
      "Good 7",
      "Rodri",
      "Sloppy at times 6",
      "Reijnders",
      "One good chance 6",
      "Foden",
      "Excellent 8",
      "Bernardo",
      "Clever 7",
      "Doku",
      "Great assist 8",
      "Haaland",
      "Quiet 6",
      "Here are United's half-time ratings:",
      "Bayindir",
      "Jittery moment before the goal. 5",
      "Yoro",
      "Kept up with Doku. 6",
      "De Ligt",
      "Battled decently with Haaland. 6",
      "Shaw",
      "Fine. 6",
      "Mazraoui",
      "Confident return to the starting XI. 6",
      "Ugarte",
      "United’s best player. 7",
      "Fernandes",
      "Didn’t track Foden. 5",
      "Dorgu",
      "Stood off Silva for the switch that led to goal. 5",
      "Mbeumo",
      "Had plenty of the ball. 6",
      "Amad",
      "Miscued a volley. 6",
      "Sesko",
      "More assured and had United’s only efforts. 7",
      "That's the whistle for the break here.",
      "City lead thanks to Foden's goal.",
      "United just played a corner into the box and Donnarumma punched away.",
      "Guardiola has been unhappy with the rushed nature of City’s attacks on a couple of occasions, he would rather they slow it every now and again and put their foot on the ball. It’s been a scrappy game at times with both teams guilty of giving the ball away under little pressure."
    ]
  },
  {
    "headline": "Andre Onana suffers nightmare start to Trabzonspor career as Ederson the hero",
    "tags": [
      "Onana"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/andre-onana-suffers-nightmare-start-32475109",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Andre Onana enjoyed a moment to forget on his Trabzonspor debut as his new side were beaten 1-0 by Fenerbahce in the Turkish Super Lig.",
      "Onana joined Trabzonspor on loan from Manchester United earlier this week and was thrust straight into the team for the game against Fenerbahce, who also had a new goalkeeper with former Manchester City No.1 Ederson now at the Istanbul club following his Etihad exit.",
      "And it was the Brazilian who will have been the happier, celebrating three points and a crucial last minute save to deny what looked like a certain equaliser.",
      "For Onana, it was another difficult day and the 29-year-old could have done better with what proved to be the winner from Youssef En-Nesyri in first half added time.",
      "The Cameroon international parried out a shot from former United midfielder Fred but could not force the ball away from goal and was then slow to get up as the ball was squared for En-Nesyri to bundle home from close range.",
      "Onana was not helped by some hapless defending in the build up to the goal as Trazonspor gave the ball away cheaply and then failed to clear their lines, but it was another moment to forget for the United loanee.",
      "And the error will overshadow what was otherwise a reasonably positive showing from Onana, who made eight saves for ten-man Trabzonspor.",
      "United's decision to allow Onana to leave was influenced by the deadline day signing of Senne Lammens from Royal Antwerp, while Old Trafford chief Ruben Amorim felt Onana would benefit from being away from the pressure cooker of the Premier League.",
      "\"We saw Andre had a very, very good season in Inter,’ said Amorim.",
      "\"\"The quality is there, but we are in the club sometimes, in the moment, things are getting harder and harder. And you can be really experienced.",
      "\"But in this club, the pressure is sometimes so hard on every detail. Sometimes you need a change.",
      "\"I think we understood that he needed a change. Sometimes it's hard to point why.",
      "\"It's the performance, the moments. The bad luck in some moments was hard on him, and it was hard on us. Our thinking is to have a change in the goalkeepers.",
      "\"I wish the best for Andre. He was really good at working, trying to help the players.",
      "\"Sometimes you can have all the quality in the world, but sometimes you need to change the environment to return to your level. That was a feeling, not just from us, but also from Andre.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Brighton boss makes fresh Carlos Baleba admission amid Man United transfer interest",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/brighton-boss-makes-fresh-carlos-32474304",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Brighton head coach Fabian Hurzeler has admitted Manchester United target Carlos Baleba 'needs time' to get back to his best following an uncertain summer regarding his future.",
      "Ruben Amorim's side were in the market for a new midfielder and identified Baleba as a priority for that position. Last month, it was reported that United contacted the Seagulls - via intermediaries - to explore a potential move for the Cameroon international.",
      "Despite increased speculation, Baleba, who has three years left on his contract, remained at the Amex Stadium following the end of the transfer window.",
      "Baleba had started in each of Brighton's first three Premier League matches, but Hurzeler decided to drop him down to the bench for Saturday's 2-1 defeat at Bournemouth. In the end, Baleba came on in the 66th minute but couldn't prevent the Seagulls from losing at the Vitality Stadium.",
      "Speaking in his post-match press conference, Hurzeler acknowledge that the speculation has not been simple for Baleba to handle. \"I think it's normal for a young player when the media creates the noise around him,\" he said. \"It's not easy for this player to handle it.\"",
      "\"Therefore, we need to give him the time and support so he comes back to his best performance,\" Hurzeler continued. \"But he's a young player and I think that's something we have to accept, that young players don't always have the face we want to see.\"",
      "Although United failed to sign him in the summer, Baleba is understood to remain keen on a switch in the future. Brighton, however, are confident of keeping him for at least another season.",
      "Indeed, Hurzeler had warned off suitors before the window closed. Asked in August how confident he was that Baleba would stay, he replied: \"Very, very, very confident.\" When pressed for a reason, he said: \"Just my belief.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Gary Neville gives Ruben Amorim Man United sack timeline as pressure grows after Man City defeat",
    "tags": [
      "Amorim",
      "Gary Neville"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/gary-neville-gives-ruben-amorim-32475003",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Gary Neville believes Ruben Amorim is under pressure at Manchester United and that big questions will be asked if they suffer defeat to Chelsea next weekend.",
      "The Reds were well beaten in Sunday's derby against a Manchester City side who had lost their previous two matches. Phil Foden's first-half goal was followed up by an Erling Haaland double in the second half - resulting in a 3-0 defeat for United at the hands of their bitter rivals.",
      "Amorim's struggling squad have only managed to secure one victory this season - a narrow 3-2 win over newly promoted Burnley. United have also experienced a disastrous League Cup exit at the hands of League Two outfit Grimsby Town and are reeling from their worst season in the Premier League era.",
      "Now, former Reds captain and full-back Neville admits that there are growing concerns over Amorim's position after another abysmal defeat. He believes pressure will only grow if United suffer defeat at home to Chelsea next Saturday (5:30pm kick-off).",
      "“City have beaten them well and comfortably. United had some good moments in the game – the first 15 minutes and the first five minutes of the second half. City, in big moments, have had better players. Foden, Doku, Haaland have stood out.",
      "“There have been times when I have seen United lose this type of match when I feel angry and frustrated. I just feel nothing, which is even worse.",
      "\"This has been a nothing of a performance. United have just been beaten. With Chelsea next week, another defeat and big questions would start to be asked.”",
      "Amorim, meanwhile, has insisted that if United want to change their playing style, they will have to change manager.",
      "\"Guys, I understand that and I accept,\" he said post-match on Sunday. \"It is not a record you should have in Manchester United. There are a lot of things - you have no idea what happened during these months - but I accept that. I am not going to change.",
      "\"When I want to change my philosophy, I will change. If not, you have to change the man. We will talk about that every game that we lose. I don't believe in that, in the system, or whatever. I believe in my way and I am going to play my way until I want to change.",
      "\"My message is that I am going to give everything. I will do everything, always thinking about what is best for the club. That was always the same message.",
      "\"It is not my decision, the rest (on whether United change manager). Until I am here, I will do my best. I really want to win games. I am suffering more than them.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Ruben Amorim sack verdict given after Man United defeat to Manchester City - 'not working'",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/ruben-amorim-sack-verdict-given-32474974",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Roy Keane and Micah Richards have offered their verdicts on Ruben Amorim's future at Manchester United.",
      "The Reds were well beaten in Sunday's derby against a Manchester City team who had lost their last two fixtures after suffering their worst season under Pep Guardiola in 2024/25. Phil Foden's first-half goal was followed up by an Erling Haaland brace in the second half to hand United a 3-0 defeat at their fierce rivals.",
      "Amorim's men have won just once all season - a 3-2 victory over newly-promoted Burnley. United have also suffered a humiliating League Cup exit at the hands of League Two side Grimsby Town and are coming off their worst season in the Premier League era.",
      "But former City full-back Richards has some sympathy for Amorim - while acknowledging that the ex-Sporting boss has overseen an underperforming squad.",
      "\"But, obviously, what he is doing right now is not working. Since his first Premier League game he's got less points than some of the worst teams in the Premier League.",
      "\"If you are going to be at Man United it has to be better than that.\"",
      "Legendary former Reds midfielder Keane was then asked if Amorim will be given a season and another 'free hit' after arriving at Old Trafford in November last year.",
      "\"It's more hope than belief at this moment in time because we are watching them, we see them week in, week out,\" he said.",
      "\"Not convinced, I hope they can prove us wrong. My worry is if the players are not truly behind him in the way they are playing in this system because the results haven't been good enough. A big worry.\"",
      "United are next in action at home to Chelsea on Saturday (5:30pm kick-off UK time) before a trip to Brentford a week later.",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Amorim explains surprise Manchester United decision vs Man City",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/ruben-amorim-explains-surprise-manchester-32474131",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United boss Ruben Amorim said he has started Manuel Ugarte against Manchester City for his pressing ability.",
      "Ugarte is set to start alongside Bruno Fernandes in midfield in the Manchester derby. Ugarte was hooked at half-time in the Carabao Cup defeat to Grimsby Town and was an unused substitute against Burnley, but Amorim has decided to recall him to the starting team at the Etihad on Sunday afternoon.",
      "Benjamin Sesko is also set to make his full Premier League debut, while Amorim has persisted with Altay Bayindir in goal, which means Senne Lammens is on the bench.",
      "\"I don't know but we want to play Bruno [Fernandes] on one side, but I don't know which side we need to press higher with a midfielder. Maybe, with Case [Casemiro] or Kobbie [Mainoo].",
      "\"I think we would struggle a little bit with that and Manu can give us that but, tactical, it was to choose Manu.”",
      "Amorim added about his set-up: “We need more like a winger inside, playing inside, than an extra midfielder. That is my feeling. I think we are going to have more space behind.",
      "\"Amad playing in the national team, I saw during the week, and a lot of games he played as a no.10 in Sunderland. He played for the national team on the left so he could start on the left. We can change also, so we will see during the game.”",
      "Amorim continued: “I think a little bit, it's the responsibility. We need to recover that. We need to win every game and when we have this responsibility of winning games, sometimes we struggle a little bit.",
      "\"When you see the last games during this season, if you take Grimsby [out], you can feel like we maintain the consistency, improving in every aspect of the game. Of course, we have to score more goals as we have a lot of opportunities, and we need to do better in set-pieces.",
      "\"But you can see, even this week, it is a league of set-pieces to open the game. We need to be careful. We are going to play against a very good team.”",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Ruben Amorim drops hint on Manchester United striker Benjamin Sesko - 'Maybe against City'",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/ruben-amorim-drops-hint-manchester-32466110",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United boss Ruben Amorim has hinted Benjamin Sesko could start against Manchester City.",
      "Sesko completed a €76.5million (£66.4m), plus €8.5m (£7.3m) in add-ons, move to Old Trafford before the start of the Premier League season.",
      "Amorim decided to name Sesko on the bench for the opening league game against Arsenal, and the 22-year-old has made further substitute appearances against Fulham and Burnley.",
      "Sesko was given his first start against Grimsby Town in the Carabao Cup, but he has not started in the Premier League. Amorim was asked for his verdict on Sesko at his press conference on Friday afternoon and hinted the young striker could be given his first league start in the Manchester derby.",
      "\"I think what’s more important than looking at exactly what he did during the games, is what he can bring to our team,\" said Amorim of Sesko's first few weeks at the club.",
      "\"If you see against Burnley, he had some movements – especially inside the box – that we don't have with Josh (Zirkzee), or with (Matheus) Cunha, and even with Rasmus (Hojlund) in the past. We have a guy (in Sesko) who really likes to go inside the box to have a header.",
      "\"He can run – we need to use him more as a runner – and he’s going to improve. So we need to get used to that. It feels like the pace is different and he is going to get used to that. But maybe against City, it is a good moment for him to start the game.\"",
      "Amorim has started Mason Mount down the middle in the Premier League this season, but Mount picked up an injury against Burnley and has been ruled out of the Manchester derby.",
      "United won 2-1 at the Etihad last season thanks to Amad's heroics in the game's final minutes. \"I don't know,\" said Amorim when asked whether the win backfired by raising expectations.",
      "\"It's hard to point to a game last year that was a backfire. We had so many moments like that. We just focus on the future. We have four points. I think we should have more in this moment, but we need to be really competitive.",
      "\"It’s a very important game for everybody here, but especially for our fans, so we will try to do our best.\"",
      "When asked about potentially having more pressure on him than Pep Guardiola, Amorim responded: \"No, you cannot compare. The guy (Guardiola) is winning all the time. He can relax in not winning anymore.",
      "\"I have to prove myself every day here and I feel that. So I'm really comfortable with that and I think that every day that I come here, that I have to do better. To compare me with the situation of Guardiola? Is just a joke (laughs).",
      "\"I think we have bigger problems. We continue to have bigger problems, but we are addressing everything. And sometimes we are frustrated, angry… but we are facing all the problems.",
      "\"And we are trying to improve. And I see the team playing so much better now. We just need to be more clinical, to win more games and things are going to get easier.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Ruben Amorim could do something he has never done before at Manchester United against Man City",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/ruben-amorim-could-something-never-32470854",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United take on Manchester City in the Manchester derby this afternoon.",
      "United have made a disappointing start to the season and needed a late goal to secure a win against Burnley before the international break, but City have also won just one league game.",
      "Ruben Amorim oversaw a shock 2-1 comeback victory at the Etihad last season thanks to heroics from Amad in the game's final minutes. It was 0-0 when the two sides clashed again at Old Trafford in April.",
      "United will be without Matheus Cunha, Mason Mount and Diogo Dalot due to injury, but City have their own injury concerns, with Omar Marmoush among those to be ruled out through injury.",
      "Here are five things to look out for in the Manchester derby:",
      "Two league wins on the bounce?",
      "Amorim was appointed from Sporting Lisbon in November, but he has yet to win successive games in the Premier League. That is no surprise given how dismal last season was, but it's an unwanted record.",
      "United were excellent in the first half against Burnley before the international break and could have been 3-0 up by half-time. The Reds were wasteful in front of goal and allowed Burnley back into the game.",
      "Bruno Fernandes' penalty in the 97th minute sealed an important victory and United now have the opportunity to do something they have never done before under Amorim: win two league games on the bounce.",
      "Sesko to make his full league debut?",
      "There was a glimmer in Amorim's eye when he discussed Benjamin Sesko in the embargoed section of his press conference. Amorim was asked for his thoughts on Sesko and said: \"I think what’s more important than looking at exactly what he did during the games, is what he can bring to our team.",
      "\"If you see against Burnley, he had some movements – especially inside the box – that we don't have with Josh (Zirkzee), or with (Matheus) Cunha, and even with Rasmus (Hojlund) in the past. We have a guy (in Sesko) who really likes to go inside the box to have a header.",
      "\"He can run – we need to use him more as a runner – and he’s going to improve. So we need to get used to that. It feels like the pace is different and he is going to get used to that. But maybe against City, it is a good moment for him to start the game.\"",
      "Amorim smiled as he finished his answer, and Sesko could be set to make his full league debut.",
      "United to hammer title hopes?",
      "It would be foolish to suggest City won't win the Premier League if they lose on Sunday, but the last time City lost three of their first four top-flight games was in 1995/96 under Alan Ball.",
      "That campaign ended in relegation. That won't happen this season, but defeat in the derby could see them fall nine points behind Liverpool.",
      "That is added motivation for United this weekend. Dishing out an early blow to City's hopes of winning the league would make a win even sweeter, and City's supporters have been notably edgy in the build-up to the game.",
      "Local representation",
      "There could be no Mancunians starting in the Manchester derby. There were no local United players in the team when the two sides met at Old Trafford in April, which was the first time in a decade that was the case.",
      "Altay Bayindir will start in goal with Tom Heaton potentially not even in the squad. Kobbie Mainoo has failed to cement his place in the starting XI under Amorim but there's hope he could start tomorrow.",
      "The Premier League's Profitability and Sustainability (PSR) rules incentivise the sale of homegrown talents and local representation in Manchester derbies could be reduced even further in the coming years.",
      "Amorim's record vs Guardiola",
      "Amorim has faced Guardiola five times in his managerial career. United's head coach has won two games, drawn twice and suffered one defeat, so he has a strong record against the Catalan coach.",
      "Sporting won 4-1 against City in the Champions League just before Amorim's arrival at Old Trafford. United won 2-1 against City at the Etihad in December and drew 0-0 in the reverse fixture.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "The Manchester derby intrigue playing out 2,000 miles away after Man United and Man City transfer calls",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-derby-intrigue-playing-out-32451006",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "At around 6pm on Sunday evening most of the football chatter will be focused on the closing stages of the Manchester derby.",
      "City vs United continues to be a blockbuster Premier League fixture and the fallout from the contest will be significant, irrespective of who comes out on top.",
      "But, as the players leave the field at the Etihad Stadium, there will be a piece of the Manchester derby playing out more than 2,000 miles away.",
      "Istanbul will be the setting for two debuts that will attract the attention of United and City fans.",
      "Fenerbahce vs Trabzonspor might not be the first fixture football fans in this country look up but this weekend's clash in the Turkish Super Lig will garner extra attention due to the likely debuts of goalkeepers Ederson and Andre Onana.",
      "Both departed Manchester this month with Ederson signing for Fenerbahce on a permanent deal and Onana agreeing a loan switch to Trabzonspor. The latter has been jettisoned by Ruben Amorim while Ederson's glittering City career has ended perhaps a year earlier than most predicted with James Trafford and Gianluigi Donnarumma now in situ at the Etihad.",
      "It is the dawn of a new era for Ederson and Onana, and both will be hoping for a winning start and an error-free debut.",
      "Onana's time at Old Trafford has been characterised by glaring mistakes while Ederson will want to hit the ground running for a side that expects to challenge for the title.",
      "The pair faced off five times in Manchester derbies - Stefan Ortega started for City in the FA Cup final which United won. The most recent was April's stalemate at Old Trafford, and you'd have got long odds on both being out of the picture just five months later.",
      "On a day where their Manchester allegiances meet at the Etihad, Ederson and Onana will come up against each other once again.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Man United's Bruno Fernandes gives candid response when asked the one thing critics get wrong about him",
    "tags": [
      "Fernandes"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-uniteds-bruno-fernandes-gives-32469126",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United midfielder Bruno Fernandes was asked what critics get wrong about him and responded: \"Nothing.\"",
      "Fernandes is regarded as the best signing of the post-Sir Alex Ferguson era. The United captain has produced remarkably consistent performances since signing from Sporting Lisbon in January 2020.",
      "The Portugal international won the Sir Matt Busby Player of the Year award for a fourth time last season, joining David de Gea and Cristiano Ronaldo as the only other players to have won the award four times.",
      "Fernandes attracted interest from Saudi Arabian club Al-Hilal in the summer transfer window, but he turned down a lucrative offer to remain in the Premier League.",
      "The United captain is hoping to lead his team to victory against Manchester City this weekend. Speaking ahead of the Manchester derby, Fernandes gave a candid interview to BBC Sport where he was asked: \"What is one thing people get wrong about you?\"",
      "Fernandes responded: \"Nothing. People have an opinion about me and I can't change that. That's the way people want to judge you about what they see on the pitch or the television or interviews.",
      "\"I can't change that. They have the freedom to think the way they want about me, as I have the freedom to think about them. I don't judge people until I know them.",
      "\"They can have an opinion about me, that's fine - we all have an opinion, and that's why life is so good and so different. If we all think the same way it would be so boring.\"",
      "Fernandes was asked what he believed to be the toughest part of football, replying: \"Being consistent, I think. During 90 minutes, you have to be so consistent in everything you do,\" he said.",
      "\"Sometimes it slips away from you and it can change everything. So I think consistency in the first thing - consistent in doing whatever you think is the best for the team, because that has to come first of everything and you can't do anything without thinking of the team first.",
      "\"That's true in football, and it's what has to come above everything because there's nothing more important than the team. And then it comes to yourself to put yourself in the best position to help the team.",
      "\"And when I'm on the pitch, that's the thing that I have most in my head - to do my things will help the team to become better so I have to. I have to be the most consistent and accurate player I can be in any moment of the game, not with the ball, but also without the ball.",
      "\"But also in some things that you have to say to your teammates when you want to change something position-wise, changing set-pieces as to be accurate because if little things change, it can go against you.\"",
      "When asked whether he gets nervous in games, Fernandes said: \"No, never. During the games? No. Before the games I can get nervous. During the game I just think about the goal we have for the game, which is to win.",
      "\"I remember every step that we have trained and that my teammates have to do and I remember every position they have to do.",
      "\"When I go to a training session I focus not only on what I have to do but what is around me because it can change, I have to play a different position or a teammate could not be aware of where he has to be or which position he should stay.",
      "\"On set-pieces, I know exactly where everyone has to be. The only nervous thing is getting everything into my memory so I can remember in the game every step.",
      "\"Also, when I'm on the ball I know every movement my teammates have to do. To be aware of, 'I'm on the ball here so this is what we trained' - but you have to think that in a split second.",
      "\"It gets automatic because I think about that during the week until the game. When you think so many times about something your muscle memory works by itself.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "'What is that?' - The 'unacceptable' and shambolic Manchester derby that couldn't go ahead",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/what-that-unacceptable-shambolic-manchester-32450945",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "The eyes of the world always fall on the Manchester derby.",
      "It's a gigantic game whatever the circumstances and this weekend's Premier League meeting between City and United promises to be intriguing and enthralling in equal measure.",
      "But whatever the outcome, it is unlikely to rival the farcical scenes that caused the abandonment of a fixture between the two sides nine years ago.",
      "The two teams were due to contest the first Manchester derby outside the UK in the International Champions Cup in China during pre-season in 2016.",
      "Except the game was called off, leaving 50,000 fans and a worldwide TV audience disappointed and Pep Guardiola furious.",
      "Heavy rain and thunderstorms at the Bird's Nest Stadium in Beijing meant the contest was called off due to the shambolic state of the pitch.",
      "Torrential weather had destroyed the playing surface, while a fungus problem meant large sections had been dug up only for the newly-laid grass to be washed away by the incessant rain.",
      "It all added up to farcical scenes and prompted anger from both clubs, with Guardiola in particular not holding back.",
      "“The pitch was unacceptable,\" he blasted in the aftermath of the abandonment. “We don't travel all the way to China just for holidays or a training session.",
      "“We came to play two friendly games so I think it was the first time a game has been cancelled here. They are looking for hotels, inviting players, but at the end, if the pitch is not good enough, all that doesn't matter.",
      "“For them, the pitch doesn't matter, but for us it's the most important thing. All the players and the coaches want to play as well as they can.",
      "“Maybe there was a concert on the pitch 10 or 15 days before. Our groundsman was there for 10 days to try to take care of the pitch.",
      "“It wasn't the water, it wasn't the rain. It was just the state of the pitch.",
      "“We have played in really bad conditions in our careers, but that pitch two days ago was impossible to play on. It wasn't just about avoiding injured for the players, it was about the fans. They buy tickets to watch players of quality from City and United.",
      "“But if we had played on that pitch, the fans would have said 'what is that game?' because it was unacceptable.",
      "“The pitch [turf] would have moved two metres. Believe me, it was the right decision not to play on it.”",
      "Both sides had expressed concerns about the surface in the build-up to the contest, with United boss Mourinho fearing injuries.",
      "“If it was already a friendly then it becomes a double friendly because [the message is]: no injuries, play calm, play safe, go home, keep the preparation next week,\" he said.",
      "“They are no conditions to play a good game of football, but we have to play. We cannot just run away and disappear and not play. So we have to play and try to be lucky.",
      "“Normally when you say lucky you say lucky because you want a good result. The result I want tomorrow is to go home without injuries and that is the luck I want.”",
      "Even the worst of the Manchester weather this weekend wouldn't compare.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Manchester United predicted line-up vs Man City as full league debut given and Mainoo call made",
    "tags": [
      "Man Utd",
      "Mainoo"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-predicted-line-up-32470635",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Ross joined the MEN in August 2021. He was appointed Sport Content Editor in February 2022.",
      "After a poor start to the campaign, Manchester United have the opportunity to record back-to-back Premier League wins when they face Manchester City this afternoon.",
      "A draw with Fulham was sandwiched between defeats to Arsenal and Grimsby, heaping even more pressure on Ruben Amorim after a heavy summer of spending. There was some speculation that Amorim might not be the United boss come the end of the international break - with such talk intensifying after he refused to confirm he would still be at Old Trafford after the pause - but a dramatic win against Burnley improved the mood at Old Trafford.",
      "Next up is a trip to the Etihad, with local bragging rights up for grabs as well as a crucial three points.",
      "Amorim has already confirmed Altay Bayindir will start in goal, meaning Senne Lammens will have to wait to make his debut for the club. Leny Yoro, Matthijs de Ligt and Luke Shaw seems the logical back three.",
      "Diogo Dalot's injury means Amad is a shoo-in to start at right wing-back, with Patrick Dorgu on the opposite flank. Casemiro seems certain to start in midfield, and injuries further forward could allow Kobbie Mainoo the chance to start alongside him with Bruno Fernandes pushed forward into a No.10 role.",
      "Bryan Mbeumo can start in the other position behind the striker, with Benjamin Sesko set to be handed a full league debut for United as they aim to take advantage of a City defence that continues to look shaky.",
      "Predicted United XI: Bayindir, Yoro, De Ligt, Shaw, Amad, Casemiro, Mainoo, Dorgu, Mbeumo, Sesko, Fernandes",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "I was released by Man City - so I drove around the corner and signed for Manchester United",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/i-released-man-city-drove-25026449",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Few footballers would dare cross the divide between Manchester United and Manchester City.",
      "There have been many people who have played football for both teams, but very few have ever made the direct switch between the two clubs - Denis Law and Carlos Tevez are the most notable for directly swapping red for sky blue - but for one young defender in 2012, that is exactly the brave decision he made.",
      "It was deadline day. The summer transfer window was drawing to a close and Frederic Veseli decided it was time for a change, given he had no clear pathway to the first team on the blue side of Manchester.",
      "The promising defender had spent three-and-a-half successful years at City but he wanted to move to a club where there was a real opportunity to make it. He didn't have to look far.",
      "\"These days, Manchester City are chasing titles and major trophies,\" his former agent Adam Bouskouchi stated. \"It is difficult for them to have faith in youth because they obviously feel experience is the best way for them to get where they want to go. But that attitude didn't help Freddie, who just felt like he wasn't progressing.",
      "\"Freddie spoke with several clubs, here and abroad. But he wants to be a top player in England, and when Sir Alex spoke to him, it made such an impression.",
      "\"He is a difficult man to say no to and his track record was enough for Freddie to feel he was making the right choice to join United.\"",
      "United had already tried once to sign the highly-rated defender, but like many other top teams in Europe, were beaten to his signature by the Blues. City were huge admirers of the talented teenager and struck a contract agreement with Veseli prior to his involvement with Switzerland at the Under-17 World Cup back in 2009. It proved to be a masterstroke.",
      "The youngster would lead his country of birth to glory in the youth competition. He was a World Cup-winning captain at the age of 16, but any side looking to sign him up had already missed their chance.",
      "“To win the Under-17s World Cup was a great achievement because we may not have had all the best players in the tournament but we had the best team and Frederic epitomised that spirit.",
      "“He was accepted as the leader of that side because it was all about the team and not himself. He had absolutely no attitude about being the star. For him, it was all about how the team performed.",
      "“He was a very good captain who helped the side become champions.”",
      "Switzerland won all seven of their matches on their way to glory, defeating Italy, Brazil, Germany, Mexico, Japan, Colombia and Nigeria in the final in front of 60,000. After their triumphant victory, Veseli completed his move to Manchester, initially moving over with his father, though once his son had settled, he moved back to Switzerland.",
      "City organised for him to move in with a local family, who just so happened to be massive fans of the club. They also looked after former striker Alex Nimely, taking the duo to watch the Blues whenever possible.",
      "Despite some apprehension about his new environment, Veseli settled well on the football side of things and was soon promoted to the reserve side, while he often trained with the first team in order to aid his development. The youngster was progressing well, but thought he should be getting more opportunities given the work he was doing. He would have got one too, if not for an unfortunate injury.",
      "\"[Roberto] Mancini told me I would make my first-team debut in the final league game of the season and called my family,\" Veseli told The Athletic. \"But I tore my hamstring on the Tuesday. I was devastated.\"",
      "That setback deprived Veseli of his chance in the first team — one that he would never get again. City would at least give him a place on their pre-season tour to the United States, but it looked like paperwork would get in the way this time.",
      "\"I went to America pre-season with City, but that almost didn’t happen because my passport was not a biometric one. The reserve manager told me I’d have to stay with them, but Mancini told me they’d wait for me and not take another player.",
      "\"I went to the passport office and told them the whole story – they got me a new one in two days. I then went to the US embassy, which was complicated. It’s not easy there.\"",
      "Veseli missed out on the chartered flight and ended up heading economy to Chicago, a small price to pay for him if it was going to be his breakthrough moment in professional football.",
      "It was a productive summer for him, but also one for City as well. Sergio Aguero, Samir Nasri and Gael Clichy were the big signings, while their need for defensive reinforcements wasn't addressed by promoting youngsters, but by the signing of Stefan Savic.",
      "As he entered his final year at the club, Mancini made it clear he wanted to agree to fresh terms with the promising defender, while Veseli made it clear he was happy to stay around if a career pathway could be established, allowing him to leave on loan and get playing time elsewhere.",
      "\"We could never agree terms. Mancini would ask me all the time what was happening. I carried on playing. I played against United’s reserves who had Ole Gunnar Solskjaer as manager.",
      "\"United had a lot of first-teamers, we had reserves only and we drew 1-1. Fergie was there watching. I had a really good game.\"",
      "Veseli's performance in front of the legendary United manager had certainly raised interest in his signature, but it wasn't until a chance meeting at a pub that the wheels started to turn. Having gone to pick his girlfriend up from her local, the defender bumped into United assistant Rene Meulensteen, where conversation quickly turned to football, and in particular his situation at City.",
      "The Blues were eager to establish a new identity in English football, starting with a rejuvenated youth system. Brian Marwood, then football administrator, made it clear that any youngster unhappy at the club was free to leave rather than potentially disrupt the balance.",
      "It certainly piqued the interest of Meulensteen when he learned Veseli was free to leave, even though Mancini was eager to keep him.",
      "\"Mancini was disappointed and was always asking me to renew. I didn’t know what to say to him. My contract was up and City released me and signed a paper saying I could leave on a free.",
      "\"The next day, I drove to City’s training ground at Carrington to collect my stuff. I didn’t tell anybody what I was going to do next. I told the gaffer that I was leaving the club and he asked me where I was going. I told him: “United”. He couldn’t believe it, but he had to take training. He wished me good luck.\"",
      "Up until that point, United's only transfer business had been the shock re-signing of Paul Scholes, which was marked with a Manchester derby appearance at the Etihad just hours after he signed a contract. Two weeks later, they would once again raid the other side of the city, formally announcing the signing of Veseli on a free transfer on deadline day.",
      "At the time, Veseli said: \"I am very happy and it is an honour to sign for Manchester United. I can’t wait to get started, to work hard and do everything I can to help the team. I am looking forward to showing everybody what I can do on the pitch.",
      "\"I am very thankful to Sir Alex Ferguson for bringing me to such a great club. Manchester United has a long history of younger players coming through and hopefully I can follow and do the same.\"",
      "That clear pathway for youth talent is what had influenced Veseli to switch clubs in the city, with the defender believing that City were overly focused on trying to win major trophies and establish their new stature rather than nurturing any young players.",
      "Mancini's eventual title triumph at the end of the season would vindicate their stance, though United were eager to make their noisy neighbours pay.",
      "Here was one of the top talents in world football who, despite stagnating in recent times, still represented huge potential and any success would be utter humiliation at the expense of their local neighbours. Ferguson never acknowledged the true nature of Veseli's move to United, which began with that chat in a Wilmslow pub, though.",
      "\"It actually came about by chance, that,\" Ferguson insisted when he spoke to MUTV. \"A member of our scouting department came and told us City had released this young lad from Switzerland and they'd watched him playing a couple of years back.",
      "\"There was nothing to be lost. We thought we'd give him until the end of the season and see how he does. Hopefully he does well.\"",
      "United assigned Veseli extra training when he signed, telling the youngster he was not at the required fitness level to even train at the intensity they would demand from him.",
      "\"City had loads of big names and would become champions, but United were already champions. The energy was different, the aura. I fell in love with it straight away.\"",
      "Veseli continued to train with the United first team frequently but was not afforded as many opportunities at reserve level as he had been getting with City. In the time since his masterclass in front of Ferguson a year earlier, Solskjaer had left to manage Molde and been replaced by Warren Joyce.",
      "It was a hugely talented squad, consisting of future first-team stars Paul Pogba and Jesse Lingard, along with Michael Keane, Sean McGinty, Reece Brown, Scott Wootton and Tom Thorpe, giving tough competition at centre-back - it is perhaps little wonder things never exactly worked out.",
      "Despite his limited game time, Veseli was once again named in a pre-season tour squad, this time the United one that headed to South Africa and China. But just like at City it never resulted in first-team opportunities.",
      "The youngster returned to reserve action in a versatile role, playing predominantly as a right-back for the first half of the season, before switching to a defensive midfield role at the turn of the year. It was in this midfield role where he enjoyed his best run in the team, playing the entirety of matches most weeks, before another unfortunate injury cut short his season in April.",
      "\"I did my hamstring against Spurs reserves. Fergie had already told me I could leave as I hadn’t made the first team. He said I could stay for another year if I wanted, that he was happy to help me find another club; and that I could leave on a free.\"",
      "There was a host of interest from the Championship, with Leicester, Burnley, Barnsley and Ipswich all making offers to sign him, while Italian side Udinese were also keen.",
      "The Ipswich chief scout confided in close friend Wayne Rooney about the United youngster and after some glowing feedback, a deal was quickly struck. Mick McCarthy's side had won the race to sign a centre-back still highly regarded, despite a difficult five-year spell in Manchester.",
      "Things never worked out at Portman Road, but Veseli did shine on loans at Bury and Port Vale, eventually signing permanently for the latter in January 2015, a deal he sorted himself, having sacked an inexperienced agent.",
      "By the end of the season, he was on the move again. Having fallen out of love with the game, he headed back to Switzerland to study law at university before being offered a trial with Swiss side Lugano to revive his career.",
      "Things went well, and soon they would get even better. Born in Switzerland to Albanian parents from Kosovo, Veseli accepted a call-up to the Albania national side while at Lugano, eventually being named in their squad for Euro 2016.",
      "\"The best thing ever. I came on against France in Marseille. Wow. 50,000 Albanians were there, our first-ever appearance in the Euros. I was so proud. I knew the words to the national anthem. My parents were there, I was getting goosebumps for every game. We went back to Albania and were treated like kings. We were given a diplomatic passport, which means I don’t have to queue in airports.",
      "\"A year earlier I couldn’t get a team.\"",
      "But, just as before, the good times wouldn't last long. Veseli became locked in a contract dispute with Lugano that saw them refuse to sell him and insist they had the right to trigger a contract extension that would see him earn far less money than he could get elsewhere.",
      "He sought the advice of a lawyer and was finally freed from his contract, eventually signing for Serie A side Empoli before Lugano once again took legal action, this time suing the defender. Veseli was unable to play for two months before his name was finally cleared.",
      "From there, he spent time on loan at Le Mans before returning to Italy with Salernitana, helping them earn promotion to Serie A. It was another incredible experience with a bittersweet ending, with Veseli only making nine appearances in the 2021/22 season due to injury and illness.",
      "Since his exit from Salernitana in 2022, he has spent time in Serie B with Benevento, had a year in Turkey with Fatih Karagümrük and then moved to Albania with Egnatia.",
      "A move back to Italy with Serie B side Südtirol would follow, and their 2025/26 season has started well having taken four points from their first two outings.",
      "After five different clubs in three years, Veseli will hope he has finally found somewhere he can call home.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "I was the forgotten Manchester United Class of 92 star - so I went to Man City and made history",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/forgotten-manchester-united-class-92-31358237",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "An impudent flick got the Old Trafford crowd off their seats, a peach of a cross from Paul Scholes' through ball carved an opportunity for Ryan Giggs, and seconds later the ball was in the net.",
      "Half an hour in and Manchester United looked to have uncovered another academy gem to go with the flurry of Fergie fledglings already beginning to make a name for themselves in the first team. It was September 1995, the famous 'you'll never with anything with kids' season, and the newest kid on the block was Terry Cooke.",
      "The Brummie winger produced a man of the match display on debut as Bolton were beaten 3-0 and left to warm applause from the home fans when he was replaced in the final quarter. Starting on the right alongside a clutch of his fellow Class of 92 graduates, Cook seemingly had the world at his feet. Yet that autumn afternoon would be his only league start for United.",
      "“After my debut I thought that was it, I’d done it,\" he said, recalling the moment. \"Then, the next week, I didn’t play. I was in squads and made a few more appearances and then I went to Sunderland on loan. I played for two championship-winning teams in the same season and never got a medal. That summed up the way my career went. It was very frustrating.\"",
      "United won the league in 1996 with a core of young players Cooke called friends and teammates coming through the ranks. But while David Beckham, Scholes, Nicky Butt and the Neville brothers became household names, Cooke's career was hampered by injury and ill-fortune, a serious injury in a reserve game against Sheffield Wednesday the following season severely hampering his progress.",
      "\"I was stretchered off and, in the dressing room, Alex Ferguson asked if I would be alright for Saturday, because I was going to be starting in the Premiership,\" he said, speaking in 2014.",
      "\"I had been playing well. I didn’t know what I had done, I thought I had twisted my knee and then the physio turned round and said I wouldn’t be playing for the rest of the season. I’d snapped my cruciate.”",
      "He didn't return until early in the 1998-99 season and while United went on to win the Treble in an unforgettable campaign, Cooke joined Wrexham on loan. An impressive festive showing against Manchester City in the third tier prompted Joe Royle to come in for the winger and he swapped red for blue, first on loan and then in a permanent move.",
      "A few months later he was on the wing for City at Wembley in that famous comeback play-off final victory over Gillingham, netting a spot kick in the shootout success. That was a sliding doors moment for the Blues and kickstarted their rise back up the divisions.",
      "It came four days after Cooke's pals at United had lifted the European Cup. The winger may have even been in the squad had he stayed put, but a desire for first team football and to make up for lost time prompted his exit and he was now creating history for himself on the other side of Manchester, an achievement in itself after his injury misfortune.",
      "“I was told I’d never play again,\" he said in 2020 when recalling his move to Maine Road. \"I was out for 12 months and wanted to get back on my feet, so I went to Wrexham for a month.",
      "“I did okay, but my best game was on Boxing Day ’98 against City, even though we got beat 1-0. Joe Royle must have found out my loan period was coming to an end and, at the time City didn’t have an out-and-out right winger. I think I was the missing piece in a way.",
      "“Joe enquired about bringing me in on loan. I could have stayed at United and been part of the squad going around Europe, but I was a young kid and I wanted to play football.",
      "“I came to Maine Road – playing in front of a full house every week even in the second division – and the rest is history.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "I had a party after Man United's horrible 6-1 defeat to Man City - I should have cancelled",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/party-after-man-uniteds-horrible-32467431",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Cast your mind back to October 23, 2011 - Manchester City fans were in a jubilant mood as they left Old Trafford, having thrashed Manchester United 6-1 at Old Trafford in the Manchester derby.",
      "It felt like a real turning point for both clubs and the city of Manchester - with the final result one of the worst of Sir Alex Ferguson's tenure at the club. United legend, Wayne Rooney, was on the pitch that day and has lifted the lid on the aftermath of a dismal result.",
      "Speaking on the Wayne Rooney Show, the former United star said: \"I think that was a big moment for City back then - because you could feel City coming up and getting closer to us. But to come to Old Trafford and win 6-1, I think that was a statement.",
      "\"I remember being on the pitch and it was horrible. It was like the second half just felt like it was goal after goal, and you're just like; 'Oh, get me off this pitch'.\"",
      "A brace from Mario Ballotelli gave the visitors a 2-0 lead at the hour-mark, celebrating by revealing the infamous 'Why always me?' t-shirt, with Sergio Arguero adding a third in the 69th minute. Darren Fletcher would reduce the deficit in the 81st minute, before an Edin Dzeko brace and David Silva goal in extra-time made the result even more embarrassing.",
      "\"After something like that I'd usually just go home. But I had a birthday party. Joe Hart, Gareth Barry and a few of the City players were invited to my birthday party,\" Rooney said.",
      "\"You've got family, friends, everyone who's made their own plans to come. I was like; 'I can't cancel it' so I went.",
      "\"We've got the United lads, and some of the City lads sat there. I think it was me, Crouchy [Peter Crouch], Harty [Joe Hart] - we all got up and did a song of Backstreet Boys. Looking back, I should have cancelled, but it was the friends and family who'd all booked the time off and got the babysitters and stuff.\"",
      "Months before, Rooney had been the star of the show, scoring that iconic overhead kick to give United a late 2-1 win in February 2011, winning the Premier League Goal of the season award in 2011.",
      "\"I was so bad in that game. It's one of the worst games I've ever played. I couldn't control a ball,\" Rooney added.",
      "\"I think it's more of an iconic goal because it's in the derby, you score and win the game 2-1. But you don't practise overhead kicks.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Amorim: I see United record and accept any decision that comes",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11095/13431291/ruben-amorim-accepts-any-decision-as-man-utd-worries-deepen-after-heavy-defeat-in-manchester-derby",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-ruben-amorim-man-utd_7020797.jpg?20250914192205",
    "date": null,
    "source": "skysports",
    "body": [
      "Ruben Amorim forced to defend system once again as he refuses to deviate from favoured formation; Man United lost 3-0 to Man City in the derby, as Amorim's side suffer worst start to a Premier League campaign for 33 years",
      "Sunday 14 September 2025 21:45, UK",
      "Ruben Amorim said he accepts \"any decision\" taken in the wake of Manchester United's latest punishing defeat, this time in the Manchester derby, as his record at the club took another significant hit.",
      "United's four points from as many games this season means the club have made their worst start to a Premier League campaign for 33 years, while Amorim himself now has the unenviable record of the worst win percentage of any Man Utd boss since the Second World War.",
      "To make matters worse, and illustrate the situation most starkly, since Amorim was appointed last November, United have amassed the least points of any ever-present Premier League side - averaging one per game, with a -13 goal difference.",
      "\"The performance was not good,\" he said after a 3-0 defeat to Man City. \"In the important moments, they were better than us.",
      "\"I'm trying to be rational. I see the record. I understand the frustration and I understand the decisions that come with that. I take the critics. That's it.\"",
      "When asked what message he might have for angered fans, many of whom left well before the final whistle at the Etihad, he said: \"My message? I will do everything. Always thinking about what is best for the club.",
      "\"Until I'm here, I'll do my best. The rest is not my decision. I'm suffering more [than the fans].\"",
      "Much of the criticism levelled at Amorim involves the rigidity of his 3-4-2-1 system, and his vow never to deviate from a framework that, so far, has served his players poorly.",
      "Both balance and consistency are proving tough to come by, but the Portuguese was resolute in defence of his style once again after the derby defeat.",
      "\"There are a lot of things that you have no idea what happened during these months, but I accept that. When I want to change my philosophy, I will change. If not, you have to change the man.",
      "\"And we talk about that every game that we lose. I don't believe in that in the system or whatever. So I play my way and I'm going to play my way until I want to change it.",
      "\"I understand how football is and the results dictate the narrative. I see it that way. I know that is hard for people. The fans do not want to hear these things. I don't lie to myself. I see the record and I accept any decision.\"",
      "\"I think there will be some pressure applied to the manager and his rigidity of sticking with the system,\" said Neville about the ramifications of the loss to City.",
      "\"City have beaten them well and comfortably. United had some good moments in the game - the first 15 minutes and the first five minutes of the second half. City, in big moments, have had better players. Foden, Doku, Haaland have stood out.",
      "\"There have been times when I have seen United lose this type of match when I feel angry and frustrated.",
      "\"I just feel nothing, which is even worse. This has been a nothing of a performance. United have just been beaten.",
      "\"With Chelsea next week, another defeat and big questions would start to be asked.\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "'Not good enough!' | Richards and Keane discuss Amorim's 'worrying' Man Utd record",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/video/33653/13431315/micah-richards-and-roy-keane-discuss-ruben-amorims-worrying-managerial-record-at-man-utd",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-super-sunday-manchester-derby_7020832.jpg?20250914195706",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 20:05, UK"
    ]
  },
  {
    "headline": "'I'm not going to change!' | Amorim in defiant mood after Man City loss",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/video/36394/13431290/best-of-ruben-amorim-s-press-conference-post-man-uniteds-loss-to-manchester-city-im-not-going-to-change",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-football-amorim-man-utd_7020800.jpg?20250914192444",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 19:32, UK"
    ]
  },
  {
    "headline": "Haaland shows who is boss: Premier League Hits and Misses",
    "tags": [
      "Premier League"
    ],
    "link": "https://www.skysports.com/football/news/11095/13431126/erling-haaland-shows-who-is-boss-in-manchester-derby-as-liverpool-leave-it-late-again-premier-league-hits-and-misses",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-erling-haaland-man-city_7020646.jpg?20250914175056",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 20:36, UK",
      "",
      "Four games into his fourth season in English football, there is already no player to have scored more Premier League derby goals than Haaland. It is eight for him against Manchester United in the competition and five goals in four games in total this season.",
      "On the day that some eyes were cast down the road towards Turf Moor in the hope of a glimpse of Alexander Isak, increasingly heralded as perhaps the best striker in the Premier League, this was a reminder that he is not even the best Scandinavian striker.",
      "While Isak was made to wait for his Liverpool bow, Haaland took centre-stage against United with a marauding performance that took the game away from their great rivals in the second half. Haaland scored two with only the post preventing a hat-trick.",
      "His two finishes were different but equally emphatic. Fresh from putting five past Moldova for Norway, he looks sharp again, showcasing the sort of firepower that took City to two titles. With Phil Foden also impressing, it was a reminder of their prowess.Adam Bate",
      "Four games in, and this Liverpool team can be interpreted in different ways. Some say their late heroics are the sign of champions. Others would claim they are papering over the cracks of some unconvincing displays.",
      "It is the same with their transfer window just gone. Adding the likes of Alexander Isak and Florian Wirtz looks attractive on paper. But has revolutionising the full-back, left wing and striker positions meant a huge rebuild as well?",
      "So far this season, Liverpool have either looked unconvincing in attack or have been shipping goals at the back, but they've still won every Premier League game after losing the Community Shield to Crystal Palace on penalties.",
      "It's a frightening prospect - Liverpool are still winning despite Arne Slot saying they will get better from here. But there are no guarantees of that.",
      "First of all, Liverpool's fixture list is getting more condensed and no less difficult. They've already picked up wins over Newcastle and Arsenal but they face Atletico Madrid, Manchester United, Chelsea, Real Madrid and Manchester City before the November international break.",
      "That run also includes trips to Brentford and Crystal Palace, plus there is next weekend's Merseyside derby against Everton.",
      "And while Alexander Isak will ultimately bring a huge amount of quality to this team, he is starting the season four weeks behind schedule fitness-wise. It may take some time to see the full value of the £125m striker.",
      "The next eight weeks will ultimately be crucial for Liverpool's season.Sam Blitz",
      "The last time Scott Parker faced Liverpool, his team shipped nine goals and he was sacked three days later.",
      "It's no secret that he has to convince many doubters he's worthy of a seat at the top table of management following his previous Premier League stints.",
      "However, although the sharp looks remain the same, there is something different emerging: substance.",
      "This isn't the same Parker that arrived in the Premier League lacking in realism. The Burnley Parker has learnt things that the Fulham Parker and the Bournemouth Parker missed. He's taken the bruises of those experiences and turned them into something closer to a blueprint. There's a tactical flexibility to Parker now.",
      "The pragmatism and defensive unity his Burnley team showed for 94 minutes against Liverpool is going to be key to their survival. Parker knows this now and you'd be hard pushed to see a better organised defensive showing from a team all season. They were exemplary.",
      "This could just be the Premier League job where Parker proves everyone wrong.Lewis Jones",
      "Ruben Amorim remains defiant about his unwillingness to deviate tactically but that now feels like a tactical decision in itself. He knows that he has gone too far down this path to have any credibility if he abandons his idea. He is on this journey to its end.",
      "\"There are a lot of things that you have no idea what happened during these months, but I accept that,\" Amorim said in his press conference. \"I am not going to change. When I want to change my philosophy, I will change. If not, you have to change the man.\"",
      "The problem is that football management is a confidence trick. The players need to believe and there is little reason for them to do so. Eight wins from 31 games means no team in the Premier League who has been there throughout his reign have fewer points.",
      "Against Manchester City, they were in it until the 53rd minute but once it unravelled the frailty was evident, the midfield overrun. Bruno Fernandes was again forced into a deeper role from which he struggled to influence things. Square pegs, round holes.",
      "Benjamin Sesko cut an isolated figure on his full Premier League debut and Patrick Dorgu, the specialist wing-back recruited for that particular role on the left, was not efficient enough with his crossing to threaten the City back line as he might have done.",
      "Amorim saw positives. \"I see that we are doing better, but then the results do not show that.\" He again held up the Arsenal defeat as proof that his way can work. But when even losses are viewed as progress, one is entitled to ask where he is leading them.",
      "United have never had a worse start to a Premier League campaign than this. And yet, that hardly feels shocking anymore. Amorim insists he is suffering more than anyone. The problem for United is that the evidence of that suffering ending remains paper thin.Adam Bate",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "'I'm worried' | Neville voices concerns over Amorim’s system",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/video/30998/13431278/im-worried-neville-questions-amorims-system",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-united-systems_7020802.jpg?20250914192552",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 19:32, UK"
    ]
  },
  {
    "headline": "Man Utd latest: Worst boss since WW2? The damning stats of the Amorim era",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/live-blog/11667/13025492/man-utd-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
    "image": "https://e0.365dm.com/25/03/768x432/skysports-ruben-amorim-man-utd_6844390.jpg?20250302164812",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 20:14, UK"
    ]
  },
  {
    "headline": "Keane: Haaland was excellent... he's Championship level now!",
    "tags": [],
    "link": "https://www.skysports.com/football/video/30998/13431272/roy-keane-praises-erling-haalands-great-manchester-derby-performance",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-football-premier-league_7020766.jpg?20250914190735",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 19:11, UK"
    ]
  },
  {
    "headline": "Neville and Keane worry about United future",
    "tags": [],
    "link": "https://www.skysports.com/football/news/11095/13431225/ruben-amorim-gary-neville-says-manchester-united-head-coach-is-now-under-pressure-after-derby-defeat-to-city",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-ruben-amorim-man-utd_7020801.jpg?20250914192552",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 20:11, UK",
      "Gary Neville believes the pressure is now on Ruben Amorim as Manchester United head coach and another defeat to Chelsea next week would create \"big questions\".",
      "United suffered a 3-0 Manchester derby loss to rivals City to sit firmly in the bottom half of the table, with little evidence to show that the club can improve on last season's 15th-place finish.",
      "Four points from their opening four games means United have made their worst start to a Premier League season in 33 years.",
      "Amorim's side have also exited the Carabao Cup after a humiliating second-round loss to League Two Grimsby Town, which means United are set for their shortest ever season in terms of games played.",
      "\"I think there will be some pressure applied to the manager and his rigidity of sticking with the system,\" said Neville about the ramifications of the loss to City.",
      "\"There have been times when I have seen United lose this type of match when I feel angry and frustrated.",
      "\"I just feel nothing, which is even worse. This has been a nothing of a performance. United have just been beaten.",
      "\"With Chelsea next week, another defeat and big questions would start to be asked.\"",
      "Neville also believes Amorim will in \"in trouble\" if United are still stuck in the bottom half going into October.",
      "\"Man Utd are 14th, we're only four games in,\" said Neville.",
      "\"We can't be getting into October where Man Utd are 14th or 15th in the league otherwise the manager will be in trouble. They have to start winning quickly.",
      "\"Next week if they lose, they would go to 15th and 16th. It's five games in and before you know it you're in October and they're in the bottom half of the table. And that's where they can't be, having spent £200m and giving him a pre-season.",
      "\"There's got to be a turnaround pretty quickly, and the manager's idea has got to land very quickly with the players.",
      "\"They struggled against Burnley at home, against Fulham in large parts of the game, at Grimsby, they struggled here today, they're struggling to find rhythm, to find tempo, to find performance levels.",
      "\"I'm worried about the manager, I'm worried about what's going to happen in this next few weeks. I don't think it's a time for panic, but I've seen this before, we've seen this film.\"",
      "United have four points from four Premier League games this season - but they have also just picked up 31 points from just 31 Premier League games since Amorim was appointed at Old Trafford.",
      "That is the worst record out of any ever-present Premier League team in that time. Spurs, who finished 17th in the Premier League last season, have leapfrogged them into 16th place this weekend.",
      "West Ham - who have been managed by both Julen Lopetegui and current boss Graham Potter in that time - also have a better record than Amorim's Man Utd.",
      "Amorim now has the unenviable record of having the worst win percentage of any Man Utd boss since the Second World War.",
      "In fact, among managers to take charge of 20+ games with Manchester United in the top-flight, only Alfred Albut (20 per cent) and Scott Duncan (24 per cent) have a lower win ratio at this level in the league than Amorim's 26 per cent (8/31).",
      "United also have huge struggles in front of goal, failing to score in 13 of their 31 league games and finding the net just 36 times.",
      "Amorim has only won four of 26 Premier League games against non-promoted teams since taking charge.",
      "United have won just one of their last 20 Premier League away games against the traditional big six teams, conceding 53 goals in those matches.",
      "Amorim has admitted he has seen the numbers and the stats regarding his United form - and he will accept whatever fate comes his way.",
      "\"I understand everything. It is normal. The result, I accept that. I don't see it that way, we are doing better than the results.",
      "\"The record says everything. My message to fans: I will do everything. Always thinking about what is best for the club.",
      "\"Until I'm here, I'll do my best. The rest is not my decision. I'm suffering more [than the fans].",
      "\"I see the record. I understand the frustration and I understand the decisions that come with that. I take the critics. That's it.\"",
      "However, despite Keane and Neville's protests about the playing style and Amorim's 3-4-2-1 formation, the United boss says he will not change his ways.",
      "\"I accept, it is not a record you should have at Manchester United. There are a lot of things you have no idea what has happened.",
      "\"But I am not going to change my philosophy. I play my way and I am going to play my way.\"",
      "\"This United team lack that real quality, they struggle defensively. They look all over the place. United are an average team, an average Premier League team. The stats will tell you that it goes back to last season as well.",
      "\"United's record against any of the top six teams is really, really poor. They can't seem to compete. They might have a good 45 minutes or a good hour. They did it quite well against Arsenal. But they lost the match to Arsenal and you play for Manchester United to win football matches.",
      "\"It's no good just beating the lesser teams. You're playing for Manchester United to beat other good teams. And United can't do that.",
      "\"You talk about the system - but the manager has come in and is sticking to his guns. He's not budging. The results, and we look at points per game, goals for, goals against - it does concern me. It's not good reading.",
      "\"As soon as the game starts, you're worried. And you get that feeling when they're playing any decent team.",
      "\"We said they've scored four goals (in the league this season) and United are better going forward now. Two of them are penalties. So they're not exactly a free-scoring team where they might score two or three and then let in one or two. It's the same problems as last year.",
      "\"And what we were told: the new manager needs a pre-season, his own players... They've spent over £200m. We keep making excuses but when are we going to see the signs?",
      "\"People say: give managers time. Of course. But we saw (Arne) Slot go into Liverpool - and Liverpool were a better team than United last season - but he ended up winning the league. Other managers, you see (Thomas) Frank going into Spurs and you see signs of them getting better. How long do you keep waiting when you keep getting a point a game?\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Haaland brace fires City to Manchester derby win!",
    "tags": [],
    "link": "https://www.skysports.com/football/video/12606/13431253/manchester-city-3-0-manchester-united-premier-league-highlights",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-man-city-man-utd_7020731.jpg?20250914183203",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 20:03, UK"
    ]
  },
  {
    "headline": "Man City too strong for Man Utd as Haaland scores twice",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.skysports.com/football/man-city-vs-man-utd/report/531166",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-erling-haaland-ruben-dias_7020719.jpg?20250914182217",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 19:30, UK",
      "Erling Haaland scored twice as Manchester City got back on track with a 3-0 derby win over Manchester United at the Etihad Stadium.",
      "Phil Foden headed City in front inside the first half but Ruben Amorim's side were in the game until Haaland took it away from them in the second half. Jeremy Doku and then Bernardo Silva twice sent him clear and the Norwegian striker did the rest.",
      "Gianluigi Donnarumma did have to pull off one spectacular save on his Premier League debut to keep out Bryan Mbeumo but Benjamin Sesko struggled for service and for all United's endeavour they lacked the cutting edge that Haaland brings to this City side.",
      "That was proven late in the game as United missed chance after chance. City's win puts Pep Guardiola's side back on track after back-to-back defeats prior to the international break, lifting them above a United side who now have four points from their four games.",
      "In the closing stages, it was the name of Ricky Hatton chanted repeatedly by the home support. News of the boxing legend's shock passing had broken earlier in the day and there were emotional tributes beforehand. He would have enjoyed the result.",
      "Man City: Donnarumma (8), Khusanov (7), Dias (7), Gvardiol (7), O'Reilly (7), Rodri (7), Bernardo (7), Reijnders (6), Foden (8), Doku (8), Haaland (9).\n\n\nSubs used: Gonzalez (6), Savinho (6), Bobb (n/a), Ake (n/a).\n\n\nMan Utd: Bayindir (6), Yoro (6), De Ligt (6), Shaw (5), Mazraoui (5), Dorgu (6), Ugarte (5), Fernandes (5), Mbeumo (6), Sesko (5), Amad (6).\n\n\nSubs used: Mainoo (6), Maguire (5), Casemiro (5), Zirkzee (6).\n\n\nPlayer of the match: Erling Haaland.",
      "This was Foden's first start of the season, having skipped England duty to work on his fitness. There were no signs of his ankle troubles, playing with confidence when deep and still making those forward runs in support of Haaland from a central position.",
      "Doku was the architect of his goal, the tricky winger shifting the ball quickly to break United's back line before finding his team-mate's head with the cross at the second attempt. But there was more to Foden's display than that with silky skills throughout.",
      "A delightful flick to Doku allowed the Belgian to assist Haaland for the key second goal. Foden was not at his best last season after winning the player-of-the-year award in the previous campaign. If he can get back to that level, what a boost that would be for City.",
      "Haaland came into this derby clash fresh from putting five past Moldova for Norway and it was his sharpness that took the game away from United after the break. He could have had a hat-trick, hitting the post when it appeared easier for him to score.",
      "But his two finishes were emphatic, the first of them coming at a time when United were pushing for an equaliser. Haaland has now scored five goals in four Premier League appearances this season, showcasing the sort of firepower that took City to two titles.",
      "Amorim's Premier League win rate stands at 26 per cent. Among managers to have taken charge of at least 20 top-flight games for Manchester United, only Alfred Albut (20 per cent) and Scott Duncan (24 per cent) have a lower win ratio at this level for the club.",
      "Their four points from four games is also their poorest start to a Premier League season since doing the same in the inaugural campaign over 30 years ago. Sir Alex Ferguson's side recovered to win the title that season. Nobody is expecting a repeat of that feat.",
      "Manchester United head coach Ruben Amorim asked about winning eight of his 31 Premier League games in charge:",
      "\"Guys, I understand that and I accept it. So it's not a record that you should have in Manchester United.",
      "\"There are a lot of things that you have no idea what happened during these months, but I accept that. But I'm not going to change. When I want to change my philosophy, I will change. If not, you have to change the man.\"",
      "He added: \"The record says everything. So I understand. My message is that I'm going to give everything. I will do everything, always thinking about what is best for the club.",
      "\"That was always the same message. And then it's not my decision, the rest. So until I'm here, I will do my best. I really want to win games. So I'm suffering more than them.\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Casemiro misses a golden chance from four yards out!",
    "tags": [
      "Casemiro"
    ],
    "link": "https://www.skysports.com/football/video/12606/13431224/shot-casemiro-85-manchester-city-3-0-manchester-utd",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-casemiro-chance_7020723.jpg?20250914182454",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 18:25, UK"
    ]
  },
  {
    "headline": "'The master of all he surveys' | Haaland bags brace in the derby!",
    "tags": [],
    "link": "https://www.skysports.com/football/video/11095/13431203/goal-e-haaland-68-manchester-city-3-0-manchester-utd",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-haaland-goal_7020680.jpg?20250914180644",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 18:10, UK"
    ]
  },
  {
    "headline": "'That's why they signed him' | Mbeumo's rocket volley expertly stopped by Donnarumma",
    "tags": [],
    "link": "https://www.skysports.com/football/video/12606/13431190/save-g-donnarumma-61-manchester-city-2-0-manchester-utd",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-city-gk_7020669.jpg?20250914180258",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 14 September 2025 18:03, UK"
    ]
  }
]