[
  {
    "headline": "Glazers timeline at Man Utd as controversial family hit 20 years as club owners",
    "tags": [
      "Man Utd",
      "Glazer"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/glazers-man-utd-timeline-ownership-35182272",
    "image": null,
    "date": "2025-05-07 09:30:00",
    "source": "mirror",
    "body": [
      "The Glazer family have hit a landmark many Manchester United supporters hoped would never come. The American billionaires have now been in charge of the Premier League giants for 20 years - and it's been a period packed full of incident and controversy.",
      "Although Joel and Avram Glazer have been the most prominent members of the family who bought United in 2005 for £790million, it was Malcom Glazer who oversaw the deal. The ride has been rocky almost ever since, with United supporters regularly protesting against what they see as absentee owners who are only interested in bleeding the club of its money.",
      "The arrival of Sir Jim Ratcliffe and his INEOS team last year has done little to change the opinion of most United fans. But while Ratcliffe has taken control over business decisions in exchange for £1.3bn, the Glazers, who also own NFL franchise Tampa Bay Buccaneers, have remained unbowed in their decision to stay involved at United.",
      "The Glazers buy out Irish shareholders John Magnier and JP McManus to control 57 percent of the club and become majority stakeholders. Days later, they increased their stake to 75 percent.",
      "United is delisted by the Glazers following their takeover, with the club plunged into debt of around £700m, leading to the first major protests from fans. Joel, Bryan and Avram Glazer visit Old Trafford and are forced to leave in the back of a police van to avoid a baying mob of fans.",
      "United fans start wearing green and gold scarves, produced by the Manchester United Supporters’ Trust (MUST) during the League Cup final win over Aston Villa. The scarves, displaying the colours of Newton Heath, the club formed in 1878 which became United in 1902, become an instantly-recognisable anti-Glazer symbol.",
      "United sell Cristinao Ronaldo to Real Madrid for a world record fee of £80m, but even that cannot stop the club's debt rising from £660m £716m, while a refinancing of that debt, incurring greater interest, sparks more protests from militant fans.",
      "United starts trading on the New York Stock Exchange, with the Glazers making £75m by selling a significant chunk of their shares.",
      "Malcolm Glazer, who never once visited Old Trafford, dies aged 85. The Glazer family sell a further portion of their shareholding, making them £129m, and reiterate their stance of not selling the club for at least five years.",
      "The Glazer family continues to make personal profit from United, selling another chunk of shares that makes them £56.85m, with none of that money being ploughed back into the club.",
      "Driven by Joel Glazer, United are one of the leaders behind the breakaway European Super League, but fans reacted furiously to the proposal, storming Old Trafford to force the postponement of their Premier League game against Liverpool in May. The backlash sees United pull out of the proposal.",
      "United fans opposed to the Glazers react with delight when the family announces it is “commencing a process to explore strategic alternatives”, suggesting an end to their toxic 17-year spell in charge.",
      "INEOS founder Sir Jim Ratcliffe and Qatar millionaire Sheikh Jassim bin Hamad al Thani bid to buy United. Ratcliffe is ultimately successful, acquiring a quarter share of the club, after Sheikh Jassim withdraws his bid.",
      "Ratcliffe purchases a 25 percent stake in United and gains control of football operations at the club under the terms of his acquisition.",
      "United's revenue drops to £198.7m for the final three months of 2024, down from £225.8m for the same period the previous year, with the club debt £731m, as well as owing more than £300m in transfer fees. The figures come on the back of United making 250 staff redundant, with up to 200 more job losses planned."
    ]
  },
  {
    "headline": "Manchester United handed huge double BOOST ahead of Europa League semi-final second leg",
    "tags": [
      "Man Utd",
      "Europa League"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/breaking-manutd-athletic-team-news-35182397",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35182419.ece/ALTERNATES/n615/1_Manchester-United-v-Olympique-Lyonnais-UEFA-Europa-League-202425-Quarter-Final-Second-Leg.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "Manchester United's Europa League opponents Athletic Bilbao will go into the second leg of their semi-final without brothers Nico and Inaki WIlliams. Neither of the stars are in the travelling squad for the match at Old Trafford, with injury cited as the reason.",
      "Both started the first leg at San Mames, where United won 3-0 to put one foot in the final. However, neither can be called upon for the return game at Old Trafford as Athletic chase an unlikely comeback.",
      "Nico has been used sparingly in the league of late, with manager Ernesto Valverde aiming to keep him fresh for Europe. He missed out entirely against Real Sociedad over the weekend, though,and is not available on Thursday night.",
      "Inaki did play in that match, but made way for Alvaro Djalo around an hour into the goalless draw. And the two Williams brothers aren't the only stars missing.",
      "Top scorer Oihan Sancet missed the first leg through injury and has not recovered in time to play a part at Old Trafford. Dani Vivian will also miss out, with the defender's red card in the first leg earning him a suspension.",
      "United hold a commanding advantage as they prepare to welcome Ernesto Valverde's team to Old Trafford. The first leg hinged on a contentious penalty call, with Vivian sent off following a VAR check after being ruled to have fouled Rasmus Hojlund.",
      "Ruben Amorim's team already led 1-0 through Casemiro at that stage, and captain Bruno Fernandes doubled the lead from the penalty spot. Fernandes added his second and United's third on the stroke of half-time.",
      "United star Casemiro hailed the role played by the fans as Amorim's men chase European glory. The semi against Athletic comes after a dramatic late comeback against Lyon in the previous round, and the Red Devils are now within touching distance of a final against Tottenham or Bodo/Glimt.",
      "“Of course, when you do not win, it is difficult to be loyal and support the team,\" Casemiro told club media. \"This year, in the European competition, we are a little bit closer but, in the league, we aren’t where we should be, and we aren’t playing well. But the fans are something incredible. It isn’t normal how good they are.",
      "\"It isn’t normal how they support us and help us. The other night against Lyon was an unforgettable night in my career and something incredible, an incredible game. They always support us — whether we are playing well or badly. When I get home, I speak with my family or my inner circle about what the fans are like here.",
      "“All I can say, from my heart, is thank you very much. If they didn’t support us like they do, it would be even more difficult, so the thing we have to say to everyone who comes to games here, and to the whole city, is it’s something incredible. So, all I can say is thank you, thank you very much.\""
    ]
  },
  {
    "headline": "Man Utd fans had concerns about Glazers but nothing could prepare them for next 20 years",
    "tags": [
      "Man Utd",
      "Glazer"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-united-glazers-protest-ratcliffe-35182151",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35182198.ece/ALTERNATES/n615/0_NFL-NOV-12-Jets-at-Buccaneersjpg-Glazrers.jpg",
    "date": "2025-05-07 09:28:00",
    "source": "mirror",
    "body": [
      "The seeds of Manchester United's current crisis were ultimately sown 20 years ago, when the Glazer family gained control of the club. Under two decades of ownership under the Glazers, United have gone from being debt-free to owing around £1billion, according to their latest financial results.",
      "On May 12, 2005, Irish racing magnates John Magnier and JP McManus sold their 28.89 per cent stake in United to Florida-based businessman Malcolm Glazer. There were already concerns at United over the leveraged nature of the Glazer takeover, but nothing could prepare fans for what was to come under the family's controversial ownership.",
      "Magnier and McManus famously fell out with Sir Alex Ferguson over the stud rights to the racehorse Rock of Gibraltar, with the grubby dispute, played out in public, ultimately leading to the Glazers owning United. With the shareholding from Magnier and McManus, the Glazers controlled 76.2 percent of United and delisted the company in June 2005, beginning two decades of the most toxic club ownership in the history of English football.",
      "Since then, the Glazer family are estimated to have made £1billion from United to line their own pockets, with the club paying out the same amount in interest to facilitate their controversial leveraged buy-out of the club. Despite sustained protests and demonstrations from United fans over the past 20 years, the Glazers remain in overall control of the club, hated by the club's supporters as much now as when they took over.",
      "Sir Jim Ratcliffe and his INEOS team may be in charge of football operations at United, having acquired a 28 per cent stake in the club, but the Glazers remain in overall control, despite the best efforts of fans to oust them. Put simply, the Glazers – who profess to love United despite rarely attending games and having almost zero dialogue with the fans – are making too much money from one of the world's biggest clubs to walk away.",
      "Steve Crompton, from The 1958, a United fan group which continues to organise protest marches and demonstrations against the Glazers, said the campaign to rid them from the club will carry on until they achieve that goal.",
      "“The Glazers have drained this club of millions,” said Crompton. “They’ve ripped the heart out of Manchester United and divided the fan base. Two decades ago, they pushed away a loyal section of supporters — and they never came back.",
      "“For 20 years, they’ve bled the club dry, taking dividends while the team and the stadium have been left to rot. We need a new stadium because they’ve neglected Old Trafford for two whole decades. They don’t care about the club. We do.",
      "“United fans love this club — and we hate the Glazers. They’ve poisoned the atmosphere, corrupted the identity, and infected this once-great institution with a toxicity that won’t begin to heal until they’re gone. That’s why, after 20 years, we’re still fighting. And we won’t stop until this toxic ownership is history. Not today, not ever.”",
      "Journalist Chris Blackhurst, whose book, The World’s Biggest Cash Machine , looks at the Glazer ownership of United, said they will stay put as long as the revenue streams keep pouring in, but suggested they could sell if the revenue streams dry up.",
      "“If you talk to the fans, they will say that the Glazers don't love the club,” said Blackhurst. “You hear Joel Glazer has an office that's a shrine to United and whenever they play, everything in Glazerland stops. That may be true, but he's never shown it.",
      "“They don't go to matches, they don't communicate and now it's too late. Sir Jim Ratcliffe was seen as a white knight, this saviour coming in, but now he's got to watch that he's not just become a patsy for the Glazers.",
      "“If you look at all the coverage since Ratcliffe came in, it's all about him – the Glazers are hardly mentioned, yet they're still the majority owners and still in control.",
      "“The crucial thing for the Glazers is the amount of commercial sponsorship coming in. If that dips, and with it United's global reach on social media and the TV audiences, they may consider their options.”"
    ]
  },
  {
    "headline": "Antony aims thinly-veiled dig at Man Utd: \"Best decision I've ever made\"",
    "tags": [
      "Man Utd",
      "Antony"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/antony-man-united-transfer-betis-35182019",
    "image": null,
    "date": "2025-05-07 08:32:00",
    "source": "mirror",
    "body": [
      "Antony has claimed quitting Manchester United was the ‘best decision he’s ever made’ after dropping a fresh transfer hint. The Brazilian winger joined Real Betis on loan in January after a rotten spell at Old Trafford.",
      "And Antony has enjoyed an eye-catching renaissance in Seville. The 25-year-old has seven goals and four assists in 20 outings for Betis in all competitions this season - that coming after just one goal for United this term.",
      "The £85m man has now explained that his call to quit the club is the best decision of his career so far, while he remains open to an extended stay in Spain. He said: “The best decision I’ve ever made was coming to Betis.",
      "“I’m happy — and when I’m happy, things go well. It’s very early. I don’t know what’s going to happen but I’m very happy here.”",
      "While Antony is loving life with Betis, he has also revealed that there was further interest in his services. He added: “Although I know how talented I am, I prioritised going where I knew I’d be happy, even though I had better offers. It’s important to score goals and provide assists but being happy is even more important.”",
      "Antony has pointed to a number of elements contributing to his improved form while in Spain. After his recent outing, he also praised Betis boss Manuel Pellegrini for his contribution.",
      "\"It's very important because I've said in many interviews that I've found myself because I'm happy, things are going well,\" he said after scoring a stoppage time winner against Espanyol at the weekend.",
      "\"The coach joked with me because I scored great goals with my right foot, but he asked me when I'd do it with my left foot. I gave him a hug after scoring because he's someone I care deeply about and I'm grateful for his trust.\"",
      "United boss Ruben Amorim gave his take on why Antony was thriving in Spain earlier this season. The Portuguese boss claimed that the lesser physicality of La Liga had allowed him to unlock his best form - a suggestion that was emphatically dismissed by the winger’s agent.",
      "Regardless, Antony will be aiming to continue his hot form over the coming week as Betis face a number of key games. They at first take on Fiorentina in the second leg of their Europa Conference League semi-final on Thursday.",
      "They then face a clash with Osasuna at the weekend. Betis currently sit sixth in La Liga and just one point off of the Champions League places with four matches left to play."
    ]
  },
  {
    "headline": "League One player thinks he'd be playing regularly for Man Utd if he broke through now",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/amorim-man-utd-premier-league-35181849",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35181861.ece/ALTERNATES/n615/0_JS367852749.jpg",
    "date": "2025-05-07 07:48:00",
    "source": "mirror",
    "body": [
      "A League One player has boldly claimed he would be in Manchester United's first team now if he'd been born a decade years earlier. Demetri Mitchell, 28, has just helped Exeter City to a 16th-place finish in the third tier, having left United in 2020.",
      "Ruben Amorim's side are only just higher in the Premier League, sitting 15th in the table ahead of the final three games. However, they could still end a trying campaign with silverware as they are on the brink of reaching the Europa League final.",
      "United are in a dominant position after the first leg of their semi-final against Athletic Bilbao following a surprise 3-0 win in the Basque Country. Despite that, Mitchell is convinced he would be getting plenty of game time with the senior squad if he had been coming up through the ranks today.",
      "\"I reckon if I broke through during this era of Man United I'd be a first team regular,\" he claimed on X. And judging by his follow-up comments, he was being deadly serious.",
      "When quizzed about his preferred position on the pitch, the he said: \"Wing back. Not saying I'd play every game, but I'd be a first team regular probs squad player.\"",
      "He further explained that he wouldn't stand a chance at that level in his current condition. However, he was certain that his 20-year-old self could've made the grade.",
      "\"No not now [it] would take me too long to adapt,\" he wrote in another reply. \"When your [sic] 20 and in a Premier League environment the amount you learn in such a short period is vast as well as the facilities etc.",
      "\"There's lads that could [have] made it that never got the chance and their [sic] not even playing now more talented than myself.\"",
      "Some fans pointed out that current left-backs like Patrick Dorgu or Harry Amass might block his path to the first team. But having witnessed the current state of affairs at Old Trafford, he seems to fancy his odds.",
      "Mitchell had his first taste of senior United action in a 2-0 Premier League victory over Crystal Palace on the last day of the 2016/17 season.",
      "He later had two loan spells at Hearts before making a permanent switch to Blackpool in summer 2020. He then moved to Hibernian in January 2022 before joining Exeter a year later.",
      "The former England Under-20 star's contract with the Grecians is set to run out this summer. He hasn't been offered a new deal but has been invited to return for pre-season training."
    ]
  },
  {
    "headline": "Football news: Arsenal ‘close’ to first summing signing as Man Utd eye return for former star",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/transfer-news-liverpool-united-arsenal-35181775",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35181774.ece/ALTERNATES/n615/0_GettyImages-2213739085.jpg",
    "date": "2025-05-07 06:30:00",
    "source": "mirror",
    "body": [
      "It's set to be a busy week for clubs both in the Premier League and abroad. The madness has already started in Italy with Inter Milan booking their spot in this year's Champions League final.",
      "They plotted their route through with a crazy 4-3 win against Barcelona at the San Siro - that victory seeing them progress 7-6 on aggregate. Arsenal will hope to join them in the final as they take on Paris Saint-Germain on Wednesday night.",
      "Elsewhere, Manchester United, Chelsea and Tottenham will all be in action later this week as they try and secure spots in their own European finals. Away from Europe, there's also a clutch of Premier League games this weekend.",
      "There's also plenty going on when it comes to transfers, with the window opening NEXT MONTH. With all of that being said, take a look at all of the latest news here:",
      "Arsenal are closing in on a deal for Martin Zubimendi, with the Gunners now in pole position to sign the midfielder. The Spaniard has long been linked with a move to the Emirates having pulled out of a transfer to Liverpool last summer.",
      "But Mikel Arteta's men had been facing rising competition from Real Madrid for Zubimendi's signature. In a positive sign though, Radio Marca report that the Gunners are 'winning the race' for the Real Sociedad star.",
      "The Premier League side are rated as being the 'best-placed team' to sign Zubimendi. Madrid's uncertainty in the manager's post, with Carlo Ancelotti almost certain to leave at the end of the campaign, as opened the door to Arsenal.",
      "Man United are reportedly eyeing Torino star Vanja Milinkovic-Savic as a potential signing as they look to bring in a new goalkeeper. According to Tutto Mercato, the Serbian has caught the eye of Old Trafford chiefs.",
      "He reportedly has a €20million (£16.9m) release clause written into his contract with the Italian side. United could face competition for his services though, with Manchester City and Chelsea both interested.",
      "Milinkovic-Savic has had a previous spell at Old Trafford. In May 2014, United reached an agreement to sign the goalkeeper from Vojvodina, paying £2million. He remained there on loan for another season but never actually made an appearance for the Red Devils. The club were eventually forced to release him after he failed to obtain a work permit.",
      "Barcelona would find it 'very difficult' to sign Bayer Leverkusen right-back Jeremie Frimpong, who Liverpool have also been linked with. Frimpong, 24, has shone for Leverkusen again this season, excelling as a wing-back under Xabi Alonso.",
      "The Netherlands international's performances have led Barca manager Hansi Flick and the club's sporting director, Deco, to agree on pursuing him. But, as reported by Sport, Barcelona's well-documented financial woes would make signing Frimpong a challenge, despite his release clause being a relatively low £34million."
    ]
  },
  {
    "headline": "Man Utd transfer news: Red Devils eye former star as Bruno Fernandes exit stance confirmed",
    "tags": [
      "Man Utd",
      "Transfer News",
      "Fernandes"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/manchester-united-transfer-osimhen-fernandes-35179107",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35179070.ece/ALTERNATES/n615/0_GettyImages-2212899639.jpg",
    "date": "2025-05-07 03:00:00",
    "source": "mirror",
    "body": [
      "Manchester United’s season might not be over - but planning is already underway for next term. The Red Devils are aiming to reach the Europa League final later this month.",
      "They take on Spanish side Athletic Bilbao in the last four and are in excellent health ahead of the second-leg having secured a 3-0 success in Spain. Away from the chance of lifting silverware, the Europa League is even more important given it would represent a chance to return to the Champions League.",
      "And that would considerably bolster the club’s coffers ahead of next season under Ruben Amorim. Even before that, a host of players have been linked with moves to Old Trafford.",
      "There could also be some exits over the coming months. With that being said, take a look at all of the rumours from the red half of Manchester:",
      "Man United are reportedly eyeing Torino star Vanja Milinkovic-Savic as a potential signing as they look to bring in a new goalkeeper. According to Tutto Mercato, the Serbian has caught the eye of Old Trafford chiefs.",
      "He reportedly has a €20million (£16.9m) release clause written into his contract with the Italian side. United could face competition for his services though, with Manchester City and Chelsea both interested.",
      "Milinkovic-Savic has had a previous spell at Old Trafford. In May 2014, United reached an agreement to sign the goalkeeper from Vojvodina, paying £2million. He remained there on loan for another season but never actually made an appearance for the Red Devils. The club were eventually forced to release him after he failed to obtain a work permit.",
      "Man United are confident that captain Bruno Fernandes remains committed to the club amid interest from Saudi Arabia. A host of clubs in the Gulf state have put the Portuguese playmaker right at the top of their shopping list.",
      "Al-Hilal look the most likely to sign him and bosses want to make Fernandes their new marquee signing, having missed out on Salah. They would be willing to offer the Portuguese international a deal worth up to £750,000-a-week.",
      "But the private view from United is that he will remain. Fernandes’ current deal is set to run until 2027 with the option for a further year.",
      "Man United target Victor Osimhen could spurn interest from Man United amid renewed interest from the Premier League. The Nigerian’s loan deal with Galatasaray expires at the end of this season.",
      "He still has interest from England, albeit Galatasaray are looking to re-sign him permanently having managed to put together the £56m fee that it would take to convince Napoli to sell.",
      "And according to reports in Turkey, the final decision lies with Osimhen and should he approve a return to Galatasaray, it appears likely that a move will be completed."
    ]
  },
  {
    "headline": "Arsene Wenger teases huge change to football days after angering Man Utd fans",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/arsene-wenger-offside-man-utd-35181453",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35181462.ece/ALTERNATES/n615/0_arsenePNG.png",
    "date": "2025-05-07 00:00:00",
    "source": "mirror",
    "body": [
      "Arsene Wenger has suggested a major reform of football's offside rule could come as soon as next year. The legendary Arsenal boss has long been a chief proponent of making a change and it is now on the agenda.",
      "Wenger, now FIFA's chief of global football development, hopes to introduce a 'daylight' principle to offsides. A player would be deemed as onside if any part of their body that can score a goal is behind or level with the relevant defender.",
      "The idea was first proposed as early as 2020 and after positive trials in Sweden, Italy and the Netherlands and Wenger has hoped to push forward quickly with changes through the International FA Board (IFAB).",
      "And there seems to have been some acceleration to Wenger's bid to fix the issues around offside decisions, with a possible judgement coming next year. Speaking on beIN Sports, Wenger said: \"In 1990 it was decided that it's not offside if you're on the same line as the defender and the striker has advantage if there was doubt.",
      "\"With VAR, this advantage disappeared. I think in England they cancelled 37 goals on marginal offsides, it's very frustrating. It's why I proposed that as long as you're on the same line, you're not offside. In one year the decision will be made by IFAB, not by me.\"",
      "Wenger has proven an open book in his thoughts on football in recent weeks. The Frenchman may have caused uproar in some areas of Manchester and London as he suggested it is 'not right' that the winner of the Europa League is rewarded with a place in the Champions League.",
      "Manchester United and Tottenham are both in advantageous positions to make the competition's finale and the Premier League could find itself with an additional spot in the Champions League. UEFA made the decision to offer a place in the competition as a reward for victory in the Europa League back in 2014",
      "Wenger has called for that to be reviewed, and believes the policy is unfair. Asked for his position, he said. \"No - they should qualify automatically for the Europa League again but not necessarily for the Champions League.",
      "\"Especially when you're in the Premier League where already five teams qualify. I think it's something (for Uefa) to think about and to review.",
      "\"On the other hand people will tell you that to keep the Europa League focused, interesting and motivated you need to give them that prize (of qualifying for the Champions League).\"",
      "As it stands, despite United and Spurs both being in the bottom half of the Premier League, they could win a place in Europe's top competition. Four teams in the league usually qualify but the Premier League have won an extra spot due to the collective performance of English teams in Europe.",
      "A tournament win from United or Spurs would see a sixth place awarded."
    ]
  },
  {
    "headline": "Man Utd decide on three more players leaving Old Trafford at end of season",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-united-transfers-summer-exit-35181003",
    "image": "https://i2-prod.dailystar.co.uk/sport/football/article35152845.ece/ALTERNATES/n615/1_manchester-united-training-session-and-press-conference-uefa-europa-league-202425-semi-final-firs.jpg",
    "date": "2025-05-06 20:20:00",
    "source": "mirror",
    "body": [
      "Jack Kingdon, Sam Murray and James Nolan are all set to leave Manchester United at the end of the season. The trio are all out of contract this summer and will depart on frees after not being offered new terms.",
      "Kingdon, 19, was a key player in the Under-18s' treble-winning team last season and has been performing well on loan at Rochdale since joining them in the January window. It is believed that he was close to signing for Ineos-owned FC Lausanne Sport on loan in January before opting for Rochdale, who he has helped reach the National League play-offs.",
      "The centre-back, who was born in Bolton and joined United from Morecambe for a six-figure sum in November 2020, has trained with the first team at Carrington and represented Scotland at various age levels. He also spent time training with Lausanne's first team in Switzerland last year, impressing their staff.",
      "Murray, 20, came to United as a teenager from Huddersfield and played in all six games of the successful 2022 FA Youth Cup campaign, which concluded at Old Trafford. The left-back, who recently captained the Under-21s against Wolves and scored against West Ham in the PL2 play-offs on Monday, has been a steady performer in the academy.",
      "Nolan, 19, a jack-of-all-trades on the pitch, joined Inverness Caledonian Thistle in Scottish League One on loan during the summer transfer window and has since made 33 appearances. The Chorley-born player has mainly been seen holding down the fort at full-back for Caledonian Thistle.",
      "The three will be part of a huge cohort of players seeking new employers in the summer. It was reported earlier this week, that only four players are deemed as untouchable by the United hierarchy, with the club open to offers on every other player.",
      "The quartet, as reported by the Daily Star, are understood to be Harry Maguire, Patrick Dorgu, Amad and captain Bruno Fernandes.",
      "Aside from those, United are open for business as they look to raise funds for a huge rebuild under Ruben Amorim. The Portuguese boss wants players that suit his system, but there is an understanding that outgoing business will need to be conducted first.",
      "Along with the players that can be sold for fees, four senior stars will be out of contract. Tom Heaton, Christian Eriksen and Jonny Evans will all leave, while Victor Lindelof is still unsure over whether he will be offered a new deal."
    ]
  },
  {
    "headline": "Man Utd's 'new Wayne Rooney' who scored twice on debut now without a club aged 29",
    "tags": [
      "Man Utd",
      "Rooney"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-utd-wayne-rooney-wilson-35180164",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35180116.ece/ALTERNATES/n615/0_GettyImages-474615012.jpg",
    "date": "2025-05-06 17:49:00",
    "source": "mirror",
    "body": [
      "Former Manchester United ace James Wilson has been released by Northampton Town. The 29-year-old, once touted by Louis van Gaal to have the potential to succeed Wayne Rooney and Robin van Persie at Old Trafford, finds himself looking for new club after the end of the League One season.",
      "Wilson broke onto the scene by making an emphatic impact on his United debut. Playing under Ryan Giggs in the final home match of the 2013/14 season, the then 18-year-old bagged a brace to introduce himself to Red Devils fans to dramatic effect.",
      "\"You have seen a little glimpse of the future,\" Giggs told fans after the match. \"This is what this club is about. We never stand still. We give youth a chance as we try and play attractive football.\"",
      "\"He is a natural goalscorer but he has got more to his game than that,\" Giggs said of Wilson. \"He can run at people, he has got pace and he is a clever player.\"",
      "Despite earning 20 appearances in his United career, Wilson failed to make the cut with the 13-times Premier League champions. After loans Brighton, Derby and Sheffield United, a loan spell to Aberdeen became a permanent one.",
      "Following his time in Scotland, Wilson has had spells with Salford City and Port Vale. The striker then completed a move to Northampton Town ahead of the 2024/25 season.",
      "Wilson signed a one-year deal with the option of a further 12 months but failed to hit the heights for the Cobblers. The former Old Trafford prospect failed to score in 12 appearances for the club and has been released.",
      "He was one of 11 players to see their time with Northampton end. Manager Kevin Nolan reflected on the decisions as Tyler Magloire, Jack Sowerby, Nik Tzanev, Ali Koiki, Liam McCarron, Harvey Lintott, Akin Odimayo, Will Hondermarck, TJ Eyoma and Reuben Wyatt all exited after a 19th-place finish.",
      "\"We have made some difficult decisions and it is never nice having to tell a player that their contract is not being renewed,\" he said.",
      "\"Some of these players have been at the club a number of years and have played a big part here, helping the club enjoy some good times over the last few years, and all of the departing players will leave with our thanks and best wishes.",
      "\"We believe we have a good core of players here, both in terms of ability and culture, which is very important, and we are excited to be entering into discussions with our chosen targets to build on and add to that over the course of the summer.\""
    ]
  },
  {
    "headline": "Premier League promise over FA Cup final broken due to Man Utd and Tottenham",
    "tags": [
      "Man Utd",
      "Premier League"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/premier-league-fa-cup-date-35179222",
    "image": "https://i2-prod.mirror.co.uk/incoming/article34602475.ece/ALTERNATES/n615/0_FBL-ENG-PR-BRENTFORD-TOTTENHAM.jpg",
    "date": "2025-05-06 15:22:00",
    "source": "mirror",
    "body": [
      "A promise not to schedule Premier League games the night before this month’s FA Cup final has been broken after Aston Villa's game against Tottenham Hotspur and Manchester United's visit to Chelsea were both moved. The decision comes so both Spurs and United can be allowed additional and equal rest before the Europa League final four days later, which both are hopeful of reaching thanks to first leg leads.",
      "“Additionally, there will be no Premier League games on the Friday night before the final, to allow focus on the build-up to the showpiece event.”",
      "But Spurs’ visit to Villa, who are unhappy with the request for the game’s date to be changed, will now kick off at 7:30pm on Friday April 16, followed by Chelsea versus United at 8:15pm.",
      "Crystal Palace and Manchester City only learnt of the kick-off time - 4.30pm - for their meeting at Wembley on Saturday following protracted negotiations involving broadcasters. Both Friday night games were initially set to take place alongside other Premier League matches on Sunday April 18.",
      "And Villa’s director of football operations Damien Vidagany outlined their unhappiness in a post on social media. “Fixture changed and, honestly, not happy,” he wrote. “We really pushed to protect our fans (our main task and duty) and keep the Spurs match on Sunday. Nothing against Spurs.",
      "\"Considering the alternatives, (much worse on the Wednesday or Thursday) and the process conducted the final outcome is less damaging. At the end, it is what it is.",
      "\"Hopefully, in the future, all of them will remind us of the clear prejudice in this case to Villa fans and will be consistent and equally supportive, if we need changes to help us in Europe.”",
      "Spurs lead Bodo/Glimt 3-1 following the first leg of their Europa League semi-final, while United won 3-0 away to Athletic Bilbao. Both return fixtures take place on Thursday night.",
      "Chelsea are also set to progress to a European final having taken a 4-1 lead against Sweden's Djurgardens in the Conference League but that game does not take place until Wednesday, April 28."
    ]
  },
  {
    "headline": "Watford sack yet ANOTHER manager as ex-Man Utd star Tom Cleverley axed by Hornets",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/breaking-watford-sack-tom-cleverley-35178080",
    "image": null,
    "date": null,
    "source": "mirror",
    "body": [
      "Watford have announced that ex-Manchester United midfielder Tom Cleverley has left the club in yet another managerial change. A statement from the Championship side on Tuesday read: \"Watford FC confirms the departure of Tom Cleverley as Head Coach.",
      "\"Cleverley stabilised performances at the end of the 2023/24 season in an interim position before his full-time appointment last summer. At one stage, the Golden Boys were part of the play-off picture but, unfortunately, performances and results drifted with just five wins in 2025.\"",
      "Sporting Director Gian Luca Nani said: “We thank Tom for his service – not just in his role as Head Coach but for everything he has given Watford as a player and member of staff.",
      "“But the time has come for a change and to build on what we believe is a young and talented squad that will have benefitted from the experience of the Championship this season.",
      "“It has been a privilege to work closely with Tom; to understand how he sees the game and his enthusiasm for everything here. He deserves to be recognised for this and I’m sure he will have a bright future in the game. Tom will always be part of Watford in recognition of all that he has achieved over so many years.”",
      "Cleverley, 35, has been at Watford since 2017 after making a loan move from Everton. He made that switch permanent, eventually making just under 150 appearances for the Herfordshire outfit.",
      "He was named as interim head coach in March 2024 and was handed the permanent role after just one defeat in seven matches. He had penned a deal until the summer of 2027.",
      "Cleverely had Watford challenging for the playoff positions earlier this season but just one win in their last eight matches of the campaign saw their promotion hopes fade rapidly.",
      "Watford eventually finished 14th in the Championship, with the club's controversial owners opting for a change. The Pozzo family have made 20 managerial changes alone in the 13 years they have been at Vicarage Road, while five men have been in the dugout since the Hornets were relegated from the Premier League at the end of the 2021/22 season.",
      "Since their return the Championship, Watford have not finished any higher than 11th. The fixtures for the new season are set to be released 26 June 2025."
    ]
  },
  {
    "headline": "Man Utd transfer target Victor Osimhen set to make final decision on move",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/man-united-transfer-osimhen-galatasaray-35177453",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35177412.ece/ALTERNATES/n615/0_GettyImages-2211417265.jpg",
    "date": "2025-05-06 12:22:00",
    "source": "mirror",
    "body": [
      "Manchester United could lose out on the signing of Victor Osimhen this summer with the Nigerian set to make a call on his future. The Napoli forward was one of the most sought-after strikers in world football last summer.",
      "The Red Devils - as well as Premier League rivals Chelsea - were both linked with him but neither were able to agree a deal with Napoli. Saudi side Al-Hilal were also interested, only to see Osimhen turn down their offer.",
      "In the end, Turkish side Galatasaray sealed a surprise loan deal for his services, agreeing to pay £7.6m for the season. Osimhen has enjoyed a brilliant season in Istanbul having netted 33 goals throughout the campaign.",
      "That form has seen United and Chelsea retain their interest in the forward but it appears that they are going to be left frustrated again. According to Turkish outlet Milliyet, Galatasaray have managed to put together the £56m fee they have to pay in order to sign him permanently.",
      "Galatasaray boss Okan Buruk has also attempted to intervene, having promised Osimhen that he could stay at Galatasaray for a further season and play in the Champions League. The club would then not stand in his way if an offer to return to Europe was tabled in 2026.",
      "All that remains is for Osimhen to give his approval to a move and based on his recent comments, he would be open to staying. Speaking recently, he said: “It’s a great feeling.",
      "“It’s great that they [young fans] are inspired by watching me, that they are wearing the masks. I thank God. I hadn’t seen this much before coming to Galatasaray.",
      "“Everyone showing this much love, the children shouting at the tunnel exit… I will continue to make them proud. The team winning, me scoring… I want to continue as they know me. If I can inspire my teammates’ children, that makes me very happy.”",
      "Speaking about breaking his record for the most goals in one season, the striker added: “It was important to break my record in my first season. I am at one of the most important clubs in the world. The biggest club in Türkiye. I would like to thank my family and friends for helping me. I would like to thank the technical team and the club staff.",
      "“They never left me alone. This season is a memory that I will remember for the rest of my life. Apart from goals and assists, I like to help the team. I want to get the ball in the future, help the midfield, do my best for the team. The team comes first for me.",
      "“When I convert opportunities into goals, it makes me happy. The important thing is not Victor Osimhen, but the team. Roland is also very important. We can say the same thing for Mario, Torreira and Sanchez.”"
    ]
  },
  {
    "headline": "Man Utd face three-way transfer battle to re-sign player they released",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-transfers-milinkovic-savic-35177218",
    "image": null,
    "date": "2025-05-06 11:58:00",
    "source": "mirror",
    "body": [
      "Manchester United are weighing up a move for Vanja Milinkovic-Savic as they consider their goalkeeping options. Andre Onana has not inspired and while he's expected to stay is set to have a new back up next season - but Manchester City and Chelsea are also in the running.",
      "The Torino goalkeeper has kept 11 clean sheets for the mid-table Serie A outfit and has caught the eye of some of the Premier League's major sides, reports Tutto Mercato. The goalkeeper’s contract with Torino runs until 2026 and it includes a release clause worth €20million (£16.9m).",
      "United once had Milinkovic-Savic on their books but were unable to sort a work permit out and had to release him as a result. In May 2014, United reached an agreement to sign the goalkeeper from Vojvodina, setting them back just shy of £2million. He remained there on loan for another season but never actually made an appearance for the Red Devils.",
      "Having failed to earn a work permit to play in England Milinkovic-Savic was released in November 2015 and he signed a four-and-a-half-year contract with Polish club Lechia Gdansk, before later moving to Italy.",
      "The Serbian has said on his own future: “I have learned that setting goals is not a positive thing, it is better to do things with the lights off. Then in all teams there are replacements of players who are sold and bought, the important thing is to find the right players to strengthen the team.”",
      "Torino's president Urbano Cairo has spoken out and confirmed that no bid has yet been lodged: “He had a great championship and it is normal that he receives a lot of attention, but no offer has arrived yet.”",
      "Onana was signed two years ago by Erik ten Hag as David de Gea's replacement - after the club allowed him to leave at the end of his contract. The Cameroon shotstopper's ability with his feet was seen as a huge bonus, but he's made numerous mistakes that have led to goals in both his seasons in Manchester.",
      "Question marks hang over him in what is a massive summer for Ruben Amorim, who will need to be ruthless if his stint at Old Trafford is a success. The goalkeeper was recently dropped by his coach, but was quickly re-installed as the club's No 1 after less than a week.",
      "Altay Bayindir is expected to depart as he eyes more minutes to further his Turkey ambitions and a return to his homeland is on the cards. Tom Heaton - the club's third choice - has his contract expiring at the end of the season with no decision made on his future but there is an expectation that the veteran stopper could retire."
    ]
  },
  {
    "headline": "Premier League intervene to end Manchester United hopes of major advantage",
    "tags": [
      "Man Utd",
      "Premier League"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/manchester-united-europa-league-final-35176038",
    "image": null,
    "date": "2025-05-06 09:52:00",
    "source": "mirror",
    "body": [
      "The Premier League have moved Tottenham's clash with Aston Villa forward by two days to give them more time to recover ahead of a potential Europa League final against Manchester United. Spurs were originally scheduled to travel to Villa Park at 2:15pm on Sunday May 18.",
      "Meanwhile, United had been scheduled to play Chelsea away at 8pm on Friday May 16. Should both English clubs successfully navigate the second legs of their semi-final ties, United would've had 42 hours and 15 minutes more rest time compared to Spurs.",
      "Tottenham released a statement on Sunday morning confirming that they were in 'discussions with the Premier League regarding a change in date to our away Premier League match against Aston Villa, currently scheduled for Sunday May 18'. Now the change has been confirmed.",
      "The reason why United and Chelsea were originally moved to play in Friday's fixture slot is because both clubs are involved in the Women's FA Cup final at Wembley on the Sunday. United's men are firm favourites to reach the Europa League final after taking a commanding 3-0 lead from the first leg of their semi-final tie away to Athletic Bilbao last Thursday.",
      "As for Tottenham, it's less straightforward. Ange Postecoglou's side lead Norwegian minnows Bodo/Glimt 3-1 on aggregate but must travel to the Arctic circle for a tricky-looking second leg this Thursday.",
      "There's added pressure because of the fixture change, with the Premier League clearly anticipating an all-English final in Bilbao on Wednesday May 21. Postecoglou was asked about the potential disparity in recovery time ahead of Sunday's 1-1 draw at West Ham.",
      "Will Tottenham reach the Europa League final? Give us your score prediction in the comments section.",
      "\"I haven't looked too deeply into it, I don't know what sort of precedence there is to it,\" the Spurs boss replied. \"I know other leagues do it, which you kind of understand for a European final. I'll leave that to the powers that be and I'll concentrate on trying to get us there first of all.\"",
      "Postecoglou added: \"Bodo are there on merit. They beat Lazio, Olympiakos; they're tough teams. I'm from the other side of the world. It doesn't matter where you're from. We're going to treat them with the respect they deserve and give our best.",
      "\"Missing Patrick Berg is a loss for them but I think it's always been more about what they do as a team rather than individuals. They've sold a lot of players over the past five years but they've kept doing well.\""
    ]
  },
  {
    "headline": "What happened in the WSL this weekend as Manchester United clinch Champions League place",
    "tags": [
      "Man Utd",
      "Champions League"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/what-happened-wsl-weekend-manchester-35168917",
    "image": null,
    "date": "2025-05-06 08:00:00",
    "source": "mirror",
    "body": [
      "Manchester United secured their place in next season's Women's Champions League after coming from behind to draw with rivals Manchester City in an enthralling encounter at Old Trafford.",
      "Everton stunned Liverpool at Anfield to complete a derby double and Chelsea moved one step closer to completing an unbeaten season with victory over Tottenham Hotspur.",
      "Crystal Palace's Abbie Larkin struck eight minutes into stoppage time to rescue a point for her side against Leicester City and Aston Villa made it four wins in a row with a 3-2 win over West Ham United.",
      "Manchester United sealed their place in next season's Women's Champions League after overturning a two-goal deficit to draw 2-2 with rivals Manchester City at Old Trafford.",
      "Quickfire strikes from City pair Laia Aleixandri and Rebecca Knaak ensured Nick Cushing's side had the advantage before Grace Clinton pulled one back for the Red Devils moments ahead of the interval.",
      "Substitute Melvine Malard completed the comeback for Marc Skinner's side just five minutes after coming onto the pitch when she latched onto Elisabeth Terland's flick-on. The French international kept her composure to slot past Khiara Keating and spark the home fans at the Stretford End into wild celebration.",
      "Fellow substitute Aoife Mannion's dismissal for a second yellow card just one minute later set up a grandstand finish but Nick Cushing's side were unable to capitalize on their numerical advantage.",
      "Everton completed the league double over Liverpool with a 2-0 win over their rivals at Anfield. Katja Snoeijs and Karen Holmgaard were on target for the Toffees, as Brian Sorensen's side continued their strong end to the season.",
      "Just as she had done in the reverse fixture in November at Goodison Park, Snoeijs broke the deadlock when she fired past Rachael Laws. Holmgaard then asserted control of the tie when she stole in at the back post to double the Toffees' advantage with 20 minutes left on the clock.",
      "Her twin sister Sara was sent off for a second bookable offence after bringing down Olivia Smith in the 81stm minute but despite the hosts' superiority in numbers, Everton held out to claim bragging rights and move within two points of their neighbours.",
      "Championship-bound Crystal Palace came back from behind twice to rescue a point with a dramatic 2-2 draw against second-bottom Leicester City.",
      "Foxes forward Hannah Cain netted on the stroke of half time before Annabel Blanchard buried her 69th-minute spot kick to level the scores. Shannon O'Brien had seemingly decided the contest in Leicester's favour when she rifled an ambitious, long-range strike past Shae Yañez four minutes into added time.",
      "But Palace substitute Abbie Larkin replied moments later with the last kick of the game to ensure her side a share of the spoils and deny the Foxes a first away win of the season.",
      "Catarina Macario's first-half penalty fired title winners Chelsea past Tottenham Hotspur and left them on the brink of completing an unbeaten season. Macario was brought down in the box just after the half-hour mark and duly sent Lize Kop the wrong way with her spot kick.",
      "Spurs came close to levelling the scores when Charli Grant beat the Blues' offside trap but the Australian fluffed her lines and fired straight at Hannah Hampton. Down the other end of the pitch, Maika Hamano saw her long-range effort stopped by Kop before firing a strike over the crossbar after Macario threaded the ball into the Japanese's path.",
      "Kop was then called into action twice late on when she denied Ashley Lawrence and Sjoeke Nusken. The result leaves Chelsea one game shy of completing an invincible campaign while Spurs are now nine games without a win.",
      "Aston Villa made it four wins in a row after battling back from behind to defeat West Ham 3-2.",
      "An eventful first half saw both sides trade two goals each ahead of Chasity Grant's eventual winner. Ebony Salmon broke the deadlock for Villa after five minutes of play before Shekiera Martinez equalised with her 10th league goal of the season.",
      "Riko Ueki edged West Ham in front when she scooped the ball above Sabrina D'Angelo before coolly converting into an empty net, only for Rachel Daly to offer instant reply after intercepting Hammers skipper Katrina Gorry's wayward pass.",
      "Grant then settled the tie by racing clear of the Hammers backline before slotting the ball into the bottom corner."
    ]
  },
  {
    "headline": "Football news: Man Utd take brutal transfer stance as Liverpool give Alexander-Arnold send off",
    "tags": [
      "Man Utd",
      "LIVE"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/man-utd-transfers-alexander-arnold-35175533",
    "image": "https://i2-prod.mirror.co.uk/incoming/article34692206.ece/ALTERNATES/n615/0_Tottenham-Hotspur-FC-v-Manchester-United-FC-Premier-League.jpg",
    "date": "2025-05-06 07:00:00",
    "source": "mirror",
    "body": [
      "It is a busy time in the Premier League, with the season close to reaching its conclusion while plans take shape for the summer transfer window and beyond.",
      "There are now just three game weeks left in the top flight, with all eyes on the race for the European places after Liverpool secured the title and the three promoted teams were confirmed as relegated. Manchester City, Newcastle and Chelsea have opened up a gap to Nottingham Forest and Aston Villa for the Champions League, while Bournemouth and Brentford still harbour hopes of reaching the Conference League further down.",
      "In the Champions League, this week brings the second legs of the semi-finals, with Inter Milan hosting Barcelona on Tuesday night after their stunning 3-3 draw last week before Arsenal attempt to overturn their 1-0 deficit against Paris Saint-Germain on Wednesday.",
      "Thursday brings the Europa League semis, where Manchester United hold a commanding 3-0 lead over Athletic Bilbao for their home leg, while Tottenham could set up an all-English final due to their 3-1 win over Bodo/Glimt last week. That is the back drop for today's news, which has a focus on transfers.",
      "United are willing to sell just about any of their players this summer. Ruben Amorim's squad clearly needs an overhaul and the INEOS ownership are taking a pragmatic - and perhaps brutal - stance over the current crop of players.",
      "Bruno Fernandes is deemed untouchable and will not be sold, despite rumoured interest from Saudi Arabian side Al-Hilal. Fernandes has once again been easily the best player for United this season and Sir Jim Ratcliffe is not ready to sell off the crown jewels.",
      "The Portuguese midfielder exists in a category alongside veteran defender Harry Maguire, young attacker Amad and January signing Patrick Dorgu. But every single other player could be sold off to provide funds to be reinvested, with profit and sustainability rules a concern this summer.",
      "Trent Alexander-Arnold confirmed his exit from Liverpool on Monday, bringing to an end a season-long saga about his future. He is set to join Real Madrid on a six-year contract when his current contract expires at the end of June.",
      "The 26-year-old has three more games in a Liverpool shirt to enjoy and his team-mates have reacted to the news on social media. Curtis Jones, Cody Gakpo and Andy Robertson all described him as a “legend” in Instagram posts, as they paid tribute publicly to the two-time Premier League winner. Scotland captain Robertson added: “Brother for life!! We’ve been through it all together!”",
      "There doesn't appear to be any sour grapes in the dressing room. Harvey Elliott wrote: “Unbelievable player! Even better guy. Trent Alexander-Arnold Enjoy it brother. Thank you!\"",
      "Arsenal's season hinges on the events at the Parc des Princes on Wednesday night, when they face PSG in the second leg of the semi-final. Win and they will look forward to a Champions League final in Munich later this month. Lose and their whole campaign will have a different feel to it.",
      "New sporting director Andrea Berta is already looking further ahead, to the summer transfer window, which opens for business on June 1. The Gunners are chasing three big signings this summer, with Real Sociedad midfielder Martin Zubimendi the first, arriving for a £51million buy-out clause.",
      "Elsewhere, they want a top-class No.9 and a winger. Sporting Lisbon striker Viktor Gyökeres and RB Leipzig’s Benjamin Sesko more realistic targets than Newcastle’s Alexander Isak, while Athletic Bilbao’s Nico Williams is their dream ticket on the wing."
    ]
  },
  {
    "headline": "Antony explains biggest difference from Man Utd after shining yet again for Real Betis",
    "tags": [
      "Man Utd",
      "Antony"
    ],
    "link": "https://www.mirror.co.uk/sport/football/news/antony-manchester-united-real-betis-35170485",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35170860.ece/ALTERNATES/n615/0_antony.jpg",
    "date": "2025-05-06 07:00:00",
    "source": "mirror",
    "body": [
      "Manchester United flop Antony has heaped praise on Real Betis boss Manuel Pellegrini for helping him rediscover his mojo on loan in Spain. Antony, 25, continued his outstanding form for Betis on Sunday, scoring a magnificent winning goal in the 91st minute as they beat Espanyol 2-1.",
      "The crucial result moves them to within a point of fifth-placed Villarreal, who occupy the final Champions League spot in LaLiga. Antony's curling strike from outside the penalty area made it two goals in his last two appearances, having also netted in Thursday's Conference League semi-final first leg at home to Fiorentina.",
      "Antony joined Betis until the end of the season in January and has impressed so much that the Spanish side want to sign him permanently. There've even been reports that LaLiga giants Atletico Madrid have contacted United to discuss a move in the region of £34million.",
      "Goals like his strike on Sunday will do him no harm, as he looks a different player to the one who failed miserably at Old Trafford. Antony failed to live up to his £86m price tag during two-and-a-half tumultuous years at United, where he eventually found himself out of favour under new manager Ruben Amorim.",
      "But the Brazilian has clicked with former Manchester City boss Pellegrini, whose full support has left Antony feeling 'grateful'. \"It's very important because I've said in many interviews that I've found myself because I'm happy, things are going well,\" he told Movistar Plus post-match.",
      "\"The coach joked with me because I scored great goals with my right foot, but he asked me when I'd do it with my left foot. I gave him a hug after scoring because he's someone I care deeply about and I'm grateful for his trust.\"",
      "The winger, who now has seven goals and four assists in 20 games for Betis, also said: \"Very happy with the win, with the amazing goal at the end of the match. We knew it would be very difficult, and now we can enjoy the victory because it's very important.\"",
      "Betis chief executive Ramon Alarcon has said the club are 'cautiously optimistic' about the prospect of keeping Antony in Seville beyond the summer. Alarcon told Canal Sur: \"When we spoke about the possibility to bring Antony in January, I saw it more distant than I see now him staying.",
      "\"It's because both Manchester United and the player have seen that Real Betis is a great place for the player to develop. Right now I'm more optimistic than in January.\"",
      "The Betis CEO added: \"It's going to be difficult because he is a player owned by Manchester with financial conditions that are what they are. I am cautiously optimistic.\""
    ]
  },
  {
    "headline": "LiveTransfer News LIVE: Arsenal 'prepare £17m offer', Liverpool target Kerkez, Mbeumo update",
    "tags": [
      "Transfer News",
      "LIVE"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/transfer-news-live-manutd-liverpool-35175493",
    "image": "https://i2-prod.mirror.co.uk/incoming/article35183483.ece/ALTERNATES/n615/0_West-Ham-United-FC-v-Brentford-FC-Premier-League.jpg",
    "date": null,
    "source": "mirror",
    "body": [
      "The summer transfer window opens for business next month and Premier League clubs are wasting no time making moves",
      "Manchester United are looking to continue their overhaul under Ruben Amorim with a £62million move for Matheus Cunha in play. They're also looking at a new goalkeeper to challenge Andre Onana - and it may well be an old face.",
      "Arsenal are monitoring Lee Kang-In from French club PSG, while there could be plenty of changes at Liverpool. RB Leipzig's Xavi Simons and Stuttgart midfielder Angelo Stiller have both been linked while they need to figure out how to replace Trent Alexander-Arnold; on the other flank, Milos Kerkez is increasingly fancied as a long-term replacement for Andy Robertson.",
      "Elsewhere, Bryan Mbeumo looks increasingly likely to leave Brentford and has plenty of Premier League admirers, Alexander Isak has interest but Newcastle are loathe to sell and Leroy Sane may leave Bayern Munich, who are in pole position to land Germany star Florian Wirtz - he wants to go there rather than Manchester City.",
      "Real Betis want to keep Antony and hope the way they have looked after him could sway Manchester United in their direction this summer.",
      "Antony has been a key player since moving to Betis on loan in January and the Spanish side want to sign him on loan for another season.",
      "Betis chief executive Ramón Alarcón told El Desmarque: “Obviously, if someone comes with a very high offer, he’s a great player for Manchester, and they have the final say.",
      "“But we’ve always worked with respect. Every week, Manu Fajardo, who has done a spectacular job, has sent them the report from the player’s week of training, the tactical and physical report from the player’s match, and they’ve seen that we’ve taken very good care of their asset.",
      "“We also have to value the player’s commitment, as he has 20 days left with the team and is like one of the team members. We’ll see when summer arrives if there’s an option to bring him in for another year.\"",
      "Darwin Nunez's future at Liverpool is very uncertain after an inconsistent season in which he failed to win the trust of Arne Slot.",
      "A move to Atletico Madrid has been suggested - and looks a good fit for all parties - but now reports in South America suggest he has been offered to Argentinian giants River Plate.",
      "Arsenal are preparing an offer to sign Valencia defender Cristhian Mosquera, according to Cadena Ser.",
      "Mosquera, a 20-year-old centre-back, is under contract until June 2026, but is likely to move this summer so he can earn Valencia a transfer fee.",
      "He will reportedly fetch around €20million (£17m) and Arsenal are apparently 'preparing an offer' and are ‘confident of being able to negotiate’, despite Atletico Madrid and Villarreal lurking.",
      "Antony has suggested he is keen to stay with Real Betis over the summer transfer window.",
      "The Brazilian winger is on loan with Manchester United is flourishing in Seville. “The best decision I’ve ever made was coming to Betis,\" Antony said. “I’m happy — and when I’m happy, things go well. It’s very early. I don’t know what’s going to happen but I’m very happy here.”",
      "Brentford captain Christian Norgaard has admitted that the club will struggle to hold onto Bryan Mbeumo this summer.",
      "Mbeumo has been one of the stand-out players in the Premier League this season, scoring 18 goals and adding six assists in 35 appearances, and has attracted interest from Manchester United and Arsenal.",
      "Brentford reportedly value Mbeumo at £60million.",
      "Leroy Sane looks set to leave Bayern Munich this summer, with sporting director Christoph Freund admitting publicly that the club are searching for his replacement.",
      "Sane had appeared likely to sign a new contract with Bayern, but reportedly changed agents and altered his demands, with Arsenal among the other interested parties.",
      "Asked if Bayern were prepared for Sane's exit, Freund told Sport1: \"Yes, absolutely. We’re always scouting and exploring the market. If a new situation arises, we would have to work on it intensively.”",
      "Florian Wirtz only has eyes for Bayern Munich, with reports in Germany throwing Manchester City's pursuit of the Bayer Leverkusen star into massive doubt.",
      "City thought they moved to the front of the queue given Leverkusen's interest in their midfielder James McAtee and goalkeeper Stefan Ortega and they hoped to use that as leverage in their bid to sign Wirtz.",
      "Leverkusen officials travelled to City's Etihad Campus for talks over the duo, with the Germans quoted £25million for McAtee, leading to confidence that the Wirtz deal could soon become a formality.",
      "But the attacking midfielder is only interested in joining Bayern, providing a huge blow in City's quest to replace Kevin De Bruyne.",
      "Liverpool have made Bournemouth defender Milos Kerkez their top priority in the summer transfer window, according to The Telegraph.",
      "Kerkez has enjoyed a wonderful campaign for the Cherries and is rated higher than Wolves' Rayan Ait-Nouri by Liverpool's scouting department.",
      "Kostas Tsimikas could depart Anfield this summer and Kerkez is wanted as competition for Andy Robertson, who wants to sign a new contract.",
      "Manchester City are not concerned about the potential impact if they are found guilty of breaching Premier League rules and still plan to splash the cash this summer, according to the i.",
      "The report states that the arbitration process over the 115 charges brought by the Premier League will drag on for some time, so City won't hestitate to spend.",
      "Bayer Leverkusen star Florian Wirtz is the player mentioned as a top target, with Kevin De Bruyne leaving.",
      "So, Trent Alexander-Arnold is going - and he won't be the only exit from Liverpool this summer, writes David Anderson.",
      "Darwin Nunez and Caoimhin Kelleher are two of the other most likely high-profile exits, but there are as many as eight on the cards as Arne Slot fine-tunes his Premier League-winning squad.",
      "Barcelona would find it 'very difficult' to sign Bayer Leverkusen right-back Jeremie Frimpong, who Liverpool have also been linked with. Frimpong, 24, has shone for Leverkusen again this season, excelling as a wing-back under Xabi Alonso.",
      "The Netherlands international's performances have led Barca manager Hansi Flick and the club's sporting director, Deco, to agree on pursuing him. But, as reported by Sport, Barcelona's well-documented financial woes would make signing Frimpong a challenge, despite his release clause being a relatively low £34million.",
      "Man United are reportedly eyeing Torino star Vanja Milinkovic-Savic as a potential signing as they look to bring in a new goalkeeper. According to Tutto Mercato, the Serbian has caught the eye of Old Trafford chiefs.",
      "He reportedly has a €20million (£16.9m) release clause written into his contract with the Italian side. United could face competition for his services though, with Manchester City and Chelsea both interested.",
      "Milinkovic-Savic has had a previous spell at Old Trafford. In May 2014, United reached an agreement to sign the goalkeeper from Vojvodina, paying £2million. He remained there on loan for another season but never actually made an appearance for the Red Devils. The club were eventually forced to release him after he failed to obtain a work permit.",
      "Arsenal are plotting a move for Paris Saint-Germain star Lee Kang-In. The South Korean has fallen out of favour at the Parc des Princes and is free to leave the French capital in the summer.",
      "According to The Sun, the Gunners are ready to revive their interest in Lee, having explored a deal in January. Sporting director Andrea Berta is said to be a huge fan of the 24-year-old and will push for a summer move.",
      "PSG are keen to to recoup the £18.7million they paid Mallorca for him and will not listen to any offers below £17m. Lee is understood to be ready to leave Paris, with the hopes of completing a quick deal said to be high.",
      "We will keep you up to date with all the latest from the Premier League and beyond.",
      "Liverpool are among the clubs interested in signing Ajax star Jorrel Hato this summer, per reports. The Reds join Chelsea as a side showing a \"strong interest\" in the defender.",
      "Wolves are among a number of clubs interested in signing Liverpool midfielder Harvey Elliott. The Reds star has admitted he wants to fight for his Liverpool future but the decision may not be exclusively in his hands.",
      "Liverpool are said to value him at more than £40million.",
      "Jack Kingdon, Sam Murray and James Nolan are all set to leave Manchester United at the end of the season. The trio are all out of contract this summer and will depart on frees after not being offered new terms.",
      "Full story.",
      "Newcastle United are set to join the race for Bayer Leverkusen centre-back Jonathan Tah. The 29-year-old will be available on on a free transfer this summer and is driving interest from Manchester United, Barcelona and Real Madrid.",
      "Newcastle, according to the Sun, are keeping tabs on the defender.",
      "Arsenal are showing fresh interest in Mohammed Kudus, per talkSPORT and have added the Irons star to their list of potential transfer targets.",
      "Kudus, who has also been linked to Liverpool, has a £125m release clause for Saudi Arabian teams in his contract, according to the Daily Mail.",
      "For Premier League clubs, the figure is said to see a smaller £85m cost and that is what West Ham hope to earn if they sell this summer.",
      "The Telegraph claim that Rayan Ait-Nouri is to be offered a new contract amid interest in his signature, with Liverpool said to have watched the full-back.",
      "The forward once tipped to succeed Wayne Rooney and Robin van Persie has found himself without a club aged 29. James Wilson bagged a brace on his United debut at 18, but has been unable to impress at Northampton Town this season.",
      "Full story.",
      "Wilfried Zaha has all but ruled out a return to Crystal Palace in the future and appears content with his legacy at the club.",
      "Zaha departed the Eagles a legend in 2023, and is currently on loan at Charlotte FC from Galatasaray.",
      "\"I'll be honest,\" he said. \"I'm 32 now. I'm not one of those guys that are trying go back to a team when I've got no legs.",
      "\"Palace are thriving now, they are in a final. Some things are just better left. I did what I did, I am what I am there, I done what I done for the club. Best to just leave it how it is.",
      "\"I don't want to just come back and I wasn't the Wilf I was before... then you just ruin your legacy man. I'll just appreciate Palace from afar. Never say never, you don't know, but it's the reality.\"",
      "Dean Huijsen is keeping tight-lipped over his future amid links to the likes of Chelsea, Liverpool and Arsena. Speaking to AS after the Cherries win over Arsenal, he said: \"The future? I'm having a good time and not thinking about it...",
      "\"I don't know... I'm a 'chill' guy, like I do when I celebrate [laughs]. I don't think about it much.",
      "\"Every day I go to training, to play in the games, and I'm happy. I'm having a good time and I'm not thinking about that. You are the ones to judge that; I'm not thinking about that, I'm focused on Bournemouth.",
      "\"We're having a very good season. We've already broken the points record and we want to get as many points as possible this season.\"",
      "We've already mentioned Benjamin Sesko's unique release clause today and the forward has also spoken about his future today. The RB Leipzig forward has kept his cards close to his chest but an exit appears to be looming.",
      "\"Right now, I’m 100 per cent focused on RB Leipzig,\" the striker told Sky Germany on Tuesday. Then we’ll see what happens. It’s open, anything can happen.\"",
      "Manchester United, unsurprisingly, have no intention of selling Bruno Fernandes to Saudi Arabia this summer, per the MEN.",
      "Monday night saw reports that suggested Al-Hilal are planning to swoop to sign United's talisman Fernandes emerged. But the Red Devils have no intention of entertaining any offer for their star.",
      "More on Trent Alexander-Arnold after the Liverpool defender confirmed he will exit Anfield at the end of the season. Reports have suggested that Real Madrid would like to sign the full-back in time for the Club World Cup.",
      "With that in mind, BBC Sport claim Los Blancos are preparing an offer of £850,000.",
      "Chelsea have no plans to sell Marc Cucurella amid links to Real Madrid and Barcelona, per reports. After a difficult start to his Stamford Bridge career, Cucurella has transformed into a consitent presence for the Blues.",
      "And it is said that Chelsea are no longer considering offers for a player well-liked by Enzo Maresca.",
      "The Manchester United ace, on loan at Real Betis, has been enjoying his time in La Liga since moving earlier this year. The Brazilian's future lies away from Old Trafford, though it is currently uncertain where.",
      "\"The future? It's very early; I don't know what's going to happen, but I'm very happy here,\" he said.",
      "\"I've found myself enjoying football. It's crazy right now, although I know how talented I am, so I prioritised going where I knew I'd be happy, even though I had better offers.\"",
      "Former Premier League star Tim Howard has urged Liam Delap to join Chelsea.",
      "\"Honestly, I think Chelsea are desperate for a striker,\" he told NBC Sports. \"The Manchester United pull, I think for a player like him, it’s still there. Whether that feels different because he was a City player…",
      "\"I like the Chelsea profile, I like the young team. He goes into a young team and there’s goals there.\"",
      "Staying in Germany, Arsenal have been handed some bad news regarding the future of striker Benjamin Sesko, with his release clause rising rapidly.",
      "As per Sky in Germany, the forward's release clause goes up depending on how he performs. As it stands, that sits at €80 million (£68m).",
      "It is detailed that Leipzig might accept €75m (£64m) but only with an additional €15m (£13m) in add-ons."
    ]
  },
  {
    "headline": "Manchester United transfer stance on Bruno Fernandes as Saudi Arabia comes calling",
    "tags": [
      "Man Utd",
      "Fernandes"
    ],
    "link": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-saudi-arabia-fernandes-35175518",
    "image": null,
    "date": "2025-05-06 06:17:00",
    "source": "mirror",
    "body": [
      "Saudi Arabian outfit Al-Hilal are ready to lodge a hefty offer to Manchester United as they look to land Bruno Fernandes this summer - but the Premier League side have no plans to sell.",
      "Fernandes has been a shining light at Old Trafford this year and could be the subject of a massive bid. The Saudi Pro League club have the funds for a mega signing after Mohamed Salah decided to stay at Liverpool, with talks being held about pursuing the Portugal star.",
      "It is understood there was initial contact between the two parties last year before Fernandes signed a new contract to keep him in Manchester until 2027. Reports in the Middle East though claim Fernandes' representatives held talks with Al-Hilal on Monday.",
      "The Daily Mail reports that there has been no formal offer from Al-Hilal and, if even one was lodged, the Manchester outfit have no plans to sell Fernandes. The 30-year-old is closing on 40 goal contributions this season, having scored 19 times and provided 18 assists.",
      "Al-Hilal are one of the major outfits in the Saudi Pro League and are very much in the market for a marquee player after missing out on Salah. They're looking to land a big name before the Club World Cup this summer, but also need to find a new manager.",
      "Only last month Ruben Amorim rejected the possibility of his talisman leaving for Real Madrid at the end of the season - underlining his importance as the club's captain and leading light. He said: \"No, it's not going to happen. He's not going anywhere because I've already told him!",
      "\"I want Bruno here because we want to win the Premier League again, so we want the best players to continue with us. He's 30, but he's still so young, because he plays 55 games every season. Between assists and goals, he's there for 30 at least, so he's the type of player we want here and he's not going anywhere.\"",
      "Fernandes has revealed that he could have left the club back in the summer before holding talks about his next move. The playmaker sought clarity about where and how they viewed him at Old Trafford before he was given reassurances about his standing at the club.",
      "\"They said what they wanted from me,\" he said. \"I just asked if they still see me as part of the future of the club or not. I spoke at the time with (Erik) Ten Hag also. He was very clear with me - the club was very clear with me - that they thought I would be a big part of this rebuild. I thought that we could be successful.\""
    ]
  },
  {
    "headline": "Athletic Bilbao suffer triple injury blow as key men missing from squad vs Manchester United",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/athletic-bilbao-suffer-triple-injury-31586550",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United have received a triple boost after Athletic Bilbao manager Ernesto Valverde named his 24-man squad that will travel to Manchester for Thursday's Europa League semi-final second leg.",
      "The Spanish side will be without both Nico and Inaki Williams, as well as top goalscorer Oihan Sancet, through injury.",
      "Nico Williams has been linked with a move to some of the top clubs in Europe this summer. He produced some excellent performances en route to Spain winning last summer's European Championship.",
      "He has bagged 11 goals and seven assists this term so it will be a huge boost to Ruben Amorim and his United players to see he hasn't made the trip to Manchester.",
      "His older brother, Inaki, who has 11 goals and nine assists to his name this term, will also miss the trip to Old Trafford and Sancet is also not fit enough to return.",
      "The 25-year-old has scored 17 goals this season but missed the first leg through injury and he hasn't recovered in time to face United.",
      "The 24-man travelling party will fly from Bilbao this morning at 10am BST and are expected to arrive at their Manchester hotel at 12:45pm BST.",
      "Nearly 4,000 Athletic fans will make the trip to Manchester as they hope their side can recover from losing the first leg 3-0.",
      "A brace from Bruno Fernandes and a goal from Casemiro put United in a commanding position to reach the Europa League final later this month.",
      "The final will take place in Bilbao and the winner of this tie will face either Tottenham Hotspur or Bodo/Glimt for the chance to lift the trophy and secure the added boost of Champions League qualification next season.",
      "Athletic Bilbao squad to face Manchester United: Unai Simón, Agirrezabala, Santos, Gorosabel, Paredes, Yeray, Vesga, Berenguer, A. Djaló, Guruzeta, Núñez, I. Lekue, Ruiz de Galarreta, Yuri, De Marcos, Unai G., Maroan, Jauregizar, Prados, Canales, Adama, Olabarrieta, Rego and Varela."
    ]
  },
  {
    "headline": "RAILSTON: Manchester United have a wildcard bench option to frighten Athletic Bilbao in Europa League",
    "tags": [
      "Man Utd",
      "Europa League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-wildcard-bench-option-31582255",
    "image": null,
    "date": "2025-05-07 04:00:00",
    "source": "manchestereveningnews",
    "body": [
      "Brentford defender Rico Henry was lulled into a false sense of security by Amad, who pounced at the right moment with a sharp turn of foot to score for Manchester United last weekend.",
      "The winger cut inside and scored with a driven shot. It was slightly fortuitous, as Brentford goalkeeper Mark Flekken shouldn't have been beaten, but Amad did brilliantly to create the opening.",
      "Amad had a chance of winning the Sir Matt Busby Player of the Year award until he picked up an ankle injury in February, and now Bruno Fernandes has surged to favouritism for the prize.",
      "Fernandes and Amad have been the standout performers in an awful campaign, although only Fernandes is guaranteed to start against Athletic Bilbao in the Europa League semi-final.",
      "Amad has just returned from his ankle issue and Brentford was his second substitute appearance since his rehabilitation, which suggests he'll start on the bench on Thursday night.",
      "If Amad started against Brentford and got something like 70 minutes under his belt, the chances of him starting against Bilbao would have increased, but he came on at half-time.",
      "Amad couldn't have done much more to make a case to start in the most important game of the season - he was influential and scored a goal - but Amorim is likelier to continue with Fernandes and Alejandro Garnacho in the No.10 roles, which is where they started in the first leg.",
      "Manuel Ugarte and Casemiro started in the pivot at the Estadio de San Mames, and a repeat of that defensive team selection would be logical, especially given United have a 3-0 advantage.",
      "That does mean Amad would be named on the bench. He would probably be surprised to start after only just coming back from injury and can still play an important role in the tie.",
      "Last week, Amorim said about Amad's injury: \"It was really tough on us because in that moment, he was the player that created all the situations and then pass a little bit for Bruno.",
      "\"So to lose a player like that in that moment with a lot of games was really hard for us and especially for Amad, because he was leaving [us at] a good moment. But now he's returning.",
      "\"You can feel that he's not so explosive in the moment [due to only just returning], but he's a player with a characteristic left foot, different from Garnacho, that has one against one. And we don't have many players who are able to do that. So it's massive for us. And he's one more option to play.”",
      "Amorim confirmed Amad is still not 100 per cent, which is understandable given he hasn't started a game for three months, but he will still be a tremendous option to have on the bench.",
      "Scoring just once in the second leg might be enough for United to progress to the Europa League final, and Amad could cause chaos against a tired and desperate Bilbao side who could be chasing the game at Old Trafford.",
      "The longer the game goes on, the more stretched it will become as Bilbao commit bodies forward for a goal, and they won't be able to catch a fresh Amad on the counter-attack if he's introduced from the bench.",
      "Amad was a guaranteed starter until he picked up an injury in training and having a player like that on the bench, someone who can change the game, is obviously a huge boost for Amorim.",
      "United haven't had much good news this season, but Amad's return has been great to see."
    ]
  },
  {
    "headline": "MARSHALL: Surprise Manchester United contract decision hints at transfer risk over two fan favourites",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/surprise-manchester-united-contract-decision-31582333",
    "image": null,
    "date": "2025-05-07 06:00:00",
    "source": "manchestereveningnews",
    "body": [
      "For a club boasting the kind of record of producing academy talent that Manchester United do, the idea they might need to consider contract decisions to fulfil Premier League and UEFA squad rules would normally sound fanciful.",
      "But as they consider offering third-choice goalkeeper Tom Heaton a 12-month contract extension, there is a degree of pragmatism in the decision ahead of a summer when a number of academy players could see their future come into sharper focus.",
      "There is sense in offering Heaton a deal into his 40s anyway. He is a reliable goalkeeper, with relatively low mileage in recent years, offers plenty of experience and is considered something of a dressing room leader at Carrington.",
      "Having come through the ranks at the club more than two decades ago, he is also an academy graduate. That brings not only an understanding of how the club operates as well as an insight into the standards required under Sir Alex Ferguson, but also the status of a home grown player under Premier League and UEFA rules.",
      "If United want to name a full 25-man squad in the Premier League next season, they must have eight players occupying home grown status (this season they had seven). To name a 25-man squad in a European competition, they also need eight home grown players, but four of those must be 'club-trained', which means they must have been on the club's books for at least three years between the age of 15 and 21.",
      "This season, United occupied those four slots with Heaton, Dermot Mee, Jonny Evans and Marcus Rashford. They named Kobbie Mainoo and Alejandro Garnacho on the B list, but could promote them to the A list to meet the club-trained criteria if required.",
      "In the Premier League there are no rules about club-trained players, and this season Evans, Heaton, Harry Maguire, Mee, Mason Mount, Rashford and Luke Shaw filled the seven home grown slots. Mainoo and Garnacho could again supplement this list, as could Harry Amass and Toby Collyer.",
      "The issue for United ahead of a potentially busy summer transfer window is that a lot of these players face uncertain futures, especially when it comes to that smaller group of club-trained players. That would only be an issue if United win the Europa League and need to name a squad for the Champions League next season, but that is now a realistic prospect and requires planning for.",
      "Of the quartet that filled those slots this season, Mee will turn 23 in November and is yet to get a look in at first-team level. He is only going to be fourth-choice goalkeeper next season if he stays at the club. Evans is set to leave when his contract expires this summer and Rashford is set to be sold after his loan at Aston Villa.",
      "There is also uncertainty over the future of Mainoo and Garnacho. United were open to offers for both in January as they looked to raise funds to reinvest and as academy graduates their sales would be considered as pure profit under the Premier League's Profit and Sustainability rules (PSR).",
      "Mainoo is yet to agree terms over a contract extension and Garnacho had interest from Chelsea and Napoli this summer. His performances have improved under Ruben Amorim but there is competition for places in the No. 10 roles and he is not yet considered a natural fit in the Portuguese's 3-4-2-1 system.",
      "If Evans, Rashford and even one of Mainoo and Garnacho depart, that could leave United light on club-trained players. That's the extra context that might make a decision to keep Heaton a sensible one.",
      "It's rare that third-choice goalkeepers end up playing an active role on the pitch, but for training and squad purposes, clubs not want an experienced player in that role. Heaton fits that brief, as well as offering United the chance to fill an academy graduate spot in squads.",
      "£30.99"
    ]
  },
  {
    "headline": "I signed for Man United as a teenager but couldn't get a work permit - now I could re-join for £17m",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/signed-man-united-teenager-couldnt-31583169",
    "image": null,
    "date": "2025-05-07 05:00:00",
    "source": "manchestereveningnews",
    "body": [
      "Manchester United's search for a new goalkeeper this summer could well prove to be one of the biggest transfer narratives of the window.",
      "Andre Onana has failed to convince during his first two seasons at the club following a £47million move from Inter Milan and there is talk of clubs from the Saudi Pro League being interested in his services.",
      "Similarly, second choice goalkeeper Altay Bayindir has failed to impress during his first two years at Old Trafford and could move on for first team football as he bids to be Turkey's number one ahead of the 2026 World Cup.",
      "With that in mind, United could be in the market for two goalkeepers this summer and one name that has been mooted as a potential option should be well known to those who were at the club during between 2014 and 2016.",
      "Torino goalkeeper Vanja Milinkovic-Savic has been one of the most consistent goalkeepers in Serie A this season and is a Serbian international who has played in a World Cup.",
      "But prior to that he was on United's books as a teenager, having signed for the club from Serbian side Vojvodina in 2014, and he was part of a Serbia side that won the under-20 World Cup a year later.",
      "However, he couldn't get a work permit to play for United because Serbia were not part of the European Union and after 18 months at United he was forced to leave on a free transfer as he joined Polish side Lechia Gdansk.",
      "\"I had to go back to Manchester, but there is a problem with a work permit in England,\" he told the Lechia website.",
      "\"The case dragged on, unfortunately. I couldn’t find a club where I could be loaned to.",
      "\"I decided to terminate the contract with Manchester United. I am glad that I was able to come to an agreement with Lechia.\"",
      "After impressing in Poland he joined Torino a year later and after various loan spells he has now established himself as the club's number one.",
      "The 28-year-old, whose older brother (Al-Hilal midfielder) Sergej Milinkovic-Savic has often been linked with a move to Old Trafford, has a release clause of £16.9million and has also been linked with Chelsea and Man City.",
      "In a summer where United will have to count their pennies, he could be a dependable option at an affordable price and he would arrive with a point to prove more than nine years since leaving the club.",
      "£30.99"
    ]
  },
  {
    "headline": "Man United transfer news LIVE - Vanja Milinkovic-Savic move, Bruno Fernandes offer, Osimhen twist",
    "tags": [
      "Transfer News",
      "Fernandes",
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-united-transfer-news-live-31577814",
    "image": null,
    "date": "2025-05-07 11:11:00",
    "source": "manchestereveningnews",
    "body": [
      "Hello and welcome to our live blog on the latest Manchester United transfer news, views and gossip.",
      "The Reds will still be recovering from Sunday's 4-3 defeat to Brentford in the Premier League but will acknowledge that their primary focus remains on winning the Europa League.",
      "Ruben Amorim's men will host Athletic Club at Old Trafford in the second leg of their Europa League semi-final on Thursday night, and do so with a 3-0 advantage from the first leg.",
      "Off the pitch, United are being linked with several potential signings ahead of the summer transfer window.",
      "Reports in recent days have seen United credited with an interest in re-signing goalkeeper Vanja Milinkovic-Savic from Torino. There also continue to be rumours linking United with a move for in-demand Wolves forward Matheus Cunha when the summer transfer window opens.",
      "In terms of exiting members of the United squad, some players are also being linked with transfers away from Old Trafford this summer. For instance, reports have emerged, once again, claiming that Alejandro Garnacho may be on the move before the start of next season.",
      "There has been reports suggesting that Bruno Fernandes could come under the watchful glare of the Saudi Pro League, as well as the future of Antony who has been in fine form for Real Betis.",
      "With this in mind, keep across all the latest United transfer news in our live blog below;",
      "Manchester United have received a triple boost after Athletic Bilbao manager Ernesto Valverde named his 24-man squad that will travel to Manchester for Thursday's Europa League semi-final second leg.",
      "The Spanish side will be without both Nico and Inaki Williams, as well as top goalscorer Oihan Sancet, through injury.",
      "Nico Williams has been linked with a move to some of the top clubs in Europe this summer. He produced some excellent performances en route to Spain winning last summer's European Championship.",
      "Read more here",
      "Borussia Dortmund are reportedly not interested in re-signing Jadon Sancho.",
      "German publication Sport Bild claim that Dortmund have ruled out a third stint with the Manchester United forward, but that other Bundesliga clubs might still be interested.",
      "Manchester United's search for a new goalkeeper this summer could well prove to be one of the biggest transfer narratives of the window.",
      "Andre Onana has failed to convince during his first two seasons at the club following a £47million move from Inter Milan and there is talk of clubs from the Saudi Pro League being interested in his services.",
      "Similarly, second choice goalkeeper Altay Bayindir has failed to impress during his first two years at Old Trafford and could move on for first team football as he bids to be Turkey's number one ahead of the 2026 World Cup.",
      "Read the full piece here",
      "Wolves forward Matheus Cunha has sent a message on social media amid interest from Manchester United.",
      "United are reportedly eyeing up a move for Cunha ahead of the summer transfer window as they look to bolster Ruben Amorim's attacking options. The Brazil star has been a standout performer for Wolves this season - netting 15 Premier League goals in 30 appearances so far in 2024/2025.",
      "Read more here",
      "Journalist Fabrizio Romano, who specialises in transfers, has provided the latest on Inter Milan star Yann Bisseck amid links with Man United",
      "\"There are clubs in England and also in Bundesliga, but from what I heard nothing is advanced at this stage. It’s not an imminent deal,\" he said in his latest newsletter for GiveMeSport.",
      "Footmercato have reported that Manchester United have spoken with Victor Osimhen's entourage over a possible move. It has been claimed that his form for Galatasaray has earned potential suitors from the Premier League and Saudi Arabia.",
      "Although, it has been suggested that he is only tempted by a move to England's top-flight. And with United reportedly unhappy with their attacking options, plans for a number nine are being draw up with Victor Gyokeres also on the list but Osimhen is viewed as an alternative.",
      "United captain Bruno Fernandes has been offered a three-year contract with Al-Hilal, according to GIVEMSPORT. The Saudi Pro League side are confident of agreeing a deal and signing the 31-year-old, who is yet to respond to the club's proposal, in the summer transfer window.",
      "Hello and welcome to our live coverage of the latest Manchester United news.",
      "It's all about the Europa League for the Reds and preparations are well underway for Thursday's second leg against Athletic Bilbao at Old Trafford.",
      "One eye will also be on the summer transfer window and a potential rebuild under Ruben Amorim.",
      "Stay with us throughout the day for all the latest from M16!",
      "Thank you for joining us tonight.",
      "Join us tomorrow for more Manchester United transfer news tomorrow as well as words from Ruben Amorim!",
      "Jack Kingdon, Sam Murray and James Nolan are set to leave Manchester United this summer.",
      "Several first-team and academy players will depart this summer, and the futures of those three players have already been decided.",
      "More on Bruno Fernandes here and it doesn't bode well for Man United.",
      "According to Ben Jacobs, Saudi giants Al Hilal are considering offering a British record transfer fee to land Fernandes in the summer. Right now, that fee is currently £115million.",
      "A three-year contract worth £65million per season is said to be the offer for the Portugal international.",
      "Man United are planning to hold talks with highly-rated defender Harry Amass over a new contract, according to Fabrizio Romano.",
      "The defender has been integrated into Ruben Amorim's team in recent months and it's said he could play a key part in United's season.",
      "Tuttomercato claim that United are interested in Italian defender Pietro Comuzzo and that they have sent scouts to monitor the Florentina star.",
      "They claim that the Reds have shown concrete interest in Comuzzo, sending scouts multiple times to observe him closely. It is said that the club may soon take more decisive steps to secure his signature.",
      "Manchester United are preparing a new tifo banner to be unveiled at Old Trafford before the Athletic Bilbao game.",
      "United displayed a tifo banner at Old Trafford for the first time in the stadium's history before Lyon in the previous round of the Europa League, and a new design will be unveiled for Bilbao.",
      "Ruben Amorim's side are 3-0 up in the semi-final tie after a comfortable win in the Basque Country last week, but Amorim will be cautious and knows the job must be finished on Thursday.",
      "Read more here",
      "Manchester United have no intention of selling Bruno Fernandes to Saudi Arabia.",
      "Reports suggesting Saudi club Al-Hilal are planning to swoop for Fernandes emerged on Monday night, but United have no intention of entertaining offers for the instrumental Fernandes.",
      "Al-Hilal were interested in signing Mohamed Salah from Liverpool, but Salah recently committed his future to Anfield and reports claim the Saudi club still want to make a marquee signing.",
      "Read more here",
      "Watford FC have sacked head coach and former Manchester United midfielder Tom Cleverley.",
      "The 35-year-old had initially stepped in to steady the ship towards the end of the 2023/24 season, before being officially appointed last summer. The Hornets were contenders for a play-off spot earlier this season but their form dipped with only five victories recorded in 2025.",
      "Read more here",
      "Manchester United have not seen a lot of bad news come out of Liverpool in recent years.",
      "Trent Alexander-Arnold's departure, however, could be a serious blow to Arne Slot's team. The versatile right-back has his flaws, particularly when it comes to concentration, but make no mistake that Liverpool have lost a generational talent and that will sting.",
      "The fact that he is also departing Anfield on a free transfer will only make it more painful for United's great rivals. As an academy graduate, any transfer fee received would have gone down as pure profit on Liverpool's balance sheet. Due to the league's profit and sustainability rules (PSR), pure profit is like gold dust for Premier League clubs.",
      "Read the full piece here",
      "Ralf Rangnick has slammed the direction of Manchester United since his departure from Old Trafford in 2022.",
      "The German was placed in temporary charge - in December 2021 - following the sacking of Ole Gunnar Solskjaer. Rangnick guided United to sixth position in the Premier League standings five months later.",
      "But his scheduled move into the club's boardroom was cancelled after Erik ten Hag's arrival from Ajax in 2022 and he left the club that summer. The former RB Leipzig boss became renowned for his blunt criticism of the problems at M16 - infamously stating that United needed \"an open heart operation\" to progress.",
      "Read more here",
      "Athletic Bilbao star Nico Williams has fired a warning to Manchester United.",
      "The Spanish outfit trail by three goals going into their Europa League semi-final second-leg but they will look to follow Lyon to try stun United.",
      "He said:",
      "\"We weren't very sharp, there's no need to make excuses.",
      "\"We're 3-0 down, but we're capable of overcoming that.",
      "\"We've already seen that Lyon gave them problems at home and we're going to try and do the same.",
      "\"The work of the entire season speaks for itself.",
      "\"We're in the final stretch of our dream. Our fans have always supported us and we're going to give it our all.\"",
      "In a report from TBR Football, Manchester United are among the three Premier League clubs interested in Fiorentina defender Pietro Comuzzo.",
      "The Italian, 20, is said to be on the radar of Arsenal and Chelsea with his services highly rated in the Italian top-flight.",
      "The outlet has claimed that enquiries have been made for the defender.",
      "Arsenal and Chelsea have been cited due to their need for reinforcements at the back, while United have been mooted as a team planning for the future with the need for alternatives to Harry Maguire and co.",
      "Footmercato have reported that Manchester United have spoken with Victor Osimhen's entourage over a possible move.",
      "It has been claimed that his form for Galatasaray has earned potential suitors from the Premier League and Saudi Arabia.",
      "Although, it has been suggested that he is only tempted by a move to England's top-flight.",
      "And with United reportedly unhappy with their attacking options, plans for a number nine are being draw up with Victor Gyokeres also on the list but Osimhen is viewed as an alternative.",
      "The report mentions Liam Delap too but seemingly suggests that he plays for Everton.",
      "According to reports, Manchester United have set Antony's price-tag in the region between €40million and €50million.",
      "Sources have informed outlet Trivela that two clubs have contacted his agent.",
      "They say talks were initiated to find out his plans at Old Trafford and they are not advanced, nor were figures mentioned during the talks.",
      "Atletico Madrid have been linked in recent weeks but no clubs were named in the report.",
      "According to Fabrizio Romano, Man United have added Torino goalkeeper Vanja Milinkovic-Savic to their list of targets.",
      "It has been claimed that initial contact has been made to explore a potential summer deal.",
      "United have had difficulties between the sticks this season with Andre Onana and Altay Bayindir making high-profile mistakes during a dismal campaign.",
      "Romano, via GiveMeSport, has claimed that United have asked Torino for information on Milinkovic-Savic's price-tag with sources suggesting that he is expected to leave in the summer.",
      "Reports suggesting Saudi Arabia club Al-Hilal are planning to swoop for Bruno Fernandes emerged on Monday night.",
      "However, Manchester United have dismissed the claim and have no intention of selling the captain, our Manchester United writer Steven Railston has reported.",
      "Real Madrid have been previously linked with his services.",
      "Fernandes is considered a key player for Ruben Amorim's ongoing rebuild at Old Trafford.",
      "Last year, he signed a contract extension until the summer of 2027, with the option of another year.",
      "Fernandes won the Sir Matt Busby Player of the Year award for a third time last season, and he is set to win it again. Only David de Gea and Cristiano Ronaldo have won it four times.",
      "Hello and welcome to your dedicated Manchester United blog.",
      "We will be active throughout the day, bringing you all the latest news and transfer gossip.",
      "United are in action in the coming days when they host Athletic Bilbao in the Europa League second-leg.",
      "Ruben Amorim's side have a three-goal lead but as was the case against Lyon, it isn't always so simple.",
      "Let's get cracking, shall we?"
    ]
  },
  {
    "headline": "Ruben Amorim press conference live early Man United team news and injury latest vs Athletic Bilbao",
    "tags": [
      "Amorim",
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/live-man-united-press-conference-31586843",
    "image": null,
    "date": "2025-05-07 11:15:00",
    "source": "manchestereveningnews",
    "body": [
      "Ruben Amorim will conduct his pre-match press conference this afternoon as he previews Manchester United's clash with Athletic Bilbao.",
      "United are 3-0 up following the first leg of their semi-final in Bilbao six days ago. A double from Bruno Fernandes and a Casemiro header have United in control of the tie heading into the second leg at Old Trafford tomorrow night.",
      "United know that if they avoid defeat they will be through to the final of the Europa League, and even defeat by a one or two goal margin will be enough to see them through.",
      "With Champions League qualification on the line, this is one of United's biggest games in decades, and the players and Amorim have been keen to stress that the job is not done.",
      "The United head coach will provide the early team news this afternoon along with any injury updates. Athletic have already named their travelling squad for the game and have been rocked by the news they will be without three of their most dangerous players.",
      "Stick with us throughout the day as we bring you build-up, updates and reaction from Amorim's press conference.",
      "Having beaten Athletic Bilbao 3-0 in last week's semi-final first leg, United will be determined to finish the job at Old Trafford tomorrow night without any sort of fuss.",
      "Still unbeaten in the Europa League this season, here is a reminder of their run that has taken them to the brink of the final...",
      "United head coach Ruben Amorim will sit down with the media this lunchtime to preview tomorrow night's Europa League semi-final second leg against Athletic Bilbao at Old Trafford.",
      "Here is a flavour of some of the topics that could be on the agenda;",
      "Welcome to our live blog of Ruben Amorim's pre-match press conference.",
      "United are 3-0 up following the first leg of their semi-final against Athletic Bilbao six days ago. A double from Bruno Fernandes and a Casemiro header have United in control of the tie heading into the second leg at Old Trafford tomorrow night.",
      "United know that if they avoid defeat they will be through to the final of the Europa League, and even defeat by a one or two goal margin will be enough to see them through.",
      "Stick with us for build-up and live updates from today's press conference."
    ]
  },
  {
    "headline": "Athletic Bilbao handed suspension problem for Man United Europa League second leg",
    "tags": [
      "Europa League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/athletic-bilbao-handed-suspension-problem-31586239",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Both Manchester United and Athletic Club will have some decisions to make going into their Europa League tie this week.",
      "United will host the Spanish outfit in the second leg of their Europa League semi-final at Old Trafford on Thursday night and will do so with a 3-0 advantage from the reverse fixture in Bilbao.",
      "Ruben Amorim's side are now just 90 minutes away from booking their place in the Europa League final, where Tottenham Hotspur or Bodo/Glimt would await as their opponents.",
      "It's not just Amorim who will have some important team selection decisions to make for the fixture, but also his counterpart, Ernesto Valverde. The Athletic Club manager will have a dilemma to overcome when selecting the team to face United at Old Trafford this week.",
      "Bilbao will be without defender Dani Vivian for the fixture after the centre-back was shown a red card in the first leg at the San Mames Stadium. Vivian will serve a suspension, which will cover the semi-final second leg and leave him unavailable to face United.",
      "Valverde could turn to Aitor Paredes as the replacement for Vivian in defence. Paredes was introduced by Bilbao from the bench just a few minutes after Vivian was shown a red card against United last week.",
      "Nico Williams is a doubt for Bilbao after the forward missed the draw with Real Sociedad in La Liga at the weekend and was not in training on Monday. The Spain international was substituted in the 79th minute in the first leg against United but has been dealing with an ongoing groin injury for the last few weeks.",
      "Bilbao could also be without midfielder Oihan Sancet, who has been sidelined for the last couple of weeks and missed the reverse fixture in Spain. It remains to be seen if Sancet will be available to face United in the second leg, having missed training on Monday."
    ]
  },
  {
    "headline": "RAILSTON: Manchester United decide to release three players at the end of the season",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-decide-release-three-31578332",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Jack Kingdon, Sam Murray and James Nolan are set to leave Manchester United this summer.",
      "Several first-team and academy players will depart this summer, and the futures of those three players have already been decided. Kingdon, 19, was a crucial part of the Under-18 treble-winning side last season, and he has been excellent on loan with Rochdale since signing for the club in the winter window.",
      "It's understood Kingdon was close to signing for Ineos-owned FC Lausanne Sport on loan in January before signing for Rochdale, who he has helped to make the National League play-offs.",
      "Kingdon was invited to train with Lausanne's first-team in Switzerland last year and impressed their staff.",
      "The centre-back has taken part in first-team training sessions at Carrington and has represented Scotland throughout the age groups. Kingdon was born in Bolton and joined United from Morecambe for a six-figure sum in November 2020.",
      "Murray, 20, joined United as a teenager from Huddersfield and he started six of a possible six games in the successful 2022 FA Youth Cup campaign, which ended at Old Trafford.",
      "The left-back has been a consistent performer in the academy and recently captained the Under-21s against Wolves. Murray also scored against West Ham in the PL2 play-offs on Monday.",
      "Nolan, 19, is a versatile player and signed for Inverness Caledonian Thistle in Scottish League One on loan in the summer transfer window, which has seen him make 33 appearances.",
      "The Chorley-born lad has predominantly played at full-back for Caledonian Thistle."
    ]
  },
  {
    "headline": "Wayne Rooney shows true Manchester United colours with brilliant Inter vs Barcelona moment",
    "tags": [
      "Man Utd",
      "Rooney"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/wayne-rooney-shows-true-manchester-31586489",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Matteo Darmian reaching the Champions League final with Inter especially delighted former Manchester United teammate Wayne Rooney after the pair embraced at San Siro afterwards.",
      "Darmian and Rooney spent two seasons at United together before the latter left to rejoin Everton in 2017. During that time, they won the Europa League, FA Cup and League Cup, while playing alongside each other in 45 games.",
      "Henrikh Mkhitaryan also spent the latter campaign, Jose Mourinho's first, at United with Rooney. He hugged both players in Milan following the semi-final second leg while working pitch-side as a pundit for Amazon Prime Video.",
      "\"There's been a bit of a love-in going on here,\" host Gabby Logan acknowledged, before asking Rooney: \"Catching up with old mates there?\"",
      "He replied: \"Yeah, obviously, they're all delighted, as you could see.\" Asked what they said, Rooney revealed: \"We were talking about the kids!\"",
      "\"We said congratulations, and then asked each other about the children. I'm delighted for them, especially Matteo, because he had difficult moments at times at Manchester United.\"",
      "The defender played just seven times during his final season at Old Trafford - after falling out of favour under Mourinho and remaining peripheral for Ole Gunnar Solskjaer. Injuries also impacted his time with United, but a return to Italy with his former club Parma saw the player return to playing more regularly.",
      "After a single season back in Emilia-Romagna, a move to Inter materialised, and he's now played over 200 games for them. Over his five years in Milan, the club have won the Coppa Italia and Serie A twice, plus could still claim a third title later this month - not to mention the biggest prize in European football.",
      "They trail Romelu Lukaku and Scott McTominay's Napoli by three points with as many matches to play. Therefore, the double is still on for them as they will now play in a second Champions League final in three years after losing their first to Manchester City in 2023."
    ]
  },
  {
    "headline": "Manchester United announce major Old Trafford change for Athletic Bilbao fixture",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-announce-major-old-31582444",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United are preparing a new tifo banner to be unveiled at Old Trafford before the Athletic Bilbao game.",
      "United displayed a tifo banner at Old Trafford for the first time in the stadium's history before Lyon in the previous round of the Europa League, and a new design will be unveiled for Bilbao.",
      "Ruben Amorim's side are 3-0 up in the semi-final tie after a comfortable win in the Basque Country last week, but Amorim will be cautious and knows the job must be finished on Thursday.",
      "United have sanctioned a new tifo banner to help generate the best atmosphere and it will be positioned on the halfway line in front of the Sir Alex Ferguson Stand again, just like it was against Lyon.",
      "The club have said the tifo will be \"hoisted from the ground to the roof with colourful pyrotechnics blasting into the sky on either side, creating an awe-inspiring scene as the players walk.\"",
      "The new tifo banner design was approved by fan groups and United captain Bruno Fernandes, and the design will remain secret until it is unveiled just minutes before kick-off on Thursday.",
      "In an interview with club media, Casemiro praised United supporters and said: “They always support us. Whether we are playing well or badly. To be honest, this season, we aren’t where we wanted to be. We aren’t where we want to be in the league. But when I get home, I speak with my family or my inner circle about what the fans are like here.",
      "“Here, even when you aren’t playing well, and you aren’t where you want to be and there are lots of changes or problems... what the fans do here at this club, they always support you; they push us and help us. All I can say, from my heart, is thank you very much.",
      "“If they didn’t support us like they do, it would be even more difficult, so the thing we have to say to everyone who comes to games here and to the whole city is, it’s something incredible. All I can say is thank you, thank you very much.”"
    ]
  },
  {
    "headline": "MARSHALL: Manchester United consider contract offer to player amid transfer uncertainty",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-consider-contract-offer-31581214",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United could offer third-choice goalkeeper Tom Heaton a one-year contract extension that will keep him at Old Trafford into his 40s.",
      "The veteran shot-stopper had been weighing up his future with his current deal due to expire at the end of this season, but his playing career could now be prolonged with the expectation that United will offer him a 12-month deal.",
      "There had been an expectation that Heaton would leave the club this summer and he was weighing up whether to hang up his gloves or look to extend his playing career elsewhere, but he is open to another season at his boyhood club.",
      "The former England goalkeeper, who turned 39 in April, could even move into a coaching role at the club when he does decide to end his playing career.",
      "Heaton came through the youth ranks at United more than 20 years ago and after leaving to build a successful Premier League career with Burnley and Aston Villa, he returned on a free transfer in the summer of 2021.",
      "He has remained third-choice since then, making just three first-team appearances, as well as playing for the Under-21s in the EFL Trophy earlier this season.",
      "He is a popular member of the dressing room, however, and has been part of the leadership group, with his experience valued by Erik ten Hag and now Ruben Amorim. Heaton has also struck up a friendship with club captain Bruno Fernandes.",
      "The decision to look at extending his deal hints at the uncertainty in the goalkeeping department at Old Trafford this summer, with the futures of Andre Onana and Altay Bayindir a little uncertain.",
      "Onana is two years into his Old Trafford career after his £47million move from Inter, but he is yet to totally convince and has had a difficult campaign this year. There is interest in the 29-year-old from Saudi Pro League clubs although there has been no indication at this stage that United are ready to sell and look for a new No. 1.",
      "Bayindir has made eight appearances this season, having featured just once in his first season at the club following a £4.2million move from Fenerbahce.",
      "He has struggled to challenge Onana, however, and has conceded four goals in three of his eight starts this season. The 27-year-old is expected to look for a move to secure first-team football this season.",
      "That could leave United on the look-out for a second-choice goalkeeper this season and potentially someone to lay down a greater challenge to Onana, so keeping Heaton around for an extra year will at least provide some continuity, with clubs keen to keep three experienced goalkeepers on their books."
    ]
  },
  {
    "headline": "MARSHALL: Premier League grant Tottenham request as Manchester United vs Chelsea kick-off time changes",
    "tags": [
      "Man Utd",
      "Premier League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/premier-league-grant-tottenham-request-31579311",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Tottenham’s final Premier League fixture before a potential Europa League final against Manchester United has been brought forward two days after a request from Spurs officials.",
      "Their clash with Aston Villa will now take place at 7:30pm on the night of Friday, May 16, having initially been scheduled for the afternoon of Sunday, May 18.",
      "With Manchester United and Tottenham on course to meet in the Europa League final on Wednesday, May 21, after resounding victories in the first leg of their semi-final ties, their was anger in North London at the lack of preparation time being afforded Ange Postecoglou’s side, as well as the fact that United were set to get two days extra to get ready for the final in Bilbao.",
      "Spurs confirmed on Sunday, April 27 that they had requested for the fixture to be moved, saying in a statement: \"We should like to inform supporters that we are in discussions with the Premier League regarding a change in date to our away Premier League match against Aston Villa, currently scheduled for Sunday, 18 May.\"",
      "It was reported that Villa had objected to the proposal to move the game, with Unai Emery's side still in a battle for a spot in next season's Champions League and keen to keep disruption to their schedule to a minimum.",
      "But while Villa were reluctant for the game to be moved, the Premier League have now granted the request and both United and Tottenham will get the same time to prepare for the final, should they get there. Ruben Amorim's side face Chelsea on Friday, May 16.",
      "United won 3-0 against Athletic Club in Bilbao last week and will look to finish the job at Old Trafford on Thursday.",
      "Tottenham beat Bodo/Glimt 3-1 in the first leg and face a tougher test in holding on to their advantage in the return in the Arctic Circle this week."
    ]
  },
  {
    "headline": "Sign up for free Manchester United transfer updates ahead of Europa League semi-final",
    "tags": [
      "Man Utd",
      "Europa League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/sign-up-free-manchester-united-31582183",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United are preparing for their biggest game of the season on Thursday evening when they take on Athletic Bilbao in the second leg of their Europa League semi-final.",
      "United ran out impressive 3-0 winners in Spain in the first leg and they now welcome their opponents to Old Trafford looking to close out the job.",
      "Victory in this month's final in Bilbao would not only see Amorim end a difficult first season in charge by winning some silverware, it would also see United qualify for next season's Champions League.",
      "That would certainly boost their transfer kitty ahead of the summer transfer window, with United set for a busy summer trying to further mould the side in their manager's image.",
      "United are known to be keen on signing Ipswich forward Liam Delap, as well as Wolves star Matheus Cunha, and they won't be the only players linked with a move to Old Trafford in the summer.",
      "Goalkeeper Vanja Milinkovic-Savic has also been linked with a move to Old Trafford, while reports of clubs monitoring the likes of Bruno Fernandes, Kobbie Mainoo and Alejandro Garnacho won't go away.",
      "We will bring you all of the latest transfer news and Old Trafford stadium updates and we will also be covering every step of the Europa League and Premier League run-in.",
      "To keep up with the latest United news and matchday updates, you can get all the news sent direct to your phone by signing up to our FREE WhatsApp service here.",
      "Our expert United team will be on top of all of the news, analysis, live coverage and reaction - and you can be right on top of it too by signing up for our free WhatsApp service.",
      "Join thousands of Reds around the world who receive our daily updates on WhatsApp by joining our free community through the link below."
    ]
  },
  {
    "headline": "How to watch Manchester United vs Athletic Bilbao on TNT Sports in Europa League semi-final",
    "tags": [
      "Man Utd",
      "Europa League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/how-watch-manchester-united-vs-31582560",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United will welcome Athletic Bilbao to Old Trafford for the second leg of their Europa League semi-final on Thursday evening.",
      "United are in an excellent position to reach the final after a brace from Bruno Fernandes and a Casemiro goal secured a 3-0 win in the first leg in Northern Spain last week.",
      "It means anything less than a three-goal defeat will see United reach the final against either Tottenham Hotspur or Bodo/Glimt later this month in Bilbao.",
      "After a difficult season, winning the Europa League not only represents a major chance for Ruben Amorim to win his first trophy as United manager, it will also see them qualify for next season's Champions League.",
      "You can watch all of those games by signing up to Amazon Prime and their Discovery+ bundle.",
      "You can sign up for a 30-day free trial with Amazon Prime and you will be able to watch more with Prime + discovery+ together.",
      "Amazon Prime is required to get discovery+. Together, you'll be able to enjoy the benefits of Prime Video, plus discovery+, where you will be able to watch Premier League matches, as well as the remaining Champions League, Europa League and Europa Conference League matches.",
      "Once the 30-day free trial comes to an end, Prime will cost £8.99 per year and Discovery+ will cost £30.99 per month."
    ]
  },
  {
    "headline": "Nico Williams fires warning to Man United after Athletic Bilbao thrashing - 'We've already seen'",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/nico-williams-fires-warning-man-31582593",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Athletic Club de Bilbao star Nico Williams has fired a clear warning to Manchester United ahead of their Europa League semi-final second leg match. The La Liga club face the prospect of over-turning a three-goal deficit from the first leg if they are progress to the final - incidentally in Bilbao.",
      "United were afforded to rest several first-teamers in the Premier League on Sunday afternoon as they suffered a 4-3 defeat away at Brentford. Captain Bruno Fernandes and goalkeeper Andre Onana were among those to sit out in the capital, while Bilbao created a four-point buffer inside La Liga's Champions League places.",
      "Ernesto Valverde made changes for their goalless draw against Basque rivals Real Sociedad with Oscar de Marcos, Alex Berenguer and Maroan Sannadi among the swaps for that encounter.",
      "Spain's Euro 2024 hero Nico Williams was absent from the stalemate, but has fired a warning to United, citing their dramatic win over Lyon as potential inspiration for the impending second leg.",
      "\"We weren't very sharp, there's no need to make excuses,\" he said on last Thursday night's defeat.",
      "\"We're 3-0 down, but we're capable of overcoming that.",
      "\"We've already seen that Lyon gave them problems at home and we're going to try and do the same.",
      "\"The work of the entire season speaks for itself.",
      "\"We're in the final stretch of our dream.",
      "\"Our fans have always supported us and we're going to give it our all.\"",
      "Daniel Vivian will miss the trip to Manchester through suspension after being shown a straight red card.",
      "Top goal-scorer Oihan Sancet, meanwhile, faces a race against time to be fit for the reverse leg, after missing the visit of United last Thursday night, while Williams didn't train with Bilbao on Monday.",
      "Valverde said: \"Oihan is doing quite well.",
      "\"We'll see if they can make it to Thursday. I'd like them both to be there.\""
    ]
  },
  {
    "headline": "RAILSTON: Manchester United make decision on two players for Athletic Bilbao fixture at Old Trafford",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-make-decision-two-31578869",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United youngsters Jaydan Kamason and Bendito Matato are part of the first-team preparations for Athletic Bilbao.",
      "Kamason and Mantato supported their Under-21 peers from the stands at Leigh Sports Village on Monday. They were not involved with that game because they are needed for the first-team's preparations.",
      "The young duo were included in the squad to face Bilbao in the Estadio de San Mames. They did not travel to face Brentford in London last weekend, but they could return to the bench for the Europa League semi-final second leg after helping the first-team prepare for Bilbao in training at Carrington.",
      "United decided Kamason and Mantato would not play for the U21s on Monday afternoon because Ruben Amorim requires them ahead of the most important game of the season.",
      "There will be an open training session held at Carrington at 11am on Wednesday morning.",
      "Kamason has enjoyed a brilliant season for the Under-18s. The right-back was brilliant in the FA Youth Cup campaign and his performances have been rewarded with a first-team promotion.",
      "Mantato formerly played at left-back in academy fixtures, but he gradually progressed to predominantly play on the right wing and his style has already led to comparisons with Bukayo Saka, who also started his career as a defender before developing into an attacking player.",
      "The 17-year-old's quality in attacking and defensive scenarios means he has the ideal profile to play at wing-back in Amorim's system, and he is now pushing toward making a senior debut."
    ]
  },
  {
    "headline": "League One player tells Ruben Amorim he'd be a starter for him if things were different",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-amorim-demetri-mitchell-31582573",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Apparently unimpressed by what he has seen of Manchester United, Demetri Mitchell believes he'd be a first-teamer if he were born a decade later. That's according to the man himself after he gave his unprompted take on social media.",
      "Mitchell, 28, is currently turning out for League One outfit Exeter City after leaving United in 2020. The left-sided specialist has found a new home at St James Park, where he helped his team finish 16th in England's third tier this term.",
      "Ruben Amorim's United are currently just one place better off in the Premier League and sit 15th. The Red Devils have three games left to improve that record and cannot make it back into the top half, ensuring their worst finish in the Premier League era.",
      "The club is gearing up for a highly anticipated Europa League semi-final second leg at home to Athletic Bilbao on Thursday. And a venture to the final looks likely after they won last week's opening leg 3-0 in the Basque Country.",
      "But despite that silver lining, Mitchell believes he's good enough that he would have had regular minutes in the senior side had he moved up to the big leagues today. And while he may have played a prominent role for the Grecians this season, his self-deprecating jibe is hardly a ringing endorsement for the current United crop.",
      "\"I reckon if I broke through during this era of Man United I’d be a first team regular,\" he wrote on X. And there was no hint of sarcasm to his words, it seems, after he doubled down in the replies.",
      "When asked what position he'd hope to play, the Manchester-born star replied: \"Wing back. Not saying I’d play every game, but I’d be a first team regular probs squad player.\"",
      "He went on to elaborate he'd have no chance at that level in his current body. But he had full confidence that the 20-year-old version of him could have made the cut.",
      "\"No not now [it] would take me too long to adapt,\" he wrote in another reply. \"When your (sic) 20 and in a Premier League environment the amount you learn in such a short period is vast as well as the facilities etc. There’s lads that could [have] made it that never got the chance and their (sic) not even playing now more talented than myself.\"",
      "Others commented to tell Mitchell current left-back options like Patrick Dorgu or Harry Amass would block his route to the first team. However, the player has seen the current standard at Old Trafford and clearly fancies his chances.",
      "Mitchell made his senior United debut in a 2-0 Premier League win over Crystal Palace on the final day of the 2016/17 season. He later went out on loan to Hearts on two separate occasions before a permanent move to Blackpool in the summer of 2020.",
      "He later transferred to Hibernian in January 2022 before finding his way to the south of England 12 months later. The former England under-20 international's Exeter contract is due to expire this summer, though he has been invited back to train in pre-season in the hopes of earning a fresh deal."
    ]
  },
  {
    "headline": "Europa League Final travel prices skyrocket as Manchester United plot San Mames return",
    "tags": [
      "Man Utd",
      "Europa League"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/europa-league-final-travel-prices-31579363",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United fans may have one eye on booking hotels and travel arrangements for the Europa League final on May 21 given their impressive result in the first leg.",
      "However, even the most optimistic United fan knows if this season is anything to go by, the tie against Athletic Bilbao is far from over despite their 3-0 lead from the first leg.",
      "Ruben Amorim's side turned in an impressive display against La Liga opposition, who many viewed as the favourites to win the competition in their home stadium before a ball had even been kicked.",
      "A header from Casemiro and brace from Bruno Fernandes put United into a commanding position at the Estadio de San Mames, with Athletic Bilbao down to ten men after Dani Vivian was sent off just after the half hour mark.",
      "Amorim's side were three goals to the good at half-time and controlled the second half to take a commanding lead back to Old Trafford. United host the Basque outfit on home soil later this week, with the quarter-final drama against Lyon serving as a warning heading into the second leg.",
      "For some supporters, they've already started looking at booking travel for a return to Bilbao for the final, with the San Mames set to host the tournament finale later this month.",
      "However, prices have skyrocketed since United's win in the first leg, with a direct Easyjet flight costing £1,178 at the time of writing, which would usually cost less than £100.",
      "Alternatively, indirect flights via Germany were around the £1,000 mark with ferry travel also closing in on a four-figure fee.",
      "Crossings from Portsmouth to Bilbao were £994 for a 32 to 36 hour crossing, which would also require supporters to get down to the south coast before boarding."
    ]
  },
  {
    "headline": "Richard Keys slams Manchester United best-case scenario - 'it's a joke'",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/richard-keys-slams-manchester-united-31578603",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Television presenter Richard Keys has weighed in on the possibility that Manchester United may qualify for the Champions League by winning the Europa League.",
      "United hold a 3-0 lead over Athletic Club going into the second leg of their semi-final on Thursday night. Should United get past Bilbao at Old Trafford in midweek, they would then set up a final against either Tottenham Hotspur or Bodo/Glimt later this month.",
      "If United were to then beat either Spurs or Bodo/Glimt in the final, they would not only be confirmed as Europa League winners but also clinch qualification for next season's Champions League.",
      "The winners of the Europa League automatically qualify for the following season's Champions League, regardless of where they finish in their respective country's league table.",
      "In United's case, Ruben Amorim's side are currently 15th in the Premier League while Spurs are one point further back in 16th place.",
      "Keys says he does not agree with clubs being able to qualify for the Champions League by winning the Europa League after the recent changes by UEFA for this season.",
      "\"Good luck to our teams in Europe this week,\" wrote Keys in his latest blog post on Monday. \"I hope they all get what they want - but I’ve got to say this - it’s a joke that two PL teams who’ve been rank this season are going to be playing for a CL place in the Europa League final.",
      "\"The prize is too big, especially because the competition has been so much easier to have success in this season. How’s that? Because there were no CL clubs dropping in from the group stages of that competition.",
      "\"You can argue that’s been a good thing, but you can’t offer a CL place to the winners of the Europa League when that’s the case. A chance to defend that title? Yes. But no more.\"",
      "....."
    ]
  },
  {
    "headline": "Man Utd latest: Athletic Club missing three key players for second leg",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.skysports.com/football/live-blog/11667/13025492/man-utd-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
    "image": "https://e0.365dm.com/25/03/768x432/skysports-ruben-amorim-man-utd_6844390.jpg?20250302164812",
    "date": null,
    "source": "skysports",
    "body": [
      "Wednesday 7 May 2025 09:10, UK"
    ]
  },
  {
    "headline": "Tottenham's PL game at Aston Villa moved ahead of potential EL final",
    "tags": [],
    "link": "https://www.skysports.com/football/news/11095/13362538/aston-villa-vs-tottenham-premier-league-game-rescheduled-ahead-of-potential-europa-league-final-for-spurs",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-premier-league-aston-villa_6907780.jpg?20250506094138",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 6 May 2025 19:35, UK",
      "The Premier League has approved Tottenham's request to reschedule the fixture at Villa Park to allow them to have the same preparation time as Manchester United for the Europa League final in Bilbao, should both teams make it.",
      "The newly-moved fixture between Aston Villa and Tottenham will kick off at 7.30pm, while the game between Chelsea and Manchester United has a new 8.15pm kick-off time, which is 15 minutes later than originally scheduled.",
      "The fixture change announcement has been made on the first working day of this week (May 6) to give supporters as much notice as possible.",
      "The Premier League will always try to help its clubs in the latter stages of European competition where possible.",
      "Tottenham and Aston Villa have been contacted for comment.",
      "Tottenham announced on April 27 that they had been in discussions with the Premier League over a change of date.",
      "It was understood that Villa felt it was an important period in their season and that it would represent double standards.",
      "Ange Postecoglou's side, however, have now had their request granted, ensuring Man Utd would not have an extra two days' rest in the event of an all-English Europa League final.",
      "Manchester United and Spurs are on course to meet in Bilbao on May 21, with both sides holding aggregate advantages heading into their semi-final second legs.",
      "Tottenham take a two-goal lead to Norway on Thursday after a first-leg 3-1 home win over Bodo/Glimt, while Man Utd have a three-goal lead over Athletic Club ahead of their second leg at Old Trafford on Thursday.",
      "Despite Man Utd and Spurs' lowly Premier League positions of 15th and 16th, respectively, the winner of the Europa League will qualify for next season's Champions League.",
      "Meanwhile, Chelsea and Aston Villa are battling to reach European football's top-tier competition through the Premier League.",
      "Enzo Maresca's side occupy the fifth and final Champions League qualification spot, while seventh-placed Aston Villa are just three points behind the Blues with three games remaining."
    ]
  },
  {
    "headline": "Transfer Centre LIVE! Trent, Sane and Tah latest on the Transfer Talk podcast",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.skysports.com/football/live-blog/31771/12476234/transfer-centre-live-football-transfers-news-updates-and-rumours",
    "image": "https://e0.365dm.com/25/04/768x432/skysports-transfer-talk-podcast_6887911.jpg?20250416085050",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 6 May 2025 23:56, UK"
    ]
  },
  {
    "headline": "Papers: Man Utd ready to join race for Brentford forward Mbeumo",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.skysports.com/football/transfer-paper-talk/12709/13362016/football-gossip-paper-talk-and-transfer-rumours-man-utd-ready-to-join-race-for-brentford-forward-bryan-mbeumo",
    "image": "https://e0.365dm.com/25/03/768x432/skysports-paper-talk-brand-refresh_6852897.jpg?20250311094415",
    "date": null,
    "source": "skysports",
    "body": [
      "The latest transfer gossip and speculation from today's papers as Manchester United eye a move for Brentford forward Bryan Mbeumo; West Brom want Tottenham coach Ryan Mason to become their new boss; Atletico Madrid have already enquired about signing Antony from Man Utd",
      "Monday 5 May 2025 07:51, UK",
      "The top stories and transfer rumours from Monday's newspapers...",
      "DAILY TELEGRAPH",
      "Manchester United are ready to join the race for Bryan Mbeumo when competition for the £60m-rated Brentford forward intensifies during the summer transfer window.",
      "Henry Pollock admits he has dared to dream of being named in the British and Irish Lions squad when it is announced on Thursday.",
      "DAILY EXPRESS",
      "Juventus are in talks with Manchester United over the potential signing of Rasmus Hojlund this summer and will make a concrete approach soon, according to reports.",
      "THE SUN",
      "Scotland ace Scott McTominay is set to lose £2.32m he invested in a failed firm run by his girlfriend and her dad.",
      "William Saliba has been in talks with Real Madrid for weeks, claim reports in France.",
      "Leeds are making Marseille centre-half Leonardo Balerdi one of their top targets for the Premier League.",
      "Tottenham coach Ryan Mason is wanted by West Brom to become their new boss.",
      "Thomas Frank wants to splash out on Leicester's £25m-rated keeper Mads Hermansen.",
      "Manchester United ace Casemiro will pocket a huge pay rise if Ruben Amorim's side win the Europa League, reports suggest.",
      "DAILY MIRROR",
      "Atletico Madrid have already enquired about the possibility of signing Antony from Manchester United this summer as the Red Devils prepare to offload the 25-year-old.",
      "THE GUARDIAN",
      "A 26-year-old fan of Serie A side Atalanta was stabbed to death during clashes between Atalanta and Inter supporters in the northern city of Bergamo, Italy's police said.",
      "EVENING STANDARD",
      "Martin Odegaard has cooled fears that he could miss the second leg of Arsenal's Champions League semi-final due to injury.",
      "Dean Huijsen has played down speculation surrounding a potential summer transfer, saying he is 'really happy' playing for Bournemouth.",
      "DAILY MAIL",
      "Anthony Joshua has revealed he is set to undergo surgery in a bid to solve an ongoing issue that has delayed his return to the ring.",
      "SCOTTISH SUN",
      "Barry Ferguson has urged the Rangers takeover consortium to appoint a new manager now.",
      "Simo Valakari is committed to staying with St Johnstone - despite being on HJK Helsinki's hitlist."
    ]
  },
  {
    "headline": "Hits and misses: Did Liverpool show where they need to strengthen?",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.skysports.com/football/news/11661/13359813/did-liverpool-show-where-they-need-to-strengthen-in-the-transfer-window-premier-league-hits-and-misses",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-liverpool-jota_6906476.jpg?20250504195231",
    "date": null,
    "source": "skysports",
    "body": [
      "Monday 5 May 2025 10:06, UK",
      "",
      "The 3-1 defeat at Chelsea will do little to trouble Liverpool as they celebrated their deserved title. But if anyone was questioning what Arne Slot's side may have looked like with a few injuries, then that performance was it.",
      "There were probably some party-related reasons for Liverpool's flat performance and a lower intensity than normal, but Arne Slot wanted to use these final four games to help him plan for the summer. Those he brought into the team at Stamford Bridge failed to impress.",
      "The entire midfield was changed and the trio of Wataru Endo, Curtis Jones and Harvey Elliott could not cope with their Chelsea counterparts, notably Romeo Lavia and Cole Palmer who ran the show.",
      "Jones slipped in the build-up to Chelsea's first, Elliott was hauled off after the Blues' second - and Endo showed he, at 32, will struggle to replicate what Ryan Gravenberch did brilliantly all season.",
      "At the top end of the pitch, Diogo Jota was anonymous with just 13 touches - he has one league goal in 2025 - while Darwin Nunez missed two good openings after coming on. At least he managed one more touch than Jota.",
      "None had a worse outing though than Jarell Quansah, with one own goal and one penalty conceded in a disappointing and unconvincing display at centre-half, one that was reminiscent of his opening-day struggles at Ipswich.",
      "Liverpool will not stand still this summer and rest on their laurels. The club want to be busy in the transfer market and strengthen their squad to compete again next season and develop the next title-winning team.",
      "And with Kostas Tsimikas failing to ease Liverpool's left-back woes, that looks like four areas Liverpool could strengthen this summer. Left-back, centre-back, midfield and striker - and don't forget a right-back if Trent Alexander-Arnold departs, as expected.Sam Blitz",
      "Bilbao or bust has been the mantra at Manchester United for some time. Watching them fall to a 16th league defeat of the season as they lost 4-3 at Brentford, their most for 35 years, made that abundantly clear. But there is something more behind their struggles.",
      "Ruben Amorim named the third-youngest team in Premier League history at Brentford. Considering United's recent domestic form, and the eight changes made after Thursday's win over Athletic Club, defeat was almost inevitable, strange as that sounds.",
      "Everything, understandably, is focused on the Europa League. That doesn't answer the question of why United, the only undefeated side in European competition, haven't beaten a team that will be playing top-flight football next season since January 26.",
      "Since that 1-0 win at Fulham, sealed thanks to Lisandro Martinez's deflected strike, United have played 10 teams outside the bottom three and failed to win against any of them. They still had a round left of the Europa League league phase after that win.",
      "Meanwhile, in Europe United have overcome Real Sociedad and Lyon. Barring a shock collapse, not something you would put past this group, you can add Athletic Club to that list. Then they are one game from a European trophy. Puzzling.",
      "The defeat at Brentford, although not the fairest game to draw conclusions from, served up a perfect example of the problems plaguing Amorim in the Premier League: United were simply unable to cope with Brentford's physicality, pace and direct football.",
      "Regardless of who was picked, as this season has shown us, those same vulnerabilities would remain.",
      "Amorim has inherited a squad ill-equipped to cope with the rigours of English football. Those squad-building missteps must be corrected this summer, particularly if Champions League qualification is secured, otherwise Amorim will see no improvement.Zinny Boswell",
      "Alexander Isak must have felt like his moment would never come in Newcastle's 1-1 draw at Brighton. Twice he had picked up the ball thinking he was about to have a free shot at goal from 12 yards after referee Craig Pawson had pointed to the spot. VAR ruined Newcastle's fun by spotting two incorrect calls from Pawson so it was looking like one of those days for Isak and his team.",
      "But one more chance would come on 89 minutes when Pawson finally correctly spotted a legitimate penalty and Isak was in no mood to pass it up.",
      "In scoring he became the first Newcastle United player to score 23 goals in a Premier League season since Alan Shearer in 2002 and now has 22 goals in his last 26 league appearances. There is still time to catch Mohamed Salah in the Golden Boot race, too. He is five back with three games to play and Salah has only scored once in his last six Premier League games. Stranger things have happened.Lewis Jones",
      "There have been calls from some sections of the Brighton fans for goalkeeper Bart Verbruggen to be replaced.",
      "Before the 1-1 draw with Newcastle, the Seagulls had conceded at least twice in each of their last six Premier League games and shipped 24 goals in their previous 11 league encounters. Verbruggen was not solely to blame but his lack of confidence and authority has not been helping his defenders. Brighton also have the worst save ratio in the Premier League this season (59.6 per cent).",
      "However, Verbruggen put in his best performance of 2025 to repel Newcastle. Solid from set-pieces and looking much more composed under pressure, Verbruggen made four saves - the pick of which came in stoppage time to deny Callum Wilson a winning goal. If he can stay in this kind of form, Brighton's defensive process and numbers should be back on the improve.Lewis Jones",
      "Ange Postecoglou's wholesale changes in Tottenham's 1-1 draw at West Ham allowed those brought in to put forward their case to start in Thursday's Europa League semi-final second leg at Bodo/Glimt - and Mathys Tel took it.",
      "The French forward was Spurs' most dangerous player at the London Stadium as he assisted Wilson Odobert's opener after pressing West Ham defender Max Kilman into a mistake.",
      "Tel attempted eight dribbles - the most of any player in the game - and had two shots, with only Jarrod Bowen having more.",
      "It was another promising display from the on-loan Bayern Munich man, who is finding his feet out on the left wing for Spurs, with Postecoglou praising the 20-year-old in his post-match press conference.",
      "He said: \"He's taken in the information and he understands the role now a little bit better, especially out on the left.",
      "\"These last few weeks, we've obviously had Sonny [Heung-Min Son] out. We've needed him to fill that void and I think he's done that job well.\"",
      "If Tel were to start in Norway on Thursday, then it would be well deserved. And with more performances like this, Spurs will be keen to activate the £45m option to sign him permanently from Bayern.Declan Olley",
      "It took Michael Kayode just under three months to make his first start for Brentford after joining on loan from Fiorentina in January. Before then, there were fleeting glimpses of what he had to offer; eye-catching cameos that provided a taste of what was to come.",
      "But he has started at right-back in the Bees' last three games and been a key part of the team that has won three in a row for the first time since a run between October 21 and November 4 2023.",
      "The 20-year-old looked eager to get forward from the very start during Man Utd's visit to the Gtech and his boundless energy caused Amorim's side problems - as did his monstrous throw-ins, as shown in the lead-up to Luke Shaw's own goal.",
      "Kayode completed the most dribbles (5) in the match, won the most duels (10) and finished with a 97 per cent pass accuracy, the most of any player to play 45 minutes or more. \"He looked like he just enjoyed playing football,\" said Thomas Frank afterwards.",
      "There is surely no doubt Brentford will take up the option to make Kayode's stay in west London permanent at the end of the season.Dan Long",
      "If ever there was to be a day when things finally clicked into place for West Ham under Graham Potter, the visit of rivals Tottenham to the London Stadium was surely it.",
      "The Hammers had a week to prepare for the London derby, a luxury compared to Spurs' 64-hour turnaround from Thursday's Europa League semi-final against Bodo-Glimt.",
      "Spurs had more than an eye on Thursday's return leg in Norway, Postecoglou's eight pre-match alterations made that clear, so opportunity knocked for Potter's beleaguered Hammers to end a seven-game wait for a victory.",
      "Before a ball had been kicked, frustration summed up the mood among a fanbase who had not seen a victory since late February, but that turned to apathy come full-time.",
      "Hoards headed for an early exit despite the scoreboard reading 1-1 with the prospect of a late derby victory still on the table.",
      "The fact that was not enough to keep sections of the disgruntled fanbase in their seats shows just how deep West Ham's rut is with three games left to salvage something from this season.Jack Wilkinson"
    ]
  },
  {
    "headline": "Amorim: Man Utd not ready to compete in Champions League next season",
    "tags": [
      "Man Utd",
      "Champions League",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11667/13361699/manchester-united-boss-ruben-amorim-makes-damning-admission-after-16th-premier-league-defeat-of-the-season",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-ruben-amorim-man_6906285.jpg?20250504172827",
    "date": null,
    "source": "skysports",
    "body": [
      "Man Utd were beaten 4-3 at Brentford to bring up their 16th defeat of the Premier League season, their most in a league campaign for 35 years, in a result which mathematically consigns them to a bottom-half finish, but winning the Europa League would secure Champions League qualification",
      "Monday 5 May 2025 12:52, UK",
      "Ruben Amorim says Manchester United are not ready to be competitive in the Premier League and Champions League next season.",
      "United racked up their 16th defeat of the league season, their most for 35 years, with the 4-3 loss at European hopefuls Brentford, a result that mathematically consigns them to a bottom-half finish.",
      "Amorim, who made eight changes and named the third-youngest side in Premier League history, was prioritising Thursday's Europa League semi-final second leg against Athletic Club, with United 3-0 up on aggregate.",
      "Since Amorim took charge of United on November 11, only the now-relegated sides Ipswich (3), Leicester (3), and Southampton (1) have won fewer Premier League games than United (6).",
      "United will be playing Champions League football next season if they can win the Europa League, but Amorim says that is a \"real dilemma\" for the club.",
      "\"We know that, but we need to win, and we need to fight to win this competition, to give something to our fans, and to go to the Champions League.",
      "\"Then we will have time to prepare the team to cope with those two competitions. So, it is a dilemma, but we want to win, of course.\"",
      "United were trailing 4-1 with eight minutes to go at Brentford, but late goals from Alejandro Garnacho and substitute Amad Diallo restored some respectability for Amorim's struggling side.",
      "There were flashes of promise, particularly Mason Mount's opener, his first league goal for 13 months, but the performance, for the most part, stood in stark contrast to Thursday's impressive 3-0 win over Athletic Club.",
      "Amorim has failed to translate United's Europa League form into consistent performances and results in the Premier League, but insists he is seeing signs of progress.",
      "He added: \"I have no doubts that we are playing better, and we are understanding the way we play, even in this context. So, we have to take all the hits.",
      "\"We are losing games in the Premier League, we are fighting for the Europa League, so we need to accept that and to think about Thursday as the most important game for us.\"",
      "Asked about the goal for Mount, who has endured another season blighted by injuries, Amorim added: \"It's not just the finish, it's the position that he has on the pitch. He's like a third midfielder that can reach the box. He's really intelligent.",
      "\"He's getting there and he trains really hard. Sometimes I have to push him back and to take him off the pitch because he wants to do so much more. We are taking care of him.",
      "\"He wants to play more minutes, but the minutes were controlled. I'm really happy with him.\"",
      "Striker Chido Obi became the youngest player in United's history to start a Premier League game at Brentford, aged 17 years and 156 days, as fellow academy graduates Harry Amass and Tyler Fredricson also got the nod.",
      "Amorim was pleased with the young trio and the experience they gained, but sent a clear message to them that United's standards in their worst season in the Premier League era would not be accepted moving forward.",
      "\"It is really important to understand that we cannot do this anymore,\" he said, when asked about how important it was for the young players to learn from the defeat.",
      "\"We know the context, but this kind of season we need to change. They need to understand what it is to play for Manchester United.",
      "\"I think they did really well. They [have] not [been] playing so much, but then they have to play 90 minutes because we have to change some other players to save them for Thursday.\"",
      "Asked about the experience they would have gained, Amorim: \"It's really important because you can train a lot with the first team, but to have that feeling, playing with the players, feeling the players, the speed of the game, I think it is the best thing.\"",
      "Obi, on his first senior start, was tasked with leading the line against Brentford's physical centre-back pairing of Nathan Collins and Sepp van den Berg, whose last-minute block denied a goalbound strike from the teenage striker.",
      "The Denmark U21 international had a frustrating full debut until that moment, when he burst through a challenge in the box, and looked destined to at least test Brentford goalkeeper Mark Flekken but for Van den Berg's intervention.",
      "\"Chido fought for all game, but you can feel that he's really naive sometimes in the way he puts his body,\" Amorim said. \"He's going to understand what is the feeling of playing in these games. This is the best way.\""
    ]
  },
  {
    "headline": "Seven-goal CHAOS, Schade double and Garnacho screamer | Brentford hold on... just!",
    "tags": [
      "Garnacho"
    ],
    "link": "https://www.skysports.com/football/video/12606/13361632/brentford-4-3-manchester-united-premier-league-highlights",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-brentford-man-utd_6906061.jpg?20250504153536",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 4 May 2025 16:13, UK"
    ]
  },
  {
    "headline": "European hopefuls Brentford beat Man Utd in seven-goal thriller",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.skysports.com/football/brentford-vs-man-utd/report/506149",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-kevin-schade-brentford_6906103.jpg?20250504154856",
    "date": null,
    "source": "skysports",
    "body": [
      "Monday 5 May 2025 07:04, UK",
      "Brentford increased their hopes of qualifying for Europe for the first time as they beat a much-changed Manchester United 4-3 in a thriller at the Gtech.",
      "Conversely, it was Man Utd's 16th league defeat of the season, their most since the 1989/90 season, when they also lost 16.",
      "Since Ruben Amorim took charge on November 11, only the now-relegated sides Ipswich (3), Leicester (3), and Southampton (1) have won fewer Premier League games than United (6).",
      "After United won the first leg of their Europa League semi-final 3-0 against Athletic Club on Thursday, Amorim rung the changes and named the third-youngest starting XI in Premier League history.",
      "Sensing an opportunity as a result, Brentford pressed high from the off and should have been ahead when a Luke Shaw and Altay Bayindir mix-up led to the former almost heading past his own goalkeeper.",
      "Brentford:  Flekken (6), Kayode (8), Collins (6), Van den Berg (6), Lewis-Potter (6), Norgaard (7), Yarmoliuk (7), Mbeumo (7), Damsgaard (7), Schade (9), Wissa (8).\n\n\nSubs:  Jensen (6), Henry (6), Ajer (n/a), Nunes (n/a), Thiago (n/a).\n\n\nMan Utd:  Bayindir (6), Fredricson (5), De Ligt (6), Shaw (4), Dorgu (5), Ugarte (7), Mainoo (6), Amass (6), Mount (7), Garnacho (8), Obi (5).\n\n\nSubs used:  Maguire (6), Yoro (6), Diallo (7), Eriksen (7), Lindelof (6).\n\n\nPlayer of the match:  Kevin Schade.",
      "There was a brief boost when Mason Mount slid Alejandro Garnacho's cross home against the run of play, but the Bees deservedly levelled when Mikkel Damsgaard poked a shot that hit the unfortunate Shaw, then Bayindir, then the net.",
      "Within five minutes, the turnaround was complete. Man Utd switched off, wanting play to be paused when Matthijs de Ligt went down with a leg injury after a tangle with Yoane Wissa, but referee Anthony Taylor played on, so Christian Norgaard was able to pick out Kevin Schade to head home.",
      "Only a last-ditch save from Bayindir to keep out Norgaard's connection on Damsgaard's free-kick prevented it becoming three before the break.",
      "United started the second half well, but found themselves further behind when Schade headed in a peach of a cross from Bryan Mbeumo, before the impressive Michael Kayode squared for Wissa to roll home and make it 4-1, with the goal confirmed after a VAR review.",
      "Garnacho hit a stunner from the edge of the box, before Amad's strike deflected off Sepp van den Berg to make it 4-3 and set up a tense finale, but Brentford held on for their third win in succession as their positive end to the campaign continues.",
      "Brentford head coach Thomas Frank:",
      "\"Basically, from the first year in the division, we respect everyone but fear no one. We believe that we can win every game.",
      "\"We try to go for that win. Sometimes we win, sometimes we lose, but we really, really, really believe it every single time. The players are fantastic. It is a fantastic group to work with.",
      "\"We spoke about it [Europe] before the Brighton game. I rarely say that to the players as it's more about performance, but [I said] this game, we need to win. We have to win this if we want to be in with any chance of maybe having a dream about Europe. And the players did that, big credit to them.",
      "\"Then we played a difficult away game to Nottingham Forest, beat them, home to Man Utd, beat them. And all three wins, well deserved.",
      "\"We've got this momentum, hopefully we can keep it up. It's all about getting the job done and it's one at a time. We had a laser, laser, laser focus throughout four seasons on the next game. It's all about the next game.\"",
      "Man Utd head coach Ruben Amorim:",
      "\"I think it reflected our season. We started quite well, controlling the game, not creating big chances but controlling the pace of the game. We suffered a lot with the throw-ins and set-pieces but we already knew that our team would struggle against this team.",
      "\"We didn't have the height necessary for this kind of game. They scored twice in this kind of moments, even with De Ligt on the floor.",
      "\"And then in the second half I felt that we were near the draw and then we suffered a goal and like some other times we disconnected. And then another goal, almost three minutes, five minutes later. And then we pushed forward, tried to score, we scored twice but we didn't have the time to do better.\"",
      "On playing youngsters: \"They have to understand this season is really important also to understand that we cannot do this anymore. Of course, we know the context, but this kind of season we need to change that. They need to understand what it is to play for Manchester United.",
      "\"I think they did really well. They are not playing so much, but then they have to play 90 minutes because we have to change some other players to save them for Thursday.",
      "\"I think we can help the young kids even more, especially Tyler Fredricson did quite well in the third goal. He needs more help from Amad. So these small things I think we can help them more, but I'm really happy with the performance of the young kids.\"",
      "On De Ligt's injury: \"We don't know what will happen with De Ligt. If we don't have Luke Shaw available on Thursday we could have a problem and then we don't have enough defenders for the game. We had to protect some players at half-time, thinking about Thursday. So it was just that, not about thinking about the game.\""
    ]
  },
  {
    "headline": "PL Predictions: Liverpool to show Chelsea why they're champions",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.skysports.com/football/news/11095/13359825/premier-league-predictions-odds-and-best-bets-liverpool-to-show-chelsea-why-theyre-champions",
    "image": "https://e0.365dm.com/25/04/768x432/skysports-premier-league-predictions_6872709.jpg?20250401090715",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 4 May 2025 16:50, UK",
      "Our betting expert Jones Knows unleashes his insight and angles across the Premier League and thinks Liverpool are a juicy price to beat Chelsea.",
      "It's always worth keeping the player shots lines on your mind against Brentford as their style of play does tend to a high volume of shots conceded. Only Southampton have faced more shots this season than the Bees (588).",
      "This brings forward the case to back Manuel Ugarte to have two or more shots at 9/4 with Sky Bet.",
      "Which Premier League teams will qualify for Europe?",
      "Not known for his shots volume, the midfielder has come to life in that regard under Ruben Amorim, averaging 1.9 shots per 90 across his last 13 appearances. Those backing his two or more shots line have copped a return on six of those occasions.",
      "If the Tottenham that showed up in midweek against Bodo/Glimt does so again - a team full of aggression, creative spark and defensive focus - then West Ham are here for the taking.",
      "However, it's likely that we're going to see the Spurs side that have taken just 16 points away from home this season in the Premier League, losing 10 times. It wouldn't surprise me to see any of three match outcomes here. Great help, I know.",
      "A better angle is in the Tottenham player fouls market where Ben Davies stands out at 7/4 with Sky Bet to make two or more fouls.",
      "West Ham's tricky trio of Jarrod Bowen, Mohamed Kudus and Lucas Paqueta are foul drawing kings.",
      "The last 33 centre backs to have played against West Ham under Graham Potter have made 38 fouls between them with 25 of those 33 making at least one foul. Davies is showing clear signs of decline, making five fouls in his last four starts and is likely to be exposed at some point.",
      "Brighton remain a team to fade, especially against such a relentless and well coached side like Newcastle with a goal in their sights. The Seagulls have conceded at least twice in each of their last six Premier League games and shipped 24 goals in their last 11 league encounters.",
      "These poor returns certainly marry up with my opinion that Fabian Hurzeler is struggling to get the best out of this talented squad.",
      "Newcastle have scored two or more goals in six of their last seven matches and sometimes the obvious bet is the best bet.",
      "Therefore, Alexander Isak to score in a Newcastle win looks a great bet to attack at 9/4 with Sky Bet.",
      "This time of year always brings about big decisions for punters - which teams are overpriced based on a perceived lack of motivation? If Liverpool were going for the title there would be no way you'd be getting 21/10 with Sky Bet on an away win. But the 'week on the beers' theory is certainly affecting their price - wrongly in my opinion, so Liverpool have to be the bet.",
      "Also, Mohamed Salah is a man completely motivated by numbers and breaking records.",
      "He is just two goals away from breaking the record for goal involvements for the season currently held jointly held by Andy Cole and Alan Shearer (47). The Egyptian looks a fine bet to add to his tally of 28 goals and 18 assists by grabbing another goal involvement in a win for Arne Slot's machine team. Salah to score or assist and Liverpool to win can be combined through the BuildABet function to generate an 11/4 shot with Sky Bet.",
      "Nottingham Forest's season has been built around the magnificent trio of Nikola Milenkovic, Murillo and Matz Sels.",
      "But just like when forwards lose their form in front of goal that in turn affects the output of a team, the same can happen in defence and that's occurring with Forest. Mistakes are now being made at key moments in matches and Forest's defensive numbers are now that of a mid-table team.",
      "Across their last 12 Premier League matches their expected goals against process is working at 1.77 per 90 - only Leicester, Ipswich and Southampton have a worse defensive process.",
      "This is seriously worrying for Forest and their hopes of Champions League.",
      "And it makes them impossible to fancy up against such a dangerous and powerful Crystal Palace attack, where Eberechi Eze is sparkling once again. He is 4/1 with Sky Bet to score for a third game in a row. That's generous.",
      "P+L = +7.97"
    ]
  },
  {
    "headline": "Amorim hails the 'best result' | 'We felt free to play'",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/video/12606/13359654/ruben-amorim-reacts-to-manchester-uniteds-win-at-athletic-club-in-europa-league",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-amorim-football-man-utd_6903249.jpg?20250502074728",
    "date": null,
    "source": "skysports",
    "body": [
      "Friday 2 May 2025 07:47, UK"
    ]
  },
  {
    "headline": "Podcast: FPL Gameweek 36 | Sell Arsenal assets and buy Man City players",
    "tags": [],
    "link": "https://www.skysports.com/football/live-blog/11095/12812503/best-football-podcasts-from-sky-sports-latest-free-episodes-plus-how-to-download-and-subscribe-on-spotify-and-apple",
    "image": "https://e0.365dm.com/24/08/768x432/skysports-fantasy-premier-league_6651124.jpg?20240808161316",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 6 May 2025 16:26, UK"
    ]
  },
  {
    "headline": "Maguire: Europa League win wouldn't save disappointing season",
    "tags": [
      "Europa League",
      "Maguire"
    ],
    "link": "https://www.skysports.com/football/video/30998/13359652/harry-maguire-europa-league-win-for-manchester-united-wouldnt-save-season",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-maguire-football_6903247.jpg?20250502074646",
    "date": null,
    "source": "skysports",
    "body": [
      "Friday 2 May 2025 09:39, UK"
    ]
  },
  {
    "headline": "The Verdict: One of Man Utd's best European away performances",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.skysports.com/football/video/30998/13359639/athletic-club-vs-manchester-united-the-verdict",
    "image": "https://e0.365dm.com/25/05/768x432/skysports-man-utd-verdict-football_6903171.jpg?20250502062242",
    "date": null,
    "source": "skysports",
    "body": [
      "Friday 2 May 2025 11:34, UK"
    ]
  }
]