[
  {
    "headline": "MCDONNELL: Casemiro could extend Manchester United stay - on one condition",
    "tags": [
      "Man Utd",
      "Casemiro"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/casemiro-could-extend-manchester-united-32677016",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Casemiro could stay at Manchester United beyond this season - but only if he takes a significant pay cut.",
      "The Brazil international and five-time Champions League winner with Real Madrid is among United's highest earners with a salary of around £300,000-a-week.",
      "The midfielder is out of contract at the end of this season, although United have an option to extend his deal by an additional 12 months. But United would look to negotiate any extension for the 33-year-old on reduced terms.",
      "Casemiro has re-established himself as an automatic pick at United under Ruben Amorim and is set to start Sunday's visit to arch rivals Liverpool when the Premier League returns following the international break.",
      "United have been on a mission to reduce their wage bill in recent years and Casemiro is one of the player salaries they would be looking to reduce if he stays on for next season.",
      "The midfield is the priority area of the team that United will look to strengthen next summer, with Brighton's Carlos Baleba and Crystal Palace's Adam Wharton among their intended targets.",
      "That would open the door for Casemiro to leave as a free agent , with clubs in his native Brazil and the Saudi Pro League having expressed interest in signing him next year.",
      "But with the futures of Kobbie Maintoo and Manuel Ugarte uncertain, with both unable to get into Amorim's first-choice selection, there could be a situation where Casemiro – who can start talking to foreign clubs from January – stays at Old Trafford.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: United handed injury boost after positive update on defender",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-handed-injury-boost-32674010",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Lisandro Martinez is closing in on a return to Manchester United training as he reaches the final stages of his recovery from a knee injury.",
      "Martinez's knee buckled when he fell to the ground against Crystal Palace at the beginning of February, and it was confirmed that he had suffered an injury to his cruciate ligament.",
      "The defender has been carefully handled during the rehabilitation process and he is now understood to be not far off returning to full group training after a period of working individually on grass.",
      "United will not take any risks with Martinez, so his return to a matchday squad is not imminent, but he could be available for selection again just before the November international break.",
      "Ruben Amorim's side visit Tottenham on November 8, which could be a realistic return date for Martinez to target, provided his reintegration to full United training goes smoothly.",
      "Speaking to club media this week, Casemiro discussed Martinez's recovery and said: \"Licha is on the final straight. He is a soldier who works so hard. He is always in the gym working hard.",
      "\"He works hard both on and off the pitch. He is a machine that works so hard. He is one those players who love to work hard. It is a pleasure to have him here. He works so much.",
      "\"We arrived at 9am, it's now 4pm and he continues working. He has the experience to know when to work hard. I am so glad - not just me, everyone - because he is an essential player at the club.\"",
      "Luke Shaw has started every Premier League game this season on the left side of the back-three, and Martinez is expected to compete with Shaw for a starting role when he returns.",
      "Amorim recently reflected on Martinez's absence, saying: “When you have that injury, you have that time where you recover a lot of things really hard, then there is the boring part where it looks like you don't go to the next step.",
      "\"We miss a lot Licha, especially in this moment, we miss his aggression in everything he does, we miss him. But he's always there in every meeting. In training, he sometimes finishes his and stays to watch the training. We need Licha in this team.”",
      "Martinez made 32 appearances in all competitions last term and is now into his fourth season in Manchester.",
      "-",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "MCDONNELL: Amoirm already knows the Man United game-plan to beat Liverpool - but he might not use it",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/ruben-amoirm-already-knows-man-32675395",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "David joined the MEN as Chief Manchester United Writer in September 2025.",
      "Manchester United should have ended their nine-year wait for a win at Liverpool in the first week of 2025.",
      "Having led on Ruben Amorim's first trip to Anfield as United boss, the visitors then found themselves 2-1 down, before an Amad goal 10 minutes from time made in 2-2.",
      "And in the final moments of added time, Harry Maguire squandered a chance to win the game for United, sending the ball over from 12 yards when he seemed certain to score.",
      "On Sunday, United will need show the same spirit, resilience and enterprise if they do not want their wait for a win at the home of their fiercest rivals to stretch to a decade.",
      "Back on January 5, United went toe-to-toe with Slot's Premier League leaders and could have put a significant dent in their title challenge had Maguire found the net to claim three points.",
      "As it was, it ended honours even between English football's two most successful teams, Liverpool's lead at the top stretched to six points and they went on to win a 20th top-flight title to draw level with oldest foes United.",
      "The prospect of Liverpool retaining the Premier League crown and overtaking United on 21 title triumphs should be enough motivation for Amorim's players to produce their best on Sunday.",
      "But having already stood up to the challenge presented by Liverpool in the first week of this year and coming away from Anfield disappointed not to have won, United know they can do so on Sunday.",
      "That draw at Liverpool was easily United's best performance under Amorim, who went with a midfield duo of Kobbie Mainoo and Manuel Ugarte, with captain Bruno Fernandes and Amad in the No.10 roles behind Ramus Hojlund.",
      "Given his preference for playing Fernandes in midfield this season, alongside Casemiro, and his unwillingness to trust Mainoo from the start in the Premier League, it seems unlikely Amorim will throw off the shackles at Anfield, despite Liverpool's perceived vulnerability after three straight defeats.",
      "The summer additions of Bryan Mbeumo and Matheus Cunha – both of whom operate as No.10s in Amorim's 3-4-2-1 system - mean Fernandes is destined to remain deployed in midfield, while fellow summer arrival Benjamin Sesko will lead United's attack.",
      "Mason Mount's energetic and goalscoring 65-minute outing in United's 2-0 win over Sunderland before the international break has surely made him a starter against Liverpool, most likely at the expense of Cunha.",
      "Two of United's heroes from the 2-2 draw at Anfield last season will be missing on Sunday. Lisandro Martinez, scorer of United's first that day, is still making his way back from a long-term knee injury, while Alejandro Garnacho, who came off the bench to set up Amad's leveller, is now at Chelsea.",
      "But there is enough quality at Amorim's disposal for United to go to Anfield this weekend with no fear, just as they did 10 months ago. A statement win for Amorim's men would compound Liverpool's current crisis and continue United's slow crawl up the table after such a wretched start to the campaign.",
      "To do so, Amorim could do worse than make his players sit down and watch a rerun of last season's encounter at Anfield, which should be the template for every United performance going forward, one underpinned by energy, commitment and character, traits that have been in short supply so far this term.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Manchester United handed Casemiro blow ahead of Liverpool",
    "tags": [
      "Man Utd",
      "Casemiro",
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-handed-casemiro-blow-32676311",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "The consensus is that Ruben Amorim will keep the same side that beat Sunderland before the international break when he takes Manchester United to Liverpool on Sunday.",
      "A trip to Anfield awaits when the top flight returns this weekend and while Arne Slot's side have lost their last three games in all competitions, it remains a daunting prospect for a United side who haven't won at Anfield in nearly a decade.",
      "Amorim opted for Mason Mount and Senne Lammens from the start against Sunderland and those two are in line to retain their places on Merseyside. Casemiro has been preferred as Bruno Fernandes' partner in midfield in recent weeks but Amorim has been handed something of a dilemma with the veteran.",
      "Casemiro has been in action for Brazil over the international break, alongside Mathues Cunha, with the pair involved in a 5-0 victory over South Korea before they were stunned 3-2 by Japan on Tuesday.",
      "That defeat has increased the pressure on boss Carlo Ancelotti ahead of the World Cup next summer and came after Brazil took a two goal lead.",
      "But perhaps the most pertinent news for United from Brazil's trip to Asia, came in Casemiro playing 90 minutes in both games.",
      "He captained the side in both fixtures and, at 33, has completed two full matches on the other side of the world with the physical and travel exertions that come with it. That is hardly ideal preparation for a domestic derby on Sunday with the midfielder set to have a minimum number of training sessions back at Carrington before the trip to Liverpool.",
      "Casemiro is a renowned trainer and may well cope with the demands placed on him. Speaking to United's website, he said: “I started to see a more gym focused side to me, where I tried to become stronger. We’re from Brazil, our main concern is quality with the ball, but it is important not to forget the physical side. In modern football, quality will always win, but the physical side is crucial too.",
      "“For me, my favourite thing to train is core. 100 per cent — core. Everything must be trained, but core is the base for everything. What people see on the outside can be beautiful, but this is what is on the inside, you have to be strong. In football, there is lots of contact and collisions. So, it is the most important part of the body and of the exercises.”",
      "Casemiro has already racked up 330 Premier League minutes this season, a figure that would have been higher had he not been sent off against Chelsea and subsequently missed the defeat at Brentford through suspension.",
      "It means Amorim must make a call on whether Casemiro can go again against Liverpool or whether his minutes will need to be managed.",
      "If Casemiro did drop to the bench, Manuel Ugarte - who deputised at Brentford - and Kobbie Mainoo would be the leading contenders to come into the side.",
      "Cunha, meanwhile, started Brazil's win over South Korea but was withdrawn with 10 minutes remaining before coming off the bench for the final half an hour against Japan.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Man United transfer news LIVE - Marcus Rashford verdict, Baleba 'stance', Wharton move",
    "tags": [
      "Transfer News",
      "Rashford",
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-united-transfer-news-live-32671068",
    "image": null,
    "date": "2025-10-14 20:00:00",
    "source": "manchestereveningnews",
    "body": [
      "Hello and welcome to live coverage of all the latest Manchester United news on Tuesday, October 14.",
      "The Reds' season is currently on hold due to the second international break of the season and talk has quietened around Ruben Amorim's suitability for the top job at Old Trafford for now after a 2-0 defeat of Sunderland last time out.",
      "Amorim's future may well have been knocked down the news agenda but United were plunged into further uncertainty last week when the mega-rich Saudi Arabian government official Turki Al-Sheikh made huge claims about a takeover of the club on social media.",
      "That sparked speculation online about what this could mean for the Reds' immediate future, with further claims that the supposed investors were based in the United Arab Emirates and had approached United legends about backing their bid.",
      "We will have all the latest on that, top transfer headlines and injury news as the Reds' return to action with a clash against Liverpool this weekend edges closer...",
      "That's it for today, folks!",
      "Thank you for tuning in with us. We'll be back bright and early tomorrow.",
      "Catch you then!",
      "Casemiro could stay at Manchester United beyond this season - but only if he takes a significant pay cut.",
      "The Brazil international and five-time Champions League winner with Real Madrid is among United's highest earners with a salary of around £300,000-a-week.",
      "The midfielder is out of contract at the end of this season, although United have an option to extend his deal by an additional 12 months.",
      "But United would look to negotiate any extension for the 33-year-old on reduced terms. Casemiro has re-established himself as an automatic pick at United under Ruben Amorim and is set to start Sunday's visit to arch rivals Liverpool when the Premier League returns following the international break.",
      "Read more here.",
      "Keane has spoken about Marcus Rashford before England's match with Latvia this evening. The forward is currently on loan at Barcelona from Man United.",
      "When asked on ITV Sport if the environment at United was not helping Rashford, Keane said: \"Well, it doesn't help, but if you look back at Marcus' time at United towards the end, there were obviously issues going on. He had one or two issues off the field.",
      "\"I think he was late for one or two meetings on a night out in Belfast or whatever, so he was part of the problem with the environment, particularly as one of the most experienced players at United. He should have been setting the standards and showing new people at the club what it's like to be a Man United player, but I think that's been well documented.",
      "\"What we have to look at with Marcus is he's got this sort of chance now with England, and he deserves it. No doubt about his talent. He's obviously fantastic. His stats obviously need to improve if he wants to go to that next level, like Thomas Tuchel just said there, in terms of goals and assists, but he has the talent.",
      "\"But the other bit that I think would have frustrated fans, not just maybe England more United, was his body language or not running back or not pressing properly. They're the stuff he has to tidy up, and if he does that, then there's no reason why he can't still become a world-class player.\"",
      "Manchester United will reportedly have to wait until next summer to sign Brighton star Carlos Baleba, according to talkSPORT.",
      "Brighton reportedly have no plans to sell Baleba in the January transfer window. The 21-year-old midfielder is said to be content on the south coast, with suggestions that he is pushing for a move being downplayed.",
      "Although Baleba made a huge impact for the Seagulls last season, his form has dipped this term, with Fabian Hurzeler admitting that the summer interest from the Reds may have unsettled him.",
      "\"For sure, when a young boy reads there is interest from Manchester United with a big, big offer, it might affect him deep, deep down,\" Hurzeler told talkSPORT. \"That’s also part of the development to understand that when you play well, there comes a big offer, there comes a big club who wants to have him.",
      "\"But then to keep pushing, to be humble, stay here in Brighton, and try to make the next step with the team and that’s something we have to keep on working with him.",
      "\"I can’t give you a clear answer if it’s really affected him or not. But for sure, he’s a young boy and we need to understand he’s not a machine that if you click on, then he always runs and off then he stops. We need to understand his feelings, his emotions, where he comes from, and that’s our responsibility.\"",
      "The consensus is that Ruben Amorim will keep the same side that beat Sunderland before the international break when he takes Manchester United to Liverpool on Sunday.",
      "Casemiro has been in action for Brazil over the international break, alongside Mathues Cunha, with the pair involved in a 5-0 victory over South Korea before they were stunned 3-2 by Japan on Tuesday. That defeat has increased the pressure on boss Carlo Ancelotti ahead of the World Cup next summer and came after Brazil took a two goal lead.",
      "But perhaps the most pertinent news for United from Brazil's trip to Asia, came in Casemiro playing 90 minutes in both games. He captained the side in both fixtures and, at 33, has completed two full matches on the other side of the world with the physical and travel exertions that come with it.",
      "That is hardly ideal preparation for a domestic derby on Sunday with the midfielder set to have a minimum number of training sessions back at Carrington before the trip to Liverpool. Casemiro has already racked up 330 Premier League minutes this season, a figure that would have been higher had he not been sent off against Chelsea and subsequently missed the defeat at Brentford through suspension.",
      "It means Amorim must make a call on whether Casemiro can go again against Liverpool or whether his minutes will need to be managed.",
      "Man United have been told that they are unlikely to land Crystal Palace midfielder Adam Wharton in January.",
      "The Palace star has been heavily linked with a move to Old Trafford as United bosses are on the hunt for a long-term successor for Casemiro, whose contract is set to run out in June next year. The 21-year-old made his England debut last year and is set to be one of Europe's most in-demand players - with Liverpool and Real Madrid also reportedly keen on securing his signature.",
      "Fabrizio Romano has reported the latest on Wharton's future. He claims that the England international's future at Palace is likely to be up for debate after next summer's World Cup rather than in the January transfer window.",
      "\"For January, Palace have no intention to negotiate,\" he said on his YouTube channel. \"They want Adam Wharton to stay at the club and to be a really important part of the story. Then 2026 summer transfer window, maybe after the World Cup, we will see if Wharton will be there or not. He has chances. Palace will assess the situation with the player, also based on proposals.",
      "\"We have many links with Man Utd. I can confirm that Man Utd appreciate the player guys, but it’s not only Man Utd. Trust me, it’s several clubs appreciating this boy. He’s really appreciated. He’s considered one of the best talents in his position in England.",
      "\"And so, for sure, there is interest, Man Utd, and not only, but at the moment, nothing has been decided in terms of bid, numbers. If you see, 30, 40, 50 millions, nothing at this stage. Palace are very focused on this season with the player and the player is very focused on this season with Palace.\"",
      "Bryan Mbeumo will be eager to help Cameroon reach the World Cup, but that ambition could come at a cost for Manchester United.",
      "Cameroon drew 0-0 with Angola on Monday and currently sits four points behind group leaders Cape Verde, who have already qualified for the World Cup for the first time. Mbeumo and Andre Onana, on loan at Trabzonspor, hope to see a similar outcome for their nation, but Cameroon must wait to find out if finishing second will secure a play-off spot.",
      "The goalless draw means Cameroon now relies on other results to determine their fate, with DR Congo, Uganda, or Nigeria still in contention to overtake them. Should they finish among the four best group runners-up, Cameroon would enter the Confederation of African Football (CAF) play-offs to decide who advances to the inter-confederation stage.",
      "If Cameroon reach the CAF play-offs, they are scheduled for the next international break in November. Winners would then face a second play-off to reach FIFA's inter-confederation tournament, which will feature teams from CONMEBOL (South America), CONCACAF (North America), OFC (Oceania), and AFC (Asia).",
      "In total, Cameroon could play up to four high-stakes matches - two CAF and two inter-confederation - to secure a spot at the 2026 World Cup.",
      "Lisandro Martinez is closing in on a return to Manchester United training as he reaches the final stages of his recovery from a knee injury.",
      "The defender has been carefully handled during the rehabilitation process and he is now understood to be not far off returning to full group training after a period of working individually on grass.",
      "United will not take any risks with Martinez, so his return to a matchday squad is not imminent, but he could be available for selection again just before the November international break.",
      "Manchester United summer arrival Diego Leon has just made his senior debut for Paraguay in an international friendly against South Korea.",
      "The left-footed defender is yet to make his bow for United's first-team but he has made several appearances in the matchday squad and also played 45 minutes in Premier League 2.",
      "Leon played the final 13 minutes of the 2-0 defeat after replacing Sunderland's Omar Alderete. The 18-year-old is pushing for his first minutes under Ruben Amorim but that seems unlikely to come soon with Noussair Mazraoui expected to return and Lisandro Martinez making progress in recovering from his injury.",
      "Manchester United could choose to try and keep Casemiro beyond his current contract which expires at the end of the season.",
      "According to ESPN, offering him a new has not been ruled out but he would need to take a pay-cut in order to remain at Old Trafford.",
      "There is a 12-month extension option in his current contract but activating that would require him to be paid at his current salary. Something that United may not be keen to do with aims to continue reducing their wage bill.",
      "Thomas Tuchel has delivered a thorough Marcus Rashford verdict with the Manchester United loannee included in a second consecutive England squad after a bright start to his spell at Barcelona.",
      "\"He can be one of the best in the world because of the quality I see in training, the finishing with both legs and with the head.",
      "\"He is explosive, he is fast, he is strong in the air, so where are the limits? There are no limits — but the numbers don’t reach the potential.",
      "\"He needs to push himself into goal involvements, that means goals and assists, it is as easy as that. [Consistency] is the headline for him. To keep on pushing himself to the limit. I think the limit for him is very, very high. Maybe higher than for others. He has the potential but potential is a dangerous word with high-level sports.",
      "\"You have to reach your personal best on a regular basis, that is what is demanded on this kind of level and that is the challenge for him. It’s not a question of talent, it’s a question of whether he can prove the point at club and international level. This is his task, whether he starts for us or comes off the bench, he has to constantly prove himself.",
      "\"He still has to make these decisions. He is still in that moment, he is still young enough to take the right decisions and not let go. Because otherwise he will be disappointed in ten years at what could have been and what he made of it.\"",
      "Manchester United transfer target Antoine Semenyo has made an excellent start to the 2025/26 campaign with Bournemouth.",
      "The 25-year-old was linked to several major Premier League teams but he opted to stay on the south coast by signing a new contract. Interest from elsewhere has remained though, and there could be an opportunity for teams to strike.",
      "According to talkSPORT's Alex Crook, a release has been included in his new deal but the exact details of it are being kept quiet with the Cherries wanting to keep their star winger.",
      "Tony Bloom has suggested it would take a lot for Brighton to cash in on Carlos Baleba. Speaking to The Argus, the Seagulls owner said: \"I don't think Baleba was a saga.",
      "\"There was interest from Manchester United, and we said that he wasn't available this summer and they went away. So we've had many bigger sagas in the past.",
      "\"But Carlos Baleba, his improvement has been immense. Massively important player to this football club, and just delighted that he's with us for this season...\"",
      "Speaking on his YouTube channel, Fabrizio Romano provided an update on Kobbie Mainoo's future. The journalist said: \"At the moment, Kobbie is not creating any problems, training at his best, trying his best for Man United, but he’s still not a regular starter and Kobbie wants to play.",
      "\"That has not changed since August. In August, Man United said, ‘No, you stay here. No chance even for a loan’. And Kobbie only wanted a loan and never a permanent transfer. In January, we will see because it’s still October.\"",
      "Romano added: \"So now full focus on training, working hard for United, but for January, the case of Kobbie Mainoo might become interesting again because several clubs from England, from Spain, and also from Italy, Napoli, and not only, are interested in Kobbie, on loan.\"",
      "Speaking on The Good, The Bad and The Football podcast, Paul Scholes questioned the the loan of Rasmus Hojlund and the signing of Benjamin Sesko.",
      "\"You look at Rasmus Hojlund, 22-year-old kid, came when he was 20 years of age,\" said the United legend. \"One centre-forward for Manchester United and everything was on him, the pressure was on him and he couldn’t handle it.",
      "\"He should be coming in and and out of the team. There should be three or four centre-forwards there. This summer, what do they do? They let him go and they buy another one, very similar, exactly the same!",
      "\"22 years of age. He’s started ok, he looks like he’s getting better. But where’s the common sense in that?\"",
      "According to talkSPORT, Brighton have no plans to sell Carlos Baleba at the end of the season. The 21-year-old midfielder was heavily linked with a move to United in the summer, but a deal never materialised.",
      "Fabian Hurzeler recently claimed that Baleba, who's had a shaky start to the season, has been affected by speculation linking him with Old Trafford. The Cameroonian sees his contract at the Amex Stadium expire in June 2028.",
      "According to Team Talk, Chelsea have 'intensified' their efforts in the race to sign Adam Wharton. The 21-year-old midfielder has recently been linked with a move to United following his impressive performances for Crystal Palace.",
      "The report claims that the Blues view Wharton as a 'long-term solution to bolster their midfield', with Romeo Lavia often out of action. It's said that the Eagles could demand at least £70m for the Englishman, who they want to keep until at least the summer of 2026.",
      "Team Talk reckons that Tottenham Hotspur and Liverpool have also shortlisted Wharton as a target.",
      "According to Fabrizio Romano, Barcelona have tied Frenkie De Jong down to a new contract which will keep him at the Camp Nou until at least June 2029. The 28-year-old midfielder had been linked with a move to United on numerous occasions in the past, but a deal never materialised.",
      "Speaking to Football Insider, Mick Brown claimed that United have set their sights on Aleksandar Pavlovic at Bayern Munich. The former chief scout at Old Trafford said: \"We know Amorim wants to sign a midfielder in January.",
      "“They need somebody who gets about the pitch, isn’t afraid to put their foot in, has a drive and energy about him to make a difference all over the pitch.",
      "\"But also somebody who can keep possession of the ball and help them advance up the pitch because at the moment they’re relying very much on Bruno Fernandes.",
      "\"Ideally they would get somebody like Moises Caicedo who does a bit of everything at Chelsea...\"",
      "Thomas Zilliacus has outlined his transfer plans as he prepares to approach investors ahead of a potential bid for Manchester United.",
      "\"That should be the backbone of the team. Then you can have a few experienced guys in the gel as well. I think it's always good to have a mix because the more mature guys, the more experienced guys, they also know how to act when things don't go well.\"",
      "Zilliacus added: \"Look at PSG. Ousmane Dembele is such a perfect example. Barcelona were pretty happy to see him go. Now he's got the Ballon d'Or and he's the star player in a team where he is allowed to play the way he should.",
      "\"But I also think the manager has managed to get him to understand that if he wants to be a star, he has to work. And now he's doing it...\"",
      "According to German outlet Bild, United are monitoring Jobe Bellingham's situation at Borussia Dortmund. The 20-year-old midfielder left Sunderland to join the German outfit in the summer for £27m, plus £4.2m in add-ons.",
      "The report claims that the Reds showed an interest in Bellingham before Dortmund secured his signature. The England Under-21 international has struggled to force himself into Niko Kovač’s side, having made just two starts in the Bundesliga so far this season.",
      "United will have to qualify for the Champions League just to stand a chance of signing Adam Wharton. Speaking on talkSPORT, Steve Parish revealed the midfielder's desire to play on the European stage.",
      "\"I think Adam at some point will want to play either in the Champions League with us, if we can make that happen, or probably with another club,\" said the Crystal Palace chairman.",
      "\"He's an extraordinary talent. I think right now, and I can't speak for Adam, but I think he's focused on his time at Crystal Palace. He had a broken season last season with the groin issues that he had that a lot of young players get.",
      "\"I think this season he's completely focused on putting the games in, getting in the England squad, being a regular for us, and making sure that he can show that Saturday, Sunday, Thursday, Sunday.",
      "\"It's a difficult programme for us right now. I think he's very committed to the club. I don't know where all this stuff comes from...\"",
      "This weekend, the Reds will lock horns with Liverpool at Anfield. While the reigning Premier League may fancy their chances, United have recently shown signs of promise..."
    ]
  },
  {
    "headline": "Roy Keane gives honest Man United response to Marcus Rashford 'inconsistency' claim",
    "tags": [
      "Rashford",
      "Roy Keane"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/roy-keane-gives-honest-man-32677980",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Roy Keane has questioned the excuses behind why Marcus Rashford might have struggled in recent seasons at Manchester United.",
      "Rashford moved to FC Barcelona on a season-long loan deal in July after being deemed surplus to requirements by head coach Ruben Amorim. The Catalan giants have the option to make his move permanent for £30million in 2026.",
      "Following the 27-year-old's standout performances since September's international break - Barca are reportedly keen to secure the England forward, but are hoping for a cut-price deal of around £26m. The Reds academy graduate has three years left on his current contract at Old Trafford, which he signed in July 2023 after scoring a career-best 30 goals for United in the 2022/2023 season.",
      "And when asked on ITV Sport if the environment at United was not helping Rashford, Keane said: \"Well, it doesn't help, but if you look back at Marcus' time at United towards the end, there were obviously issues going on. He had one or two issues off the field.",
      "\"I think he was late for one or two meetings, on a night out in Belfast or whatever, so he was part of the problem with the environment, particularly as one of the most experienced players at United. He should have been setting the standards and showing new people at the club what it's like to be a United player, but I think that's been well-documented.",
      "\"What we have to look at with Marcus is he's got this sort of chance now with England - and he deserves it. And there's no doubt about his talent. He's obviously fantastic.",
      "\"His stats obviously need to improve if he wants to go on to that next level, like Thomas Tuchel just said there, in terms of goals and assists, but he has the talent.",
      "\"But the other bit that I think would have frustrated fans - not just maybe England more so United, was his body language or not running back or not pressing properly. They're the stuff he has to tidy up, and if he does that, then there's no reason why he can't still go on and become a world-class player.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: United fan favourite is out of contract for a second time",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/manchester-united-fan-favourite-out-32673092",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United and Harry Maguire have opened initial discussions over a new contract.",
      "The one-year extension in Maguire's deal was triggered in January, meaning his contract expires in June 2026, and the defender will be hopeful of agreeing fresh terms at Old Trafford.",
      "Maguire has continued to earn the salary agreed upon in the contract he signed when arriving from Leicester City, thanks to the one-year extension clause. However, negotiating a fresh deal gives United the opportunity to offer a reduced wage packet, which is usually the sticking point during such talks.",
      "The 32-year-old was at the peak of his powers when he arrived in Manchester. He joined in a £80million transfer, but now finds himself at a different stage of his career six years on.",
      "Inevitably, that means Maguire will not be offered a new deal at his current salary - the new offer will reflect his role in the dressing room and his fair value.",
      "Matt Hargreaves, director of football negotiations at United, will liaise with Maguire's representatives over the next few months.",
      "Sources have spoken glowingly about Hargreaves and have praised his understanding of players, the football business and negotiations, so he is seen as a valuable member of staff.",
      "Hargreaves is said to be a smart operator, so a fair offer should be submitted to Maguire, and the likelihood is that both parties will reach an agreement as there is willingness on both sides.",
      "The number of years offered remains to be seen. Maguire would probably love to sign for another three, while United might feel that a one-year deal is most logical considering he turns 33 in March.",
      "The compromise might be offering a two-year contract to Maguire, who has not been a regular starter in the Premier League so far this season, but who still can provide plenty of quality.",
      "Maguire's performances last season were excellent. United disappointed collectively and finished 15th, but he emerged with credit whenever he played, which couldn't be said about most of his colleagues.",
      "The England international missed some time on the pitch due to a handful of small injuries. Maguire suffered a knock in training, then he was sidelined with a muscle issue and subsequently had a calf problem.",
      "Maguire did not deal with such problems as often earlier in his career, but a fresh two-year deal makes sense when his admirable leadership qualities at Carrington are also considered.",
      "He has demonstrated remarkable mental strength - Maguire was booed by Dublin 'United fans' during the 2023 pre-season - to rise above intense scrutiny to become a fan favourite.",
      "Maguire's redemption arc has been uplifting, although he has remained the same person at the training ground irrespective of external noise: he is an example and a model professional.",
      "Young players are able to approach Maguire for counsel and some believe he's become a better leader since losing the captain's armband due to the pressure associated with the responsibility.",
      "Maguire is the kind of player you want in your dressing room and it would cost more to find a like-for-like replacement, in terms of his quality and character, than agreeing a new deal.",
      "Jason Wilcox presented Maguire with a framed shirt for reaching 250 United appearances before the victory against Chelsea last month. Maguire has experienced highs and lows during his time at the club, but the general consensus among supporters is now that he's been a good signing.",
      "Reflecting on his time at United, Maguire recently said: “To play that amount of games is a huge privilege. The dream of a young kid, growing up in Sheffield, to play one game for Manchester United would have been a dream come true, but to play 250 I feel really lucky, really grateful.\"",
      "There should be more games for Maguire to play in a United shirt beyond 2025/2026.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Inside Rasmus Hojlund's Man United exit - family reaction, Napoli revival and what's changed",
    "tags": [
      "Hojlund"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/inside-rasmus-hojlunds-man-united-32668146",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United centre-forward Rasmus Hojlund and his family hold no animosity towards the club for the manner in which his time at Old Trafford was cut short two years after his £72m arrival.",
      "The Dane joined the Reds in 2023 and after enjoying a productive first season at Old Trafford, with 16 goals, Hojlund's statistics dipped in his second campaign as Ruben Amorim arrived in Manchester. He managed just four Premier League goals with the pressure on the 22-year-old, Amorim decided this summer that the striker's future was better served away from the Theatre of Dreams.",
      "A loan switch to Napoli was agreed and since leaving United, Hojlund has scored four goals in six appearances for the Italian champions and has another four goals for Denmark.",
      "Speaking exclusively to MEN Sport, Christian Mouroux who is a friend of Hojlund's family and the current sporting director at HUI Football, the forward's childhood team in Denmark, explained why there was a sense of surprise when he was immediately thrust into the key role of leading the line at Old Trafford.",
      "\"I think Rasmus didn’t expect to be the main striker when United first showed interest in him,\" Mouroux said. \"I think he would have been fine as an intern for the main striker position for the first year or two.",
      "\"However, this status somehow changed during the recruitment process, and he became the main guy for United overnight. I think he took that challenge head on and with the type of confidence of, okay, well if that is what United thinks of me then let me try and be that from the beginning.",
      "\"He was perhaps a little too young [for United]. Rasmus’ abilities fit very, very well to the Premier League and English football so I think it was a good signing, it was well scouted and I think Rasmus proved both before he came to United and also now as he left for Napoli that he has strong abilities as a powerful No.9 and he can score goals.\"",
      "While there may have been some confusion as to why Hojlund was suddenly the first choice at Old Trafford, Mouroux was keen to stress that there was never any animosity towards United from the family. \"I last saw him was at the beginning of his time at United and it was when he was scoring goals,\" he added. \"At that point he was very happy. I have chatted with his father on a few occasions since then, also during the more difficult period at United.",
      "\"And I must say I think this family is extraordinary in every sense of the word when it comes to professionalism. They keep their nose on track and even during the difficult times, they are focused on what they can do to improve.",
      "\"I’ve never been in dialogue with the family at any point where they felt particularly frustrated. They were more constructive around wanting to be a success with and for United.\"",
      "Hojlund's loan move to Napoli has seen him reinvigorate his career with goals coming a lot more frequently. Mouroux feels that has a lot to do with the difference in environment in Naples.",
      "\"When you come from a team that isn’t living up to expectations, it will take a toll on a player’s confidence and it takes a toll on how you interact within the team,\" he said. \"So it takes a lot of effort to try and break that cycle.",
      "\"It is just the fact that he has come into a different environment, a breath of fresh air, new ideas, a new team that has been successful and he has managed to go with that flow. He also comes in with more experience after two years at United, he is a better player now.",
      "\"He also came from the Italian league so he knows what it is about and he has McTominay who comes from the same environment as him so he can help with the on-boarding. I just think he is in a really good environment for him.",
      "\"I think it was the right decision for him to go, and his performances show that.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Sir Jim Ratcliffe's hidden message to Man United squad that should help Ruben Amorim",
    "tags": [
      "Ratcliffe",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/jim-ratcliffe-manchester-united-amorim-32677592",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Rio Ferdinand believes that Sir Jim Ratcliffe coming out and backing Ruben Amorim will have sent an important message to the Manchester United squad.",
      "Ratcliffe has said that Amorim needs three years to prove himself as a good coach. The club's co-owner acknowledged that it has not been the best of seasons, but compared that to the \"miserable time\" Mikel Arteta had in his first couple of years in charge of Arsenal.",
      "Ferdinand, though, does not think he is the right person to draw a comparison with, despite understanding the sentiment. But despite not completely agreeing, he insists that the message is significant.",
      "\"I think it's really important [that] the message [is sent] out to the current squad,\" Ferdinand said during a video on his YouTube channel. \"With that message, you don't get players sitting there going, 'Oh, he's going to be off in a minute anyway, I can just sit here and chill, I can down tools.'",
      "\"No, in their eyes now, he ain't going. 'I'd better pull my finger out and start doing a bit.'\"",
      "Ferdinand also appreciates Ratcliffe's openness. \"You know what, I just like to hear the people that are in the driving seat of a football club come out and speak,\" he said.",
      "\"That's what I like about Jim Ratcliffe. He went on a podcast to speak about something totally different, but obviously, that podcast isn't going to allow him to come on and not ask him about Man United.",
      "\"So, it's just refreshing that somebody in his position actually talks. Do I exactly agree with what he said?",
      "\"I understand the sentiment– if you go through the facts, I don't think it's the right person to draw a comparison with. You look at Arteta – there are similarities in some of the stats.",
      "\"The big one is that he improved the team from 10th to finish eighth in his first year. Amorim took his team from 14th to finish 15th. There was also flexibility in the way Arteta had his team.",
      "\"I think he had about seven different formations in his first 50 matches, just trying things out. The improvement line would have been a bit more consistent, and you'd go, 'I can see it happening.'",
      "\"Whereas with Amorim, you look at him and there isn't as much consistency or positives that are coming out of it that you're going, 'oh, I can actually see it clearly, it's hitting me between my eyes, I couldn't let this guy go'.",
      "\"I think right now, we're at a stage with United and Amorim, [where] I just want to see that consistency of some results coming through, performance alongside that, and an idea that you go, 'oh, I can see this training ground stuff really paying off'.",
      "\"The consistency with all of those three different elements isn't there right now, and I'm hoping he can get that right.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Manchester United learn Adam Wharton January transfer stance - ‘I can confirm’",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/transfer-news/manchester-united-adam-wharton-transfer-32677622",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United have been told that they are unlikely to land Crystal Palace midfielder Adam Wharton in January.",
      "The Palace star has been heavily linked with a move to Old Trafford as United bosses are on the hunt for a long-term successor for Casemiro, whose contract is set to run out in June next year.",
      "Wharton is widely regarded as one of the Premier League's brightest emerging talents due to his stellar performances for Palace over the past two seasons - including their FA Cup final triumph over Manchester City at Wembley in May.",
      "The 21-year-old made his England debut last year and is set to be one of Europe's most in-demand players - with Liverpool and Real Madrid also reportedly keen on securing his signature.",
      "Fabrizio Romano, who specialises in transfers, has reported the latest on Wharton's future. He claims that the England international's future at Palace is likely to be up for debate after next summer's World Cup rather than in the January transfer window.",
      "\"For January, Palace have no intention to negotiate,\" Romano said on his YouTube channel. \"They want Adam Wharton to stay at the club and to be a really important part of the story.",
      "\"Then 2026 summer transfer window, maybe after the World Cup, we will see if Wharton will be there or not. He has chances. Palace will assess the situation with the player, also based on proposals.",
      "\"We have many links with Man United. I can confirm that Man United appreciate the player guys, but it’s not only Man Utd. Trust me, it’s several clubs appreciating this boy. He’s really appreciated. He’s considered one of the best talents in his position in England.",
      "\"And so, for sure, there is interest, Man United, and not only, but at the moment, nothing has been decided in terms of bid, numbers.",
      "\"If you see, 30, 40, 50 millions, nothing at this stage. Palace are very focused on this season with the player and the player is very focused on this season with Palace.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Marcus Rashford and Man United not on same page over what club sees as 'certain possibility'",
    "tags": [
      "Rashford"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/man-utd-marcus-rashford-barcelona-32677644",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Marcus Rashford will move on from Manchester United at the end of this season, according to Clinton Morrison.",
      "The forward graduated from the club's famed academy, in 2015, and will be remembered as one of United's most-prolific products - with 138 goals and 78 assists in more than 400 appearances for the club. However, it appears as though his tenure at Old Trafford has come to an end.",
      "England international Rashford fell out of favour under Ruben Amorim upon his arrival in November, joining Aston Villa on loan for the latter half of the 2024/2025 Premier League season. And, when he returned to the north west this summer, he still remained omitted from Amorim's plans going forward.",
      "As a result, Rashford pushed heavily for a move away from his boyhood club - subsequently joining Barcelona on a season-long loan for the duration of the new season. The Catalan giants also hold an option to buy the 27-year-old at the end of his spell.",
      "Despite speculation over whether Barcelona will choose to exercise that option, Rashford will still have two years left on his United contract next summer. And while it has been suggested that the club will hope that he will return and flourish in the event that he doesn't join Barcelona permanently, Morrison has opposing views.",
      "\"I thought this was the prime time. You can see that the moment he's gone to Barcelona, he's took his game to another level. We're seeing Marcus Rashford play with a smile on his face.",
      "\"He looks sharp, he's scoring spectacular goals, he's assisting. So I think that ship's sailed for him to go back.",
      "\"Listen, as you just said, he's still got two more years - so it's up to Man Utd what happens with him. But I think for both parties, it'll probably be at the end of this season, Marcus Rashford moves on, because he's doing ever so well at the moment.",
      "\"I think he's a top talent. He's letting his feet do the talking right now and he looks like he's concentrating at the moment, so long may it continue.\"",
      "It comes after Rashford spoke of an inconsistent environment at Old Trafford ahead of England's clash with Latvia on Tuesday night. Speaking to ITV about Thomas Tuchel's comments that he needs to be \"more consistent\" before he's considered world-class, Rashford explained: \"For sure, consistency is a massive part of it.",
      "\"I feel I have been in an inconsistent environment for a very long time, so it is even more difficult to be consistent. But I completely agree, I think consistency is what I need to bring into my game, and I'm looking to do that.",
      "\"I want to be at my best, not sometimes, but as often as possible. When people talk about consistency, in order to be consistent in anything, not just sport, you need consistent variables in your life and the way you train.",
      "\"We have just had so many changes so far in my career. But I have to look forward, and that is definitely one of the things I want to put right and improve on to be at my best more often.",
      "\"When I am at my best, I really enjoy everything about the sport.\"",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Rashford's latest Manchester United comment might split opinion",
    "tags": [
      "Man Utd",
      "Rashford"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/marcus-rashfords-latest-manchester-united-32668933",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United loanee Marcus Rashford is currently on international duty with England.",
      "Rashford sat down with ITV Sport before the Three Lions' game against Latvia and was asked about Thomas Tuchel's assessment that he only needs consistency to become world-class.",
      "His answer received attention from the media. \"For sure, consistency is a massive part of it. I feel like I have been in an inconsistent environment for a very long time,\" said Rashford.",
      "\"So it is even more difficult to be consistent, but I completely agree, I think consistency is what I need to bring into my game and I am looking to do that. I want to be at my best, not sometimes, but as often as possible.",
      "\"When people talk about consistency, in order to be consistent in anything not just sport, you need consistent variables in your life and the way you train. We have just had so many changes so far in my career but I have to look forward and that it definitely one of the things I want to put right and improve on to be at my best more often. When I am at my best I really enjoy everything about the sport.\"",
      "The first part of Rashford's answer has been interpreted as a critique of United over the last nine years, but some fans have argued the 27-year-old must take responsibility himself.",
      "Rashford and those supporters are correct - both can be true. United have been a dysfunctional club, which has not been conducive to high performance, but Rashford has not helped himself along the way.",
      "Louis van Gaal handed Rashford his debut in 2016 and he played for a further four permanent United managers - Jose Mourinho, Ole Gunnar Solskjaer, Erik ten Hag and Ruben Amorim.",
      "Three interim United managers, Michael Carrick, Ralf Rangnick and Ruud van Nistelrooy, have also worked with Rashford, so it's fair to say the environment at United has been \"inconsistent.\"",
      "Those managerial changes at United have happened in the same timeframe as Pep Guardiola's reign at Manchester City (Guardiola was appointed at the Etihad in the summer of 2016).",
      "There is no denying that the environment has not been right at United, although it would be naive to suggest that the situation at Carrington is the only reason for Rashford's inconsistency.",
      "There have been concerns about Rashford's off-field behaviour in recent years, and he even survived a boozy jaunt to Belfast because Ten Hag believed it would be detrimental to freeze him out of his plans.",
      "Ten Hag disciplined Rashford, but Amorim subsequently saw something he did not agree with, which led him to drop the academy graduate for the Manchester derby last December.",
      "A combination of the environment at United and Rashford's poor choices has contributed to his inconsistency, ultimately preventing him from becoming a world-class player.",
      "There are no more excuses for Rashford at Barcelona. The Catalan club have a winning environment, with a superb manager in place, and everything is right for him to succeed.",
      "Rashford appears to have taken that opportunity, scoring three goals and recording six assists in Spain, although he was recently dropped for a game against Getafe after being late to a team meeting.",
      "The Wythenshawe-born forward was only two minutes late, but Hansi Flick enforced a disciplinary rule that meant he lost his starting role. Rashford might have been stuck in traffic or overslept. And it was just two minutes, but he is paid handsomely to do his job and should be able to follow the rules.",
      "Everyone knows Rashford has the talent to be regarded as world-class - he just needs to get the basics right.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "RAILSTON: Impressing Ruben Amorim at just 14-years-old - Manchester United have the 'next Neymar'",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/jj-gabriel-man-united-academy-32530763",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "JJ Gabriel enjoys video games and comes out of his shell once he gets to know someone.",
      "In many ways he is a normal 14-year-old, but his extraordinary talent is revealed when he steps onto a football pitch. There is certainly nothing normal about what Gabriel can do with a ball at his feet.",
      "That is quite the prediction considering the graduates who have come before Gabriel, who already has more than 200,000 followers on Instagram and a sponsorship deal with Nike.",
      "Academy coaches who have worked with Gabriel have marvelled at the youngster's skillset and have struggled to find weaknesses, despite playing him years above his age group.",
      "Gabriel idolises Neymar and some of his goals are reminiscent of the Brazilian at the peak of his powers. Last weekend in an Under-18 game, Gabriel glided into the penalty area, deceived a Manchester City defender with a shimmy and found the corner. The clip has amassed thousands of views on social media.",
      "Word of Gabriel's talent has already swept around the world. Europe's top clubs have closely followed his development, and the teenager was close to leaving United in the summer.",
      "Talks were advanced with a European giant and an eleventh-hour meeting was held at Carrington in an attempt to keep Gabriel. It's understood Jason Wilcox (director of football) and Omar Berrada (CEO) were present, which shows the high regard in which Gabriel is held.",
      "United reiterated that Gabriel could become the face of the club and it was eventually agreed the teenage sensation would remain in Manchester - the player's final decision was decisive.",
      "There are windows for rivals to poach academy players at 14 and 16. Gabriel has committed his future at United for another two years at least, but interest from Europe's biggest sides will only intensify as he gets older, especially as he holds a European passport through his parents.",
      "United know they have a special talent on their hands and recently introduced Gabriel to Ruben Amorim. During their exchange, Amorim spent time discussing his philosophy and stressed the importance of working hard, even recalling an anecdote about Cristiano Ronaldo as an example.",
      "Amorim played alongside Ronaldo for Portugal's national team. The United boss recounted stories about Ronaldo's work ethic - he was the first to report for training and the last to leave.",
      "Gabriel does not lack a work ethic. He is already living like a dedicated professional athlete with his diet and recovery sessions, and wakes up at 6am most days to make his dream a reality.",
      "In the summer, he trained at a Nike camp in Marbella with Newcastle midfielder Sandro Tonali and former Liverpool striker Danny Ings. When Marcus Rashford joined Aston Villa on loan in January, Gabriel thanked him for taking penalties with him at Carrington before he left.",
      "He also received a \"get well soon\" video from Andre Onana when he was recovering from his shoulder injury last year. Experienced players are shocked when they learn his age.",
      "Gabriel has been offered a box at the new Old Trafford, which is planned to be completed by 2030, and was invited to watch the Premier League opener against Arsenal in the directors' box.",
      "It speaks volumes that brands are already desperate to work with Gabriel, who was subject to interest from Adidas before Nike beat off competition from the German company.",
      "Adidas were in pole position to sign Gabriel before a late effort from Nike to better their offer - how many 14-year-olds could spark a bidding war between sportswear's commercial giants?",
      "United want to temper expectations to help Gabriel focus on football. Former academy director Nick Cox was asked a question about Gabriel during an interview earlier this year and politely steered the conversation in another direction. Those questions will become common for his successor.",
      "Those who know Gabriel are not concerned about keeping him grounded. He has strong family support and a circle of friends, and those closest to him don't let him get ahead of himself. He is just JJ to them.",
      "Gabriel possesses the right mentality to enjoy a successful career. It takes him just minutes to forget about the football after leaving the pitch following an academy game at Carrington.",
      "That is a trait that many top professionals share - the ability to separate what happens on the pitch from their home lives - but Gabriel loves playing football and entertaining with the ball.",
      "Darren Fletcher was appointed as U18 manager in the summer, and a source praised Fletcher's handling of Gabriel this season because he wants him on the ball as much as possible.",
      "Gabriel has been played down the middle and from the left this term, although it doesn't matter which position he plays because the end result is the same: he tears through the opposition and scores.",
      "MUTV subscriptions might begin to sell like hot cakes, just so fans can watch Gabriel play.",
      "The teenager's ball control is exceptional, and his finishing power is remarkable for a player of his age. Gabriel has seven goals in six Under-18 appearances and scored for the Under-17s on Wednesday.",
      "He was even given the nickname 'Kid Messi' after clips of him training and completing skills went viral on social media when he was younger, and Lionel Messi would probably approve of his footwork.",
      "Fans have already started to speculate when Gabriel could make his senior debut, and it already feels likely that he will become United's youngest-ever Premier League player.",
      "Angel Gomes (16 years, 263 days), Shola Shoretire (17 years, 19 days) and Chido Obi (17 years, 79 days) are the youngest to make a debut for United in the Premier League.",
      "Gabriel has the potential to break that record, and he could even topple the Premier League record of Ethan Nwaneri (15 years, 181 days). Max Dowman (15 years, 235 days) is the second youngest.",
      "Mikel Arteta has shown faith in Nwaneri and Dowman at Arsenal, while talented Liverpool youngster Rio Ngumoha recently scored on his senior debut aged 16 years and 361 days.",
      "Dowman and Ngumoha have blown away spectators this season, offering an exciting glimpse into the future of English football, but many believe Gabriel could be the pick of the bunch.",
      "There is a reason why Wilcox and Berrada were involved in the meeting to keep Gabriel in the summer, and why the youngster has been offered a box at the new Old Trafford.",
      "He is a generational prospect - and the best is yet to come from the supremely talented teenager.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "MCDONNELL: Man United player ratings vs Sunderland with two 8/10s as Mason Mount and Senne Lammens good",
    "tags": [
      "Mason Mount"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/man-united-player-ratings-vs-32612073",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Manchester United secured a huge win over Sunderland at Old Trafford on Saturday to ease the pressure on struggling boss Ruben Amorim.",
      "First-half goals from Mason Mount and Benjamin Sesko were enough to earn United three points that move them up six places to eighth in the Premier League going into the international break.",
      "Here is how United's players rated this afternoon:",
      "Senne Lammens",
      "An assured United debut from the deadline day signing. Confident coming for the ball and made a fine save from Granit Xhaka and one near the end. Will be hard to dislodge him. 8",
      "Leny Yoro",
      "Disciplined in his defending and deserving of his recall to the starting line-up after being benched for the previous two games . Brings better balance to United's back three. 7",
      "Matthijs de Ligt",
      "Alert to danger throughout and never caught out of position defending his goal. Played a key role in United's second goal, challenging for the flick-on that ultimately led to it. 7",
      "Luke Shaw",
      "Kept his place on the left side of United's back three, but moved inside to a more central position at times after the break, giving United greater control on the ball. 7",
      "Amad",
      "A constant threat down the right side. Tormented Sunderland's defence and unlucky not to score in the first-half when he cut inside and saw a goal-bound effort saved. 7",
      "Casemiro",
      "Back in the starting line-up following his one-match ban, he was disciplined in midfield, although he picked up an obligatory booking late on for a poor challenge. 7",
      "Bruno Fernandes",
      "Another ebullient performance from the United skipper, who was seemingly everywhere, covering so much ground. Had an exquisite chip tipped onto the bar by Robin Roefs. 7",
      "Diogo Dalot",
      "Kept his place following the Brentford debacle and it was from his long throw-in that Sesko was able to plunder United's second goal. Impressive energy levels. 7",
      "Bryan Mbeumo",
      "Provided the assist for Mount's opener and never gave the Sunderland defence any peace with his runs in behind and ability to pick up dangerous positions. 7",
      "Benjamin Sesko",
      "Scored for the second game running with a classic poacher's goal from close-range in the first-half. United exploited his aerial threat throughout to win second balls. 7",
      "Mason Mount",
      "Restored to the starting line-up and justified his selection by setting United on their way to victory with a superbly-taken goal. Standing ovation when taken off. 8",
      "Subs:",
      "Dorgu (Dalot, 64)",
      "Solid at left wing-back. 6",
      "Cunha (Mount, 64)",
      "Lively attacking threat. 6",
      "Mainoo (Mbeumo, 76)",
      "Not enough time to impact the game. 6",
      "Ugarte (Casemiro, 85)",
      "A late arrival. N/A",
      "Maguire (Yoro, 85)",
      "Helped see out the win. N/A",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "PGMO chief Howard Webb admits referee 'error' during Man United's Brentford defeat",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/pgmo-chief-howard-webb-admits-32615914",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "PGMO chief Howard Webb has reportedly admitted to Manchester United that Brentford defender Nathan Collins should have been sent off in their defeat on September 27.",
      "With United trailing 2-1 after an Igor Thiago brace which was pegged back by Benjamin Sesko, the Reds won a penalty after Collins tugged back Bryan Mbeumo inside the penalty area. The spot kick was rightly awarded but the punishment for Collins by referee Craig Pawson was merely a booking.",
      "Had Collins made a genuine attempt to play the ball, a booking would have sufficed in this scenario thanks to the recently introduced 'double jeopardy' rule. However, it seemed clear at the time that Collins did not make a genuine attempt and he was the last man, thus preventing Mbeumo having a goalscoring opportunity.",
      "The decision not to send off Collins would feel even more bitter when Bruno Fernandes missed his penalty and Mathias Jensen scored late to win the game 3-1. According to the Daily Mail, United chiefs Omar Berrada and Jason Wilcox sought clarification on the decision with Webb who admitted the mistake.",
      "It is claimed that United did not want to make a 'public fuss' about the situation and appreciated Webb's rational explanation for why the mistake was made. Of course, had Collins been sent off the context of the game could have been a lot different with United having roughly 20 minutes against ten men to seek an equaliser.",
      "What's more, the defeat caused significant pressure to mount on Ruben Amorim which may not have been the case had the match finished differently. MEN Sport understands that United are not currently considering sacking their Portuguese head coach.",
      "Despite reports stating that Gareth Southgate is among the names that Ineos are considering replacing Amorim with, there are believed to have been no contacts made with other managers regarding the currently filled position at Old Trafford. Fortunately for United, they put the defeat to Brentford behind them on Saturday with a 2-0 victory over Sunderland.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Belgian media make Liverpool point after Senne Lammens' Man United debut - 'his true colours'",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/senne-lammens-debut-reaction-media-32613662",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Goalkeeper Senne Lammens began his Manchester United career with a win and a clean sheet, and the Belgian international received plenty of credit from his home country's media. Lammens joined United from Royal Antwerp on transfer deadline day but has needed to wait patiently for his debut while Ruben Amorim continued to keep faith with Altay Bayindir.",
      "The new keeper's opportunity arrived at last on Saturday, with Amorim handing him a start against Sunderland. All went according to plan for the 23-year-old, with goals from Mason Mount and Benjamin Sesko ensuring United got three points and eased the pressure on their head coach.",
      "United's win was a timely one for Amorim, with some suggestions his job could be at risk if his team lost. After the victory, he spoke highly of Lammens while also praising the team as a whole.",
      "\"We didn’t play well all the game, but we had our moments and we defended well,\" Amorim said. \"I think Senne did a great job and gave us confidence. It was a good day, not a perfect day, but to win like this with a clean sheet is important for our team.",
      "\"We need to understand that we need everyone to be ready to play. It's a long season, we have a lot of problems, anything can happen. The important thing is that the teammates helped Lammens a lot to have a very good performance.\"",
      "While Lammens will surely face trickier tests than Sunderland this season, perhaps starting with his next game, he still earned plaudits from the Belgian press.",
      "\"Against Sunderland, the scenario was perfect for Lammens,\" Sporza's verdict began. \"He was barely challenged in the first half and took no risks in possession. It was striking how he constantly connected with his backline and made adjustments.",
      "\"Sober, precise, and controlling. Old Trafford appreciated this and gave Lammens plenty of opportunities at times.\"",
      "The same publication pointed to his sharp save from a long-range Granit Xhaka effort, as well as the let-off he received when Bertrand Traore was booked for diving after it looked for a moment as though Lammens had conceded a penalty.",
      "\"If Ruben Amorim still had any doubts about who would be the first choice goalkeeper, Lammens has more than left his mark today,\" Sporza added.",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "Elsewhere in Belgium, HLN highlighted Amorim's praise for Lammens while pointing out the goalkeeper watched much of the first half 'from a distance'. They wrote: \"Just over a month after his arrival and after three matches on the bench, Lammens finally made his debut for Manchester United.",
      "\"The goalkeeper thus became the seventh Belgian to feature for the Red Devils. Marouane Fellaini, Romelu Lukaku, Adnan Januzaj, Ritchie De Laet, Marnick Vermijl, and Largie Ramazani preceded him.",
      "\"Lammens had to prove himself once in the first half. The former Antwerp goalkeeper made a good save on a powerful shot from Xhaka. His play on the ball at his feet and on high balls was also flawless. From a distance, our compatriot saw Manchester United dominate.\"",
      "The report added that his next assignment could be considerably trickier. \"All in all, Lammens can look back with satisfaction on his debut in the Manchester United shirt,\" it read. \"His first clean sheet is a fact. This debut will leave him wanting more. His next assignment? The top-flight match at Anfield against Liverpool on Sunday, October 19th. Lammens will likely be tested more then.\"",
      "Nieuwsblad's Brian Dewulf referenced United fans' response to the impressive debut. \"Just before half-time, Senne Lammens finally got the chance to show his true colours,\" he wrote. \"Granit Xhaka had the first attempt for Sunderland, but Lammens saw the long-range shot come from far out and made a good save. There was applause in Old Trafford.",
      "\"The Belgian goalkeeper remained virtually unemployed in the second half, though it was a bit of a shock after an hour of play. Bruno Fernandes gave his keeper the runaround with a long ball, causing the pair to collide. Sunderland winger Traoré lurked and nearly capitalised, but also went down in the action.",
      "\"Ultimately, Man United were given the foul, allowing Lammens and his teammates to breathe a sigh of relief. He was applauded again in the final seconds for his second save of the evening, but Lammens was never given another opportunity.",
      "\"It was certainly a successful debut for the Belgian goalkeeper. Manchester United secured only their third Premier League victory, and the young Belgian also secured their first clean sheet of the season for the Mancunians.",
      "\"Has the train departed? During the match, the home fans were already singing loudly for the goalkeeper: \"Are you Schmeichel in disguise?\" fans wondered aloud if Lammens wasn't just the former Danish legend of Man U.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Marcus Rashford sends fresh message but ex-Man United star helps ruin his day",
    "tags": [
      "Rashford"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/marcus-rashford-goal-sevilla-barcelona-32615837",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Marcus Rashford continued his impressive start to life at Barcelona as he netted a stunning volley against Sevilla.",
      "The England international celebrated his latest call-up by Thomas Tuchel by getting on the scoresheet for the Catalan giants.",
      "Pedri delivered the perfect ball after Barca had hounded their opponents high up the pitch, and Rashford timed his run from the left with precision before firing it past Odysseas Vlachodimos, on loan from Newcastle, with his left foot.",
      "The goal marked the seventh consecutive match in which Rashford has made a goal contribution, and he now has three goals and five assists in 10 appearances since making his loan move from Manchester United.",
      "Rashford has more contributions than United stars Bryan Mbeumo, Bruno Fernandes and Benjamin Sesko combined.",
      "The 27-year-old's efforts on Sunday were in vain, however, as Barcelona crashed to a 4-1 defeat.",
      "Former United star Alexis Sanchez opened the scoring from the penalty spot before Isaac Romero doubled the home side's lead. Rashford's impressive strike then came in first-half injury time.",
      "Late goals from Jose Angel Carmona and Akor Adams ensured a big upset, however, as Sevilla claimed three points.",
      "Barca boss Hansi Flick said: \"The first half was not good for us, they played one against one and very aggressive.",
      "\"We had no solutions, that's not a good thing. But in the second half I really appreciate the team's reaction.",
      "\"I don't want to talk about the two goals, we don't want excuses. We have to focus on the first half, but the most important thing is the reaction. This defeat is important and after the break we will fight for all the titles. That's what we want, we are a good team.\"",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Man United vs Sunderland LIVE highlights and reaction from crucial win",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/man-united-vs-sunderland-live-32610647",
    "image": null,
    "date": "2025-10-04 17:40:00",
    "source": "manchestereveningnews",
    "body": [
      "Manchester United secured their third Premier League win of the season on Saturday as they beat Sunderland 2-0 at Old Trafford.",
      "The visitors started strongly but United soon took control of the game and Mason Mount produced an excellent finish to put Ruben Amorim’s side ahead.",
      "Benjamin Sesko made it 2-0 shortly after the half hour mark as he grabbed his second goal in a week.",
      "Sunderland were awarded a penalty before the half-time break but the decision was overturned by referee Stuart Attwell after he’d been advised by VAR to head over to the pitchside monitor.",
      "United held strong in the second half to see out the win.",
      "Here’s all the reaction from today’s game:",
      "Ruben Amorim's Manchester United players delivered for their boss to spare him another uneasy inquest and potentially the sack.",
      "Amorim admitted ahead of the game that it would be impossible for him to carry on if results did not improve – with this game billed as make-or-break for the embattled United boss.",
      "Amorim will hope he can now head into the international break without worrying about getting a call from chief executive Omar Berrada thanking him for his time in charge.",
      "Amorim needed this victory to ease the growing pressure on him, amid suggestions of players losing faith in his methods and United's hierarchy starting to harbour doubts about him.",
      "United remain a work in progress and have yet to win back-to-back league games under Amorim, but this win – albeit against a meek Sunderland side – has brought the head coach more time.",
      "Read the full report here.",
      "Matthijs de Ligt",
      "Alert to danger throughout and never caught out of position defending his goal. Played a key role in United's second goal, challenging for the flick-on that ultimately led to it. 7",
      "Luke Shaw",
      "Kept his place on the left side of United's back three, but moved inside to a more central position at times after the break, giving United greater control on the ball. 7",
      "Amad",
      "A constant threat down the right side. Tormented Sunderland's defence and unlucky not to score in the first-half when he cut inside and saw a goal-bound effort saved. 7",
      "Casemiro",
      "Back in the starting line-up following his one-match ban, he was disciplined in midfield, although he picked up an obligatory booking late on for a poor challenge. 7",
      "Read the full ratings here.",
      "That's the final whistle at Old Trafford.",
      "Hugely important win before the October international break.",
      "Ugarte and Maguire ON.",
      "Casemiro and Shaw OFF.",
      "Mainoo has replaced Mbeumo for the final 15 minutes of the game.",
      "Casemiro fires well over the bar from the edge of the box after good work from Amad.",
      "Dorgu and Cunha ON.",
      "Dalot and Mount OFF.",
      "Amorim looks stressed on the touchline, despite his side having a two-goal advantage.",
      "Lammens looked to catch Traore as he went down in the box, but the Sunderland player is booked for diving.",
      "\"Stand up if you hate Glazers,\" is the chant currently echoing around Old Trafford.",
      "We're back under way for the seocnd half at Old Trafford.",
      "And here are your half-time ratings...",
      "Lammens",
      "Assured. 7",
      "Yoro",
      "Disciplined. 7",
      "De Ligt",
      "Alert. 7",
      "Shaw",
      "Solid. 6",
      "Amad",
      "Threatening. 7",
      "Casemiro",
      "Controlled. 7",
      "Fernandes",
      "Everywhere. 7",
      "Dalot",
      "Impressive. 7",
      "Mbeumo",
      "Dangerous. 8",
      "Sesko",
      "Deadly. 7",
      "Mount",
      "Clinical. 8",
      "That's the whistle for the break here.",
      "Mount and Sesko on the scoresheet for United.",
      "Common sense prevails and no penalty is given.",
      "VAR is checking for a Sunderland penalty.",
      "Lammens hasn't had much to do this afternoon, but he just made a good save to deny a powerful shot from Xhaka.",
      "All the talk was about Amorim's future after Brentford and this has been a great response.",
      "Amorim is wearing a full tracksuit on the touchline today and Dalot's long throw-in created the chance for Sesko to score. Tony Pulis would be proud of this proper Barclays football.",
      "Sesko makes it 2-0, reacting quickest to the loose ball following a throw-in from Dalot, which was flicked on by Sunderland’s Nordi Mukiele. Sekso showed quick reactions to turn the ball in from close range.",
      "Sesko with a second goal in the space of a week - and it's a good finish.",
      "He celebrated with a huge leap in front of the Stretford End.",
      "United have turned on the style in the first half an hour of this make or break game for Amorim and would be three or four up were it not for the brilliance of Sunderland keeper Robin Roefs in denying Mbeumo, Amad and Fernandes.",
      "But United need to turn their dominance into the hard currency of a second goal to give themselves some breathing space in terms of the scoreline.",
      "Amorim cannot believe United haven't extended their advantage. Roefs did brilliantly to deny Fernandes' effort and Amad headed the follow up wide of the post.",
      "United were 2-0 down within 20 minutes last weekend and this has already been much better.",
      "\"We heard you singing when Sergio scored,\" sing the Sunderland fans at Old Trafford.",
      "Think they probably need a new chant after all these years...",
      "Superb finish from Mount to give United the lead. Mount took down Mbeumo’s ball with a fine first touch with his left foot and then produced a clinical finish with his right to put the home side ahead. There was no emotion fron Amorim on the touchline, just a thumbs up to his coaching staff.",
      "What a brilliant goal from Mount, who finds the bottom right with an excellent finish.",
      "Mbeumo found Mount in the box but he still had plenty to do to score.",
      "Sunderland should have the ball in the net - but the move was eventually flagged offside.",
      "This is a huge chance for Sunderland to claim a win at Old Trafford, something they last did in May 2014 when Giggs was the interim manager. Sunderland's fans are in fine voice and are clearly well up for this.",
      "We're under way at Old Trafford, so follow the blog for live match updates.",
      "A minute’s silence is held at Old Trafford to pay tribute to the victims of the synagogue attack.",
      "The players are wearing black armbands today."
    ]
  },
  {
    "headline": "Benjamin Sesko's admission should excite Man United after continuing goalscoring run",
    "tags": [],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/football-news/benjamin-seskos-admission-should-excite-32615038",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "How often have we seen striker's come to Manchester United with plenty of fanfare and then fail to live up to the hype?",
      "If you are asking in recent times, too often to count. Each new addition has been brought in with the promise of being able to change United's fortunes around.",
      "Memphis Depay, Alexis Sanchez, Rasmus Hojlund were all signed to be the new main man at Old Trafford and have failed to live up to the hype. Benjamin Sesko received the same adulation when he signed for United and there was fears that the Slovenian was going to struggle with the weight of expectation.",
      "In his opening five Premier League matches he drew blanks. And while some questioned whether he was receiving adequate support from his teammates, there was a fear that Sesko was going to follow the same path as those who came before him.",
      "However, his first goal for the club at Brentford has swiftly been followed by his second against Sunderland. Now, there is a feeling of momentum behind the centre-forward and genuine hope that he can deliver where so few have.",
      "And yet, Sesko's admission following the victory over the Black Cats should leave the supporters excited to see what he can do moving forward. \"No, not yet,\" he responded to MUTV when asked if we were starting to see the best of him at United.",
      "\"There is loads [still] to come, definitely. I’m still getting used to it more and more, to read the players, to connect with them even more.",
      "\"I believe I can be even better and I will try to show it.\" This admission should excite fans as few can argue that Sesko, when given the opportunity, hasn't looked like an improvement on last season's options at centre-forward.",
      "If there is more to come from Sesko, United fans have every right to feel optimistic. A more consistent goal threat will be just the tonic for Ruben Amorim as he looks to change the Reds' fortunes.",
      "Sky will show at least 215 live Premier League games this season, an increase of up to 100 more.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "More gym sessions and no complaining - behind Casemiro's revival at Manchester United",
    "tags": [
      "Man Utd",
      "Casemiro"
    ],
    "link": "https://www.manchestereveningnews.co.uk/sport/football/more-gym-sessions-no-complaining-31559509",
    "image": null,
    "date": null,
    "source": "manchestereveningnews",
    "body": [
      "Casemiro made a beeline for Ruud van Nistelrooy in the Old Trafford tunnel on his return with Leicester City in February.",
      "Van Nistelrooy, a fluent Spanish speaker, was the conduit between Casemiro and Erik ten Hag after his Portuguese-speaking assistant Mitchell van der Gaag left. Van Nistelrooy started Casemiro in all four of his matches as caretaker manager. Casemiro lingered as Van Nistelrooy spoke, as attached to him as a comfort blanket.",
      "At that time, Casemiro had not started for United in 39 days. He did not get a kick between December 30, the night of the Newcastle United debacle, and January 30. He emerged on 70 minutes in Bucharest with United 2-0 up. The transfer window was still open but the chances of United shifting Casemiro were, like the Trinity test igniting the atmosphere, near zero.",
      "People at United's Carrington training complex noticed Casemiro's personality never wavered during a trying first half of the season. They have always found him to be a warm presence.",
      "His transformation at United in the past two months has been as unexpected as their 3-0 triumph in Bilbao. This is the midfielder who was dropped for last year's FA Cup final and replaced by Toby Collyer with United 2-0 down to Liverpool at half-time eight months ago. Casemiro’s declaration that he was keen to see out his contract in March was framed as more bad news for the club.",
      "Casemiro used his head before Athletic lost theirs in San Mames. Returning to Spain emboldens Casemiro. In San Sebastián and Bilbao, he has reminded Spanish audiences he can still cut it nearly three years on from leaving their shores. United supporters serenaded Casemiro on Thursday night.",
      "The draw with Real Sociedad in mid-March has marked a late turning point in Casemiro's third season in Manchester. With Manuel Ugarte out injured, Ruben Amorim had little choice but to turn to the older defensive midfielder.",
      "Casemiro has since been a fixture in the United starting XI, his importance highlighted by the early withdrawal at Bournemouth last week to preserve him for Bilbao. Ugarte admitted this week he is copying him.",
      "Within a matter of months, Casemiro has gone from unsellable to undroppable. If or when United reach the Europa League final, Casemiro is a shoo-in in midfield. The 3-4-2-1 system Amorim swears by has closed the yawning gaps that developed between the defence and midfield under Ten Hag and Casemiro has the safety net of a third centre back.",
      "United have adjusted Casemiro’s running and pressing triggers. “I think he has improved a lot also,” Amorim opined. “You can see not the way he plays but the way he runs. You can see it, we have the data to show him where he worked really hard.",
      "“He is a very good example. Even Toby sometimes was playing in front of him and [that] it is hard to take for Casemiro. So it is a lesson for all the players in Manchester United.",
      "“No matter what is the past or the last month, everything can change in one moment. Then we understood that he cannot jump all the time pressing high. We need to let him understand and sometimes it is better to put three defenders and let him be the fourth defender and put the wing-backs pressing high. These are all things we are understanding and trying to cope with all the criticisms of the team. But the credit is for Casemiro.”",
      "Amorim has been impressed by how hard Casemiro has worked to meet his demands to regain his place in the team. He noticed that he never complained during those winter weeks warming the bench.",
      "Selflessness is a natural trait of Casemiro's. It was also his undoing this time last year. With United depleted at centre half, he dropped back and was humiliated in the 4-0 drubbing by Crystal Palace.",
      "With Kobbie Mainoo and Christian Eriksen a flimsy shield and Jonny Evans his creaking partner, Casemiro abandoned his position to engage Michael Olise, overcommitted, lost his balance and Olise scored. Six days later, he trundled out of the United third and played Arsenal winger Gabriel Martinelli onside to square for Leandro Trossard’s tap-in. Sofyan Amrabat was ushered back in from the cold and played his way into the FA Cup final XI.",
      "Jamie Carragher urged Casemiro to “leave the football before the football leaves you”. Casemiro had been pencilled in to flank Amorim for pre-match press duties against Athletic and he would be a worthy choice at Carrington next week. He is a positive story again and one of the squad’s figureheads. United view Casemiro as a quiet leader, mind.",
      "The 33-year-old shared Raphael Varane’s view that a “disconnect” had developed between the players and Ten Hag. It is not a coincidence that Casemiro scored two goals in the first game after Ten Hag was finally sacked. He was committed enough to claim the last goal of the Ten Hag era at West Ham.",
      "When Casemiro discussed the possibility of joining United, he wanted to know three things: where he would live, where he would train and where the stadium was. During FaceTime conversations, he requested to see the club’s gymnasium at Carrington.",
      "United sources have been struck by how leaner Casemiro is this season. People in Madrid said Casemiro used to be in the club's Valdebebas gym at 8am and he often has gym sessions before and after training at Carrington.",
      "Casemiro has struck up a close rapport with some of the masseurs and his English is now a very good level of conversational. He understood our questions in the mixed zone two years ago, when his handshake grip was as tight as a vice. Casemiro's wife, Anna, and children Sara and Caio, are happy in Manchester amid the prospect of a fourth year in England's north west.",
      "Staff at Carrington regard Casemiro as one of the most respectful players they have encountered and that he is strident in protecting the club's image. Sir Jim Ratcliffe dubbed Casemiro as \"overpaid\" and \"not good enough\" in March. Three days later, Casemiro trumped his first-leg performance against Sociedad in the 4-1 win at Old Trafford.",
      "His steep decline over 18 months - dropped for Amrabat, substituted for Collyer, omitted from the Brazil squad - makes Casemiro’s revival so singular. If United win the Europa League it would be churlish to argue someone who has won three trophies in three seasons has been an unsuccessful signing.",
      "Casemiro drove United to a successful 2022-23 season. Without him, they would not have qualified for the Champions League. Ten Hag dubbed him the “cement between the stones”, essentially the glue in the team. Casemiro was central to the Latino rebranding of the United defence that kept the most clean sheets in the Premier League.",
      "Casemiro has returned to that level of influence he wielded in his first season. In Europe, at least. The concern if United do not triumph in Bilbao again this month is Casemiro could be redundant in a campaign devoid of Champions League midweeks. His recent domestic form has been inoffensive but not stellar and United need a young and dynamic new central midfielder in the summer.",
      "The senior figures made the difference in Bilbao, though. Casemiro and Bruno Fernandes, two 30-something Portuguese speakers, are naturally close.",
      "“We've got a lot of senior players who need to step up in their moments,” Harry Maguire explained. “I think Case was brilliant tonight. Bruno as well. So we have senior players who need to handle these moments really well.”",
      "Van Nistelrooy, a champion of Casemiro’s, merits credit for that.",
      "At  Reach and across our entities  we and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in our Privacy Notice and Privacy Notice."
    ]
  },
  {
    "headline": "Man Utd: Romano reveals 2026 transfer has ‘99%’ chance of being completed as INEOS ‘in agreement’",
    "tags": [
      "Man Utd",
      "INEOS"
    ],
    "link": "https://www.football365.com/news/man-utd-romano-2026-transfer-99-done-ineos-agreement-another-deal",
    "image": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd2x51gyc4ptf2q.cloudfront.net%2Fcontent%2Fuploads%2F2025%2F06%2F19075137%2F2T664FR-2-1320x742.jpg",
    "date": "2025-10-14 18:38:16",
    "source": "football365",
    "body": [
      "According to reports, one Manchester United transfer is very likely to be completed, while INEOS are ‘in agreement’ over another deal.",
      "Unsurprisingly, Man Utd have been very active in the transfer market in recent months as there was a major squad overhaul in the summer.",
      "This was required after United endured a nightmare season in 2024/25, failing to win a trophy and finishing 15th in the Premier League.",
      "Co-owner Sir Jim Ratcliffe and his recruitment team sanctioned a huge rebuild to make United’s squad better equipped to cope with Ruben Amorim’s 3-4-3 formation, though it remains to be seen whether this has worked as some problems from last year are still troubling the Red Devils.",
      "Still, Man Utd did at least offload plenty of deadwood, with Rasmus Hojlund, Marcus Rashford, Jadon Sancho, Alejandro Garnacho and Antony securing moves elsewhere.",
      "Hojlund’s form fell off a cliff after he enjoyed a decent debut season at Old Trafford, as he struggled to do the basics and looked devoid of all confidence. He and Joshua Zirkzee only scored seven Premier League goals between them.",
      "READ: Congratulations to Matheus Cunha on being the next Manchester United player to thrive elsewhere",
      "In the summer, Hojlund was deemed surplus to requirements following Benjamin Sesko’s move to Man Utd, who decided to sanction his loan move to Serie A giants Napoli.",
      "Like many others, Hojlund has returned to form away from Man Utd, scoring four goals in six games for Napoli. He also has five goal involvements in four games for Denmark in their World Cup qualifiers.",
      "Hojlund’s loan move to Napoli included an option to buy for around £38m and transfer expert Fabrizio Romano has revealed that there is a “99 per cent chance” that Antonio Conte’s side will sign him permanently next year.",
      "It has also been suggested that Harry Maguire could leave Man Utd next year as he has been a bit-part player this season and is in the final year of his contract.",
      "However, Football Insider are reporting that Man Utd are keen to retain Maguire, while the centre-back wants to remain at Old Trafford.",
      "So with the two sides ‘in agreement’ over his future, it is noted that he is likely to pen a new deal.",
      "The report claims:",
      "‘There have been claims that Maguire will leave Man United at the conclusion of his current contract due to a lack of game time. However, sources say that there is a willingness from both the club and the player to agree a new deal.",
      "‘Maguire is part of Amorim’s leadership group at Old Trafford, and the Red Devils still feel that he can offer something going forward.’",
      "Former Manchester United star Antony has once again spoken out on his exit from the Premier League giants and has revealed a “scary” situation.",
      "There have been plenty of indications but the straw that breaks the Manchester United camel back is here.",
      "Rasmus Hojlund has aimed a comically brutal dig at Man Utd when revealing the key to his resurgence following a summer move to Napoli.",
      "Man Utd are ‘in discussions’ with Maguire’s representatives over a contract extension, but Ronaldo could yet throw a spanner in the works.",
      "Napoli will almost certainly complete the signing of Man Utd striker Rasmus Hojlund on a permanent deal next summer, according to Fabrizio Romano.",
      "According to Fabrizio Romano, something “crazy” needed to happen for Manchester United to sack head coach Ruben Amorim after the Sunderland game."
    ]
  },
  {
    "headline": "Man Utd: Rashford given ‘massive boost’ as ‘decision’ on ‘controversial’ January transfer surfaces",
    "tags": [
      "Man Utd",
      "Rashford"
    ],
    "link": "https://www.football365.com/news/man-utd-new-rashford-massive-boost-key-ineos-decision-controversial-departure",
    "image": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd2x51gyc4ptf2q.cloudfront.net%2Fcontent%2Fuploads%2F2025%2F09%2F19093516%2FF365-One-Badge-Marcus-Rashford-Manchester-United-7-638x358.jpg",
    "date": "2025-10-14 15:51:48",
    "source": "football365",
    "body": [
      "According to reports, Marcus Rashford’s hopes of joining FC Barcelona from Manchester United permanently have been given a new ‘massive boost’.",
      "Rashford secured a dream move to Barcelona in the summer, joining the Spanish giants from Man Utd on loan with an option to buy for around £30m.",
      "The England international decided at the end of 2024 that he wanted to leave Man Utd in January and had to settle for a move to Aston Villa.",
      "Rashford’s poor form over 18 months and his huge salary reduced his chances of signing for Barcelona or another European giant, but Aston Villa took a punt on the forward after selling Jhon Duran to Saudi Pro League side Al-Nassr.",
      "READ: Rashford’s 15-word Man Utd jibe explains Ratcliffe stance on Amorim sack",
      "This risk paid off as Rashford grabbed four goals and six assists in his 17 appearances for Aston Villa, and his impressive return to form caught the attention of Barcelona.",
      "In the summer, Hansi Flick’s side sanctioned a move for Rashford, who has three goals and five assists in his first ten appearances for Barcelona.",
      "Based on current form, Barcelona could get themselves a bargain with Rashford in 2026, and a permanent transfer looks likely, with a new report from Football Insider claiming that the ‘chances of an agreement’ with the two clubs have ‘just improved’.",
      "Rashford’s supposed ‘massive boost’ is the imminent departure of striker Robert Lewandowski, who will leave Barcelona upon the expiry of his current contract in 2026.",
      "The report claims:",
      "‘Sources say that while Lewandowski’s potential exit has no direct impact on Rashford’s permanent switch to Barcelona, it could free up wages for the Spanish giants to get a deal over the line.’",
      "It has also been suggested that Kobbie Mainoo could leave Man Utd as he has only been a bit-part player under head coach Ruben Amorim.",
      "In the summer, Man Utd rejected his request to leave on loan as they are short on options in midfield, but he is still struggling to cement himself as a regular starter for his boyhood club.",
      "With that, Mainoo remains linked with a potential exit ahead of January as Serie A giants Napoli are interested, though a report from journalist Dean Jones for our pals at TEAMtalk claims Man Utd have already made a ‘decision on his controversial departure’.",
      "Their fresh verdict is said to be that they ‘once again expected to block Mainoo from leaving the club in January, if he seeks a move’.",
      "The report claims:",
      "‘[His] situation has led to a host of clubs keeping an eye on his situation, including many of Man Utd’s rivals in the Premier League.",
      "‘However, they could be forced to wait until the end of the season for the door to open as the current expectation is that United will not entertain a move in January.’",
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol.",
      "In 15 damning words, Rashford summed up his struggles at Man Utd and why Sir Jim Ratcliffe hasn’t already sacked Ruben Amorim.",
      "According to reports, FC Barcelona ‘will trigger’ their option to sign Marcus Rashford permanently from Manchester United next summer.",
      "Man Utd midfielder Kobbie Mainoo will only be allowed to leave Old Trafford on loan in the January transfer window, according to reports.",
      "According to reports, Manchester United have already decided whether to give FC Barcelona loanee Marcus Rashford a ‘surprise lifetime’.",
      "According to reports, Manchester United have reportedly ‘submitted an offer’ to sign a Barcelona star after learning a key ‘demand’ for this transfer."
    ]
  },
  {
    "headline": "Amorim ‘demands’ Man Utd make ‘low risk’ January signing with Euro giants ‘open’ to transfer",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.football365.com/news/amorim-demands-man-utd-make-low-risk-january-signing-with-euro-giants-open-to-transfer",
    "image": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd2x51gyc4ptf2q.cloudfront.net%2Fcontent%2Fuploads%2F2025%2F09%2F26154247%2FF365-One-Badge-Ruben-Amorim-Manchester-United-638x358.jpg",
    "date": "2025-10-14 13:48:51",
    "source": "football365",
    "body": [
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "The Red Devils have once again shown their inconsistency so far this season with three wins, three defeats and a draw from their opening seven Premier League matches.",
      "Amorim has now taken just 37 points from 34 Premier League matches and pressure on his job is currently only one defeat away for the Man Utd head coach.",
      "The last time Man Utd won in the Premier League at Anfield was January 17, 2016, when Wayne Rooney scored the only goal of the game in a 1-0 victory – but Amorim is hoping to get a result to keep the board off his back.",
      "If Amorim does last until the January transfer window, which Man Utd co-owner Sir Jim Ratcliffe seems sure of, then Spanish website Fichajes claims that the Portuguese head coach has ‘demanded’ one signing from the Red Devils hierarchy.",
      "READ: Man Utd legends ‘approached’ by UAE-based consortium as Glazers set out terms for deal",
      "Amorim is ‘clear about the signings the Red Devils need for the winter transfer market’ and Inter Milan left-back Dimarco has ’emerged as a priority target’ for the Man Utd manager.",
      "The Italy international is ‘an attractive player for clubs looking for quality, experience, and a low risk of controversial transfers’ and Amorim ‘believes the player would fit perfectly into his preferred setup, especially in a two-wing back system, where Dimarco’s attacking talent is invaluable’.",
      "Inter Milan ‘would be open to negotiating his departure in January if a suitable offer comes in, given that Dimarco doesn’t always figure into the club’s current manager’s plans’.",
      "The report adds: ‘Inter Milan is not slacking off. The club has noted the player’s excellent start to the season, which has prompted negotiations for a new contract.",
      "‘However, the possibility of Federico Dimarco being transferred to Manchester United has complicated the situation. Staying at Inter would mean contract improvements, salary adjustments, and the certainty that he will remain a key player, something the player seems to be demanding.’",
      "Kobbie Mainoo is one player who could leave Old Trafford in the winter transfer window with Amorim not affording him a Premier League start this season.",
      "The Man Utd midfielder could leave Old Trafford on loan in January unless his playing time ramps up in the next couple of months.",
      "Giving an update on Mainoo’s situation, transfer expert Fabrizio Romano said on his YouTube channel: “For sure, the situation will be assessed again in the next months. At the moment, Kobbie is not creating any problem.",
      "“Training at his best, trying his best for Man Utd. But he’s still not a regular starter. Kobbie wants to play, that’s not changed since August. In August, Man Utd said no, you stay here, no chance even for a loan.",
      "“Kobbie only wanted a loan, never a permanent transfer. In January, we will see, because it’s still October. If we arrived to November, end of December, and Kobbie is still not playing on a regular basis, the Kobbie Mainoo situation could become a story to follow again in the January transfer window.”",
      "MAILBOX: Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol.",
      "Gary Neville has been put forward as a potential replacement for Ruben Amorim as Man Utd captain Bruno Fernandes was ‘consulted’ over the current situation.",
      "Ruben Amorim ought to be a sack race shoo-in but Man Utd’s thriftiness and the worst start to a Forest reign in a century keeps him in Ange Postecoglou’s slipstream."
    ]
  },
  {
    "headline": "Congratulations to Matheus Cunha on being the next Manchester United player to thrive elsewhere",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/congratulations-to-matheus-cunha-on-being-the-next-manchester-united-player-to-thrive-elsewhere",
    "image": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd2x51gyc4ptf2q.cloudfront.net%2Fcontent%2Fuploads%2F2025%2F10%2F14124956%2FMatheus-Cunha-638x358.jpg",
    "date": "2025-10-14 13:02:59",
    "source": "football365",
    "body": [
      "There’s nothing quite like an international break when it comes to Premier League players giving revealing interviews.",
      "Matheus Cunha has become the latest to wait until he is back home to say how he really feels, falling into the Romelu Lukaku trap of forgetting that translators exist so every word he says will be picked up and analysed back on British shores.",
      "While on international duty, Cunha gave a sit-down interview with Globo Esporte, one of his home country’s biggest sports programmes. In a 15-minute conversation, the Brazilian spoke of playing for his national team, of his new manager Carlo Ancelotti and of course Manchester United.",
      "It’s not quite Cristiano Ronaldo levels of s**ting on your own doorstep but Cunha was perhaps a little more revealing than he meant to be. After two months, Cunha admitted he felt like he had been at United for a lot longer because “of the club’s current situation”. He spoke of the pressure he felt to start getting results as quickly as possible because he is “a big signing”. At one point he even referred to himself in the third person.",
      "Cunha’s interview revealed that the catastrophic aura surrounding the club from fans and pundits is seeping through to the players. If Fergie’s United used to give players an air of invincibility, Amorim – and those who came before him – seem to instill a sense of crisis.",
      "With one billion fans across the world, the biggest challenge for any player moving to United is the weight of expectation and the pressure that comes with that. Usually a manager’s job would be to protect players but when he himself is facing daily questions about his tenure, it is understandable that the players get caught in the crossfire.",
      "MORE ON UNITED ON F365\n👉 Man Utd ‘lurk’ for winter Bellingham move with Dortmund drama to get ‘more explosive’\n👉 Man Utd told ‘lazy’ player will cost them against Liverpool unless Slot does one thing\n👉 Man Utd legends ‘approached’ by UAE-based consortium as Glazers set out terms for deal",
      "That environment is hardly conducive to success and there is a growing list of players who leave and begin playing like they aren’t carrying an Indiana Jones-style boulder on their back. Scott McTominay has become a deity in Naples. Antony looked a lot more like an £86million footballer at Betis than he did at United. Marcus Rashford seems to have remembered that football can be quite fun and not a massive burden now that he is in Barcelona. Even Rasmus Hojlund looks like a striker.",
      "Joining United has become one of the smarter career moves if only for the immediate boost you get on exit and it is easy to see a scenario where Cunha becomes another example,",
      "The Brazilian is undoubtedly talented and undeniably kept Wolves in the Premier League last season, but he has been signed to a system where he has no obvious place.",
      "At Wolves, the team was built around him, allowing him to line up on the team sheet as a centre-forward but not really play like one. In Amorim’s 3-4-2-1, there is no obvious space to do that.",
      "The Portuguese boss is not the first manager to fall in love with Mason Mount, which means his starting spot is pretty much locked down. Benjamin Sesko has scored twice since he started leading the line and Bryan Mbeumo is more suited to a wide-right role than Cunha.",
      "Cunha may well be a £62.5million signing that has no obvious place in the team. The player himself commented on this, bringing up his youth spell as a midfielder before 4-3-3 took over the game and he suddenly had to become a number nine.",
      "“I came to the national team with this stereotype of a number 9 shirt,” Cunha said.",
      "“I played my entire base as a midfielder, and when I became a professional, I encountered the world of 4-3-3. You have to adapt: either play centre-forward, winger, or ‘eight’.",
      "“They eliminated the midfielder position, and you have to adapt.",
      "“But I see it positively, as it has given me experience, many more positions, and even more so in short-term tournaments with the national team.",
      "“Having a versatile player is a huge help for any coach.”",
      "While it’s true that versatility is a positive trait, it can also make it hard to nail down a position. Amorim began the season with Cunha as the centre forward but pulled him deeper after the signing of Sesko, and there is every chance that for United’s next game away at Liverpool, Cunha is again on the bench as he was for the win over Sunderland.",
      "Cunha started up front for Brazil in the first game of this international break and although he did not score, he did provide an assist. After his time with Brazil is over, he heads back to the doom and gloom of United and if it feels like a long time after two months, just imagine how long it will feel come the end of a most likely underwhelming season.",
      "READ NEXT: Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
      "",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "While not everyone can be Nottingham Forest, there are still plenty of Premier League clubs with cause to regret and rue how certain things have gone down.",
      "Are Manchester United up for sale? Why did the Saudi General Entertainment Authority chairman get involved? What do the Glazers and Sir Jim Ratcliffe think?"
    ]
  },
  {
    "headline": "Man Utd told ‘lazy’ player will cost them against Liverpool unless Slot does one thing",
    "tags": [
      "Man Utd",
      "LIVE"
    ],
    "link": "https://www.football365.com/news/man-utd-lazy-shaw-cost-them-liverpool-slot-one-change",
    "image": "https://images.ps-aws.com/c?url=https%3A%2F%2Fd2x51gyc4ptf2q.cloudfront.net%2Fcontent%2Fuploads%2F2025%2F10%2F04110116%2FRuben-Amorim-F365-638x358.jpg",
    "date": "2025-10-14 12:25:30",
    "source": "football365",
    "body": [
      "Former Man Utd defender Paul Parker reckons defender Luke Shaw is likely to cost the Red Devils when they face Liverpool at the weekend.",
      "The Red Devils got an important 2-0 win over Sunderland before the international break with some claims that Ruben Amorim could have been sacked if he’d suffered a heavy loss against the Black Cats.",
      "But Man Utd boss Amorim couldn’t have been given a tougher test than an away match at Anfield in their first game back after the international break, despite Liverpool going through a run of three straight defeats.",
      "Man Utd are currently tenth in the Premier League but a defeat against Liverpool would send them back into the bottom half and raise questions again about Amorim’s future at Old Trafford.",
      "And Parker has warned Amorim that playing Shaw up against Mohamed Salah could be a recipe for disaster against the defending Premier League champions.",
      "Parker told The Devils’ Advocate podcast: “You look at the teams they have played against and they can’t handle pace and energy levels.",
      "READ: Man Utd legends ‘approached’ by UAE-based consortium as Glazers set out terms for deal",
      "“If Liverpool play in front of them, it will be great but I don’t think they will. I think they will try and turn them around, especially on the left side with Luke Shaw.",
      "“Salah is going to be looking to run in behind with and without the ball, knowing the laziness of Luke Shaw, who he will be pulling at his shirt all the time and little things like that.”",
      "Parker continued: “They haven’t got the discipline, trustworthy people to play for what the manager wants to do.",
      "“You can moan and moan about his system, but at the end of the day, they want to use this word elite about these players of today, which is absolutely rubbish to be perfectly honest, but if they were that elite, they would be clever enough to go bang and do it.”",
      "Earlier this season, Man Utd legend Roy Keane accused Shaw of “throwing in the towel” in their 3-0 Manchester Derby defeat to Man City.",
      "In response, Shaw said: “People have opinions and I think sometimes you just have to take it on the chin. He’s got a lot of experience. He was one of the best captains ever for United. Of course it hurts.",
      "“But, for me, I think criticism is part of being a football player. I listen to it. But I think he was right. I think that last week, I wasn’t at my level at all.",
      "“I don’t need Roy Keane to tell me. I think after the game, I knew that but of course it hurts. The most important thing is knowing how good I can be. The manager knows that.",
      "“I think the managers who I played with in the past know that. I’m always in the team and I’m always playing, so there must be something that the managers believe in.",
      "“I’m not getting any younger now and I need to be consistent. I’ve had a lot of ups and downs, but for me now, it’s about keeping that consistency at a high level, because I know I can do that.",
      "“That’s why last weekend hurt me a lot, because that’s not my level. And I think the criticism is what people understand. But like I said, I take it on the chin and listen to it and move on.”",
      "MAILBOX: Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
      "Manchester United legend Rio Ferdinand has made a prediction relating to Luke Shaw after the England international was heavily criticised by Roy Keane.",
      "Former Man Utd defender Paul Parker is still fuming that the Red Devils allowed David de Gea to leave Old Trafford on a free transfer.",
      "Man Utd legend Roy Keane has claimed that Luke Shaw “has been getting away with murder for years” after their 3-0 defeat to Man City.",
      "Former Manchester United defender Paul Parker has painted a bleak outlook for manager Ruben Amorim, as he has warned the Portuguese manager could be just a few games away from ...",
      "Andre Onana has received a damning verdict from former Manchester United defender Paul Parker after he was a “disaster” at Old Trafford.",
      "According to reports, one Manchester United star is ‘fuming’ at head coach Ruben Amorim and is refusing to ‘push himself 100%’ for one reason."
    ]
  },
  {
    "headline": "Man Utd ‘lurk’ for winter Bellingham move with Dortmund drama to get ‘more explosive’",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/man-utd-lurk-amorim-fan-bellingham-dortmund-more-explosive",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 10:54:47",
    "source": "football365",
    "body": [
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Bellingham, who is the brother of Real Madrid superstar Jude, has struggled to make the desired impact at Dortmund following a £27m summer transfer from Sunderland.",
      "The 20-year-old has only started two Bundesliga matches for Dortmund so far this season with Bellingham being taken off at half-time in one of those fixtures against St Pauli.",
      "His father, Mark Bellingham, went to speak to Dortmund sporting director Sebastian Kehl in the tunnel at half-time to get an explanation for his son’s withdrawal in a match they were leading 1-0.",
      "England legend Sir Geoff Hurst called Bellingham’s dad’s actions “an absolute disgrace” and warned that he must change his behaviour.",
      "Dortmund managing director Lars Ricken attempted to play down the incident but hinted that a similar thing will not happen again.",
      "READ: Man Utd legends ‘approached’ by UAE-based consortium as Glazers set out terms for deal",
      "Ricken told Sky90 – The Football Debate: “We got Jobe Bellingham because we really built a relationship of trust with the parents over the years. Now the family flew in especially for their son’s first Bundesliga game and wanted to meet Jobe after the game.",
      "“They stood in the hallway to the locker room and had an emotional conversation with Sebastian, which, however, is not a problem at all given this relationship.",
      "“In the future though, we will ensure that players, coaches, and any officials have access to the locker room area, so that we no longer get into trouble by commenting on such news.",
      "“But today everything has been resolved – no drama.”",
      "And now there are rumours that both Bellingham and Dortmund could be seeking to move on from their new relationship after only a few months.",
      "German newspaper Bild claim that Man Utd and Crystal Palace are ‘lurking’ for Bellingham ahead of a potential move in the winter transfer market.",
      "Other reports have insisted that Bellingham is ‘increasingly frustrated with his limited playing time’ but Bild claim he is ‘not wasting any thought on this scenario (currently) and continue to see the younger brother of superstar Jude (23/Real Madrid) as a future asset.’",
      "‘The report adds: ‘United’s coach Rúben Amorim (40) is said to be a fan of the “Mini-Bellingham” because his physical robustness and playing style would fit perfectly into his system.",
      "‘Should [Niko] Kovac remain true to his performance principle and allow the previously rather weak Jobe to continue to stew on the bench, this vexed topic will certainly become even more explosive in the coming weeks before the winter break.’",
      "TBR Football journalist Graeme Bailey also has an update on the Man Utd-linked star’s situation, he claims: “Dortmund do not see Bellingham as having a struggle to this point, they are second in the league, he is contributing, and their head coach Niko Kovac has no issue with the player.",
      "“He is being used, he has featured a number of times, and they do point to the fact that this is a player that has never played top-flight football before this season.",
      "“Dortmund invested good money into this young player, and they are not currently thinking about parting ways, they are happy with how things are going thus far.”",
      "MAILBOX: Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol.",
      "Gary Neville has been put forward as a potential replacement for Ruben Amorim as Man Utd captain Bruno Fernandes was ‘consulted’ over the current situation.",
      "England legend Sir Geoff Hurst has slammed the behaviour of Mark Bellingham after he complained about his son, Jobe, being substituted for Dortmund."
    ]
  },
  {
    "headline": "Man Utd legends ‘approached’ by UAE-based consortium as Glazers set out terms for deal",
    "tags": [
      "Man Utd",
      "Glazer"
    ],
    "link": "https://www.football365.com/news/man-utd-takeover-legends-approach-uae-consortium-glazers-set-terms",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 08:56:18",
    "source": "football365",
    "body": [
      "Some Man Utd legends have been ‘approached’ by a UAE-based consortium looking to buy the club from the Glazers, according to reports.",
      "Saudi Arabian boxing promoter Turki Alalshikh caused a stir amongst Man Utd fans on social media last week when he claimed a potential takeover was at an ‘advanced stage’.",
      "Alalshikh wrote on X: ‘The best news I heard today is that Manchester United is now in an advanced stage of completing a deal to sell to a new investor – I hope he’s better than the previous owners.’",
      "That led to rumours that Alalshikh himself and other Saudi Arabian tycoons were the mystery party looking to buy the Premier League giants.",
      "But clarifying his earlier message, the Saudi confirmed: ‘My yesterday’s post about Manchester United’s potential sale meant one thing: the club is in an advanced negotiation phase with a new investor.",
      "‘Just to clarify, I am not the investor, nor are they from my nation. I’m posting this as a fan who wishes the deal to happen, though it might not necessarily happen.’",
      "READ: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "It was confirmed on Monday that the potential investors are a UAE-based consortium who are ‘very serious’ about buying Man Utd from the Glazers.",
      "And confirming interest from the UAE, Ben Jacobs and Alex Crook wrote on talkSPORT that the Glazers ‘still value Manchester United in excess of £5billion amid rumours of a potential Middle Eastern takeover’.",
      "The report adds: ‘The group Alalshikh referenced is believed to be UAE-based and talkSPORT has been told several United legends have been approached about potentially investing.",
      "‘The Glazers have already sold a minority stake to Sir Jim Ratcliffe’s INEOS group, but there is a clause in that deal meaning Ratcliffe would be forced to sell his shares or match any offer the American family accept from interested parties. ‘",
      "When asked about Alalshikh’s claim that a takeover could be close, football finance expert Stefan Borson told Football Insider: “I think it’s pretty unlikely, to be honest with you.",
      "“For there to be a serious process running in the background right now at a valuation that is attractive seems to me to be pretty unlikely. It’s not impossible, but it’s pretty unlikely. I mean, he is a well-connected guy.",
      "“But look, in football there’s a lot of rumours, counter rumours and things people hear that are just not right. There’s a lot of people sort of spouting nonsense, and you have to sort of sensor check with logic. I think it’s unlikely, but I might be embarrassed by that view very quickly.”",
      "Borson added: “It just seems to me that it would be quite odd timing, and given how thorough the process was before that didn’t flush out this kind of proposal, why now when things are worse would somebody be prepared to pay more?",
      "“It’s a harder deal to do now than it was two years ago, so why would that make sense now? The economic picture is not as good. They’ve got the stadium situation. You’ve got Jim Ratcliffe in the way.",
      "“The team on the pitch is not better. There’s clearly a huge investment required. They’ve got more competition.",
      "“They’ve got other businesses that you could buy. Spurs, for example, or certainly part of Spurs. It doesn’t make any sense to me, but as I say, maybe in the next few days I’ll be proven wrong. I think it’s unlikely.”",
      "MAILBOX: Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Are Manchester United up for sale? Why did the Saudi General Entertainment Authority chairman get involved? What do the Glazers and Sir Jim Ratcliffe think?",
      "Man Utd officials are holding a ‘meeting’ today with a UAE-based consortium who are ‘very serious’ about buying the club, according to reports.",
      "It could be in the Glazer family’s interest to sell Man Utd ‘before February 2027’ amid takeover rumours, according to reports.",
      "Man Utd co-owner Sir Jim Ratcliffe could be “forced” to sack Ruben Amorim over results despite his claim that he’s ready to give him three years.",
      "Man Utd boss Ruben Amorim will not be sacked yet but there are reportedly still dissenting voices who want the Red Devils to talk to other managers."
    ]
  },
  {
    "headline": "Why Man Utd cannot thrive with ‘poor coach’ Ruben Amorim formation",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.football365.com/news/man-utd-thrive-poor-coach-ruben-amorim-formation-mailbox",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 08:14:50",
    "source": "football365",
    "body": [
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "But mostly the Mailbox is intent on telling us how terrible Football365 is.",
      "Maybe watch England tonight (yes, really) and send your thoughts to theeeditor@football365.com",
      "",
      "Well that’s me told, I guess IATA. Long suspected as much.\nAidan, Lfc (in response to Mark, mate turned up 5 mins after kick off and wife 25, I stood until guy left at half time)",
      "",
      "As a riposte to Ian, and a counterpoint for you George, no, 3-4-3/5-3-2 won’t be a good (or really great, which should be the target) formation for United, unless you have a very limited view of what you want United to be able to do.",
      "There’s countless good videos and articles on this (Athletic, Coaches Voice etc) but with an oversimplification, any formation that emphasises 3 at the back and two wingbacks is really a better out-of-possession than in-possession style team. If you want your team to be a smart counter-puncher prioritising quick turnovers and attacks, then it can be good, if you tailor your squad to that specific tactic. Oliver Glasner’s Crystal Palace are the best current incarnation of this.",
      "What this formation doesn’t give you however is an abundance of on-ball creation/high possession – in effect you sacrifice some midfield creativity to get that extra CB in, and in many cases, you now rely on your WBs to either provide the crucial width, or sometimes be the ones popping up in the half spaces in front of the boxes. Now they could be quite creative in their own right (Frimpong at Bayer) but they’re still not true attacking players, so when facing a set defence, they’re unlikely to offer the attacking threat of a dedicated winger/forward – they need to be in a mismatch situation.",
      "There are two notable exceptions – Conte’s Chelsea and Alonso’s Bayer – but both of those were a) one off seasons exploiting unique situations and b) successfully countered by the following season/underwent serious regression.",
      "Assuming you want United to dominate in a similar vein to the most successful teams of the last 30 years in the PL, you want to be consistently controlling possession, having the best attacking talent getting space in dangerous areas and generating high value chances whilst limiting them at the back. Even with the slight shift towards increased verticality in the PL this season, the better teams are clearly still prioritising controlling the midfield with men and quality.",
      "Now, clearly if you have flexibility within your formation (ultimately what made Alonso’s Bayer work was the sheer unpredictability of where any given player would be with their great passing interchanges) that can overcome some of these problems, but what makes Amorim such a poor coach (at this point) is both his formational AND tactical rigidity – he doesn’t just play the same structure, but within that structure plays the same way, making him exceptionally predictable.",
      "There are other elements (smaller pool of specialists that excel at these formations means less talent at a higher price point available to purchase) which IMO prevent 3-4-3 from establishing itself fully, but yeah in essence, more good attacking players having the ball often, and in better areas really should be United’s modus operandi, and 3-4-3 ain’t that.\nTom (also, Ian, that Liverpool team were… not that good) Leyton",
      "READ: Bruno Fernandes still the most creative player in the Premier League",
      "",
      "Lads, you need to stop being so delicate. When I was remarking on the “top goal scorers for England by club” – and I’ll say this simply so you don’t misunderstand – it wasn’t a dig at your Starboy, or even Arsenal. Why would I? That total is only 5 less than Rashford had scored by the same age. It’s very solid!",
      "Truth is, Arsenal were pretty much inconsequential to the point; the prompt not the subject.",
      "More apropos, I remain amazed that Liverpool didn’t have a higher scoring top scorer considering their 80s dominance but I guess too many Scots and Welsh. And while United have a couple of good entries, really Rooney is an Everton success (we didn’t make him great, just gave him the platform), just as Sterling was at City and Lampard at Chelsea.",
      "One commenter at least grasped the point, and he was right that we play more games – (generally, thanks to additional money making tournaments) and specifically against relatively weaker opponents – and get further in competitions compared to the past.",
      "As an aside, I really wish I’d been alive to see Dixie Dean; man must have been a beast! 18 in 16 internationals, and 349 in 399 in the league! That’s some crazy stuff. And, weirdly, looked like Tevez.",
      "Maybe someone can delight the mailbox with the spread for another nation, particularly France (might smooth some ruffled feathers).\nBadwolf",
      "(Poor old Cole, Fowler and Wright tbh – they all deserved better)",
      "",
      "To Steve Mills in the Monday morning mailbox.",
      "That’s all very well and good if head-to-head is the first tie-breaker. At least according to Wikipedia, it’s goal difference.",
      "So under your very valid assumptions of Denmark beating Belarus and Scotland not beating Greece by 6+, we’ll need at least a draw against Greece and then beat Denmark to qualify.\nAndy, DC",
      "",
      "Come on now, it makes sense if you loosen up a little and go with the flow. Perhaps missing the word ‘that’ at the end threw you off but – ‘More like THAT Ed’… as in, please post more entries like that of Ian HK instead of yawnfest politics from all these ideal human beings..",
      "Now, to get posted I obviously had to include a political reference, hence the relevant re-interpretation of MAGA to reference the abundance of adverts on the modern version of F365 (insert heated discussion point for a sports website and excellent click driver = posted) . Advert365, if it needs an explanation, because there are literally more ads now than illegal streaming websites on this once hallowed site and advert365 has a better ring than politicalopinion365.",
      "Before you say pay, the quality of journalism has to be worth the money and it isn’t here anymore.",
      "On to the overall topic and reason for the lols, if it was hard to tell, was the absurdity of Ian’s post, essentially – ‘Amorim should follow a manager who won fuck all 30 years ago but did give us the spice boy era’… oh yeah, and it’s obvious apparently.",
      "Like all entertaining things, the best bit is towards the end – Mount and de Ligt as DMs, Bruno taking penalty advice (90% Bruno Penandes!) from someone who didn’t really score/take many and missed a few, buy a RWB! All absurd points which would be mildly humorous if the email was satirical but it seems deadly serious. Topped off by the I-love-the-smell-of-my-own-shit, ‘it’s not that hard, we can all see it’…..*",
      "That line takes it to comedy gold territory and frankly a nice change for the mailbox.",
      "Between drowning in adverts, top 10 sack lists and 5 articles an hour that say 95% of the exact same word-for-word clickbait shit bar the last paragraph…. Ian HK finally made me crack a smile when attempting to read this site on my phone. (it’s really just muscle memory coming back to F365 at this stage but the gaps between are sadly getting bigger, RIP).",
      "SO in summary, save the website and give Ian his own dedicated column where he uses his unique approach to fix every team. He/She/Them can’t be worse than the current roster of journalists (lol).\nMoses\n(when the explanation is twice the length of the original ditty, maybe you have a point. F365 is still shit now though, bring it back!!!)",
      "*Actually it’s defensive midfielders we need and that’s what everyone can see, which ironically makes it strange why Amorim did not….and Ian sorry, I’m just using you as a vehicle to tell the editors how shit the site is these days.",
      "Shit I tells ya.",
      "",
      "In the main, the left wing leanings of f365 are a welcome reprieve from the tub-thumping ravings of The Sun, Mirror and particularly The Daily Mail. We should’ve long since outgrown much of their nationalistic guff. The best part of The Guardian’s social attitudes are worthy. A commitment to disingenuousness is the trap f365 now needs to navigate.",
      "It started life with the Neville versus The Flag commentary. I think we can all agree The Right are now in control of the Union Flag. Why? Because national pride has long-since been sneered at by The Left. And now the scramble of both own and disown the Union Flag is underway. The only way to own the flag from The Right is to invoke a sense of national pride. Not to call people Gammons. Take it back again and learn from the failed strategy of steering and snide sniping.",
      "To disagree is some of any part of either sides position does not make them a lefty looney or a gammon. I have to admit I don’t like the word gammon. To refer to someone as a pig due to the colour of their skin x their political leanings seems a bit off. Seems a bit smug. Represents those left wing traits that see it fail and see the Farages of this world fill the gap.",
      "Then on to the ‘what happens when England fans stop being bored?’ column. Firstly, have you been to college football? It’s carnage. Utter mayhem. There is excessive drinking, property damage, fisticuffs. The whole experience. It would come as no surprise to any American that bedlam pursues sporting events like lies to a columnist. None of this touched upon. Similarly, the isolation of such troubles to England fans is a wilful misrepresentation of the reality. As things stand, football trouble is rife all over the world, from the stabby streets of Rome to the riotous banlieu of Paris. Let’s not touch on South American rivalry or Eastern Europeans training in combat before games. England fans are enriched by some real scummers for home Danny Dyer is keeping the old value alive. But football games around the world, at both national and club level, is a violent affair.",
      "Maybe there is some sense of shame to seeing England fans act like hooligans has merit. I equally shudder when European games feature monkey chants, often at their own players. Maybe it’s time to step away from football altogether.",
      "All of this lack of nuance is peak Guardian who see what they want to see so long as their narrative is supported. (And if f365’s stance was equally as disingenuous to a right wing stance I’d be calling you all out on being the Fox News/Daily Mail of football sites).",
      "Providing a football narrative that is socially balanced and enriched by social values is brilliant. Keep it up. But please don’t become the Huffington Post. If you do then the message will be lost and you’ll be the fools calling half the population a ‘basket of deplorable’.",
      "Being English, as being anyone, comes with sources of baggage and pride. Let’s keep an eye on both, shall we.\nAlexander Tovey",
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams."
    ]
  },
  {
    "headline": "Doubts over Slot tenure at Liverpool used to beat Man Utd owner Ratcliffe over Amorim comments",
    "tags": [
      "Man Utd",
      "Ratcliffe",
      "Amorim",
      "LIVE"
    ],
    "link": "https://www.football365.com/news/man-utd-slot-doubt-raised-liverpool-ratcliffe-slammed-amori",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 08:13:09",
    "source": "football365",
    "body": [
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s recent comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "The Red Devils had an awful 2024/25 campaign with Amorim failing to qualify for Europe in his first season at the club after Man Utd finished 15th in the Premier League.",
      "And it’s been similar so far this term with the Red Devils show lots of inconsistent form after winning three, losing three and drawing one of their seven Premier League matches, while they were knocked out of the League Cup by League Two Grimsby Town.",
      "Amorim has picked up just 37 points from 34 Premier League matches since taking over from Erik ten Hag towards the beginning of last season.",
      "There were some rumours that a heavy defeat against Sunderland would have potentially cost Amorim his job after another shaky start to the campaign.",
      "READ: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "After that match, an interview was released in which Ratcliffe suggested that Amorim could be afforded three years to get it right at Man Utd.",
      "The Red Devils’ first game back after the international break is against defending champions Liverpool, who have lost their last three matches in all competitions, and former Reds midfielder Murphy insists Ratcliffe’s comments about Amorim’s future were “ill advised”.",
      "Murphy told BetWright: “I think Sir Jim Ratcliffe got cornered a bit and wasn’t especially well prepared for the interview where he talked about giving Ruben Amorim three years to turn things around at Manchester United. I don’t think he should have said that and it’s inevitably going to come back to bite him.",
      "“If United lose their next three or four games, the pressure from the fans will get too much and the board will have no choice but to sack Amorim.",
      "“Ratcliffe would have been better off saying that the board are backing the manager and that they’re being patient, whilst recognising that it isn’t going to be the easiest of tasks – but it would at least show that they are right behind him.",
      "“The reality is you can’t make any guarantees in football. You could argue that with Liverpool winning the league in Arne Slot’s first season at the club – you can’t make a guarantee that he will be there in three years and they’re flying.",
      "“In my opinion, it was ill advised of Ratcliffe to not have an answer prepared for each of those questions and it will probably come back to bite him in six months’ time.”",
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Some Man Utd legends have been ‘approached’ by a UAE-based consortium looking to buy the club from the Glazers, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol."
    ]
  },
  {
    "headline": "Liverpool legend claims Man Utd star has ‘been found out’ under Amorim: ‘He doesn’t do anything’",
    "tags": [
      "Man Utd",
      "Amorim",
      "LIVE"
    ],
    "link": "https://www.football365.com/news/man-utd-nicol-mainoo-found-out-amorim",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 07:35:02",
    "source": "football365",
    "body": [
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol.",
      "Man Utd don’t have any European competition to concentrate on this term and they have already been knocked out of the League Cup at the hands of League Two side Grimsby Town.",
      "Their defeat to Grimsby was Mainoo’s only start in all competitions this season with his other five appearances coming off the bench in the Premier League.",
      "Amorim frustrated the Man Utd hierarchy when he publicly admitted that Mainoo was fighting captain Bruno Fernandes for a place in the starting XI this season.",
      "Knowing that ousting Fernandes from the line-up will be virtually impossible, Mainoo requested a loan move in the final days of the summer transfer window.",
      "READ: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "Jason Wilcox persuaded the England international to stay but Mainoo is likely to seek game time in January with the 2026 World Cup around the corner.",
      "Liverpool legend Nicol reckons Mainoo has “been found out” under Amorim and the Man Utd midfielder needs to improve his defensive game.",
      "Nicol told ESPN: “In my opinion, Mainoo is great with the ball at his feet but when the opposition has the ball, he doesn’t do enough.",
      "“In fact, he doesn’t do anything. He doesn’t stop people getting at Man Utd back four. And the fact that that is one of the biggest problems United have and this guy still can’t figure it out.",
      "“I think basically he’s been found out because at the end of the day, when you play for the top clubs and you want to be challenging, your players have to contribute on both sides of the ball.",
      "“And if there is one thing Mainoo doesn’t do, it’s contribute defensively.",
      "“The fact that Casemiro is starting over him consistently tells you that there is a problem and the kid is not as good as we thought he was when he first burst onto the scene.”",
      "When asked if Amorim could help Mainoo improve those aspects of his game, Nicol added: “It’s interesting you say work with him, because it looks like the work rate on that side isn’t there.",
      "“Any coach who has a player who he thinks isn’t giving their all, when it comes to having to play one guy or another, that guy is getting shoved away.",
      "“If you’re the coach at United and you’re watching Mainoo time after time letting people run off them and looking as though you are not that bothered about it, you’re going to the bottom of the pile.”",
      "Speaking of Mainoo last month, Man Utd boss Amorim said: “Like a lot of guys, he wants to play more.",
      "“I believe a lot in Kobbie but some of you think that Kobbie Mainoo is already done. I think he can do so much better. He can improve in a lot.",
      "“And sometimes I think for some guys it’s [the level he’s playing at now] enough. For him, it’s not enough. Maybe it’s not fair but I think I’m helping Kobbie Mainoo and that’s it.",
      "“He will have opportunities like the other guys. If I feel during the week that he’s the best player to play, he’s going to play and I proved that already to every player here.",
      "“I believe a lot in him. I have the same thing [opinion] that you have and that is a top, top player, but he can be so much better, so I’m focused on that.”",
      "According to reports, Marcus Rashford’s hopes of joining FC Barcelona from Manchester United permanently have been given a new ‘massive boost’.",
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Gary Neville has been put forward as a potential replacement for Ruben Amorim as Man Utd captain Bruno Fernandes was ‘consulted’ over the current situation."
    ]
  },
  {
    "headline": "Liverpool priorities, Forest hubris and Man Utd stubbornness among top 10 f***-ups and regrets",
    "tags": [
      "Man Utd",
      "LIVE"
    ],
    "link": "https://www.football365.com/news/liverpool-priorities-forest-hubris-and-man-utd-stubbornness-among-top-10-f-ups-and-regrets",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 07:24:06",
    "source": "football365",
    "body": [
      "Nothing like an October international break in which England don’t even play a competitive game until the very last moment to leave you pondering choices. Your own, mainly, but also those of football clubs.",
      "Relentlessly silly, frequently stupid football clubs. The regrets. The f*ck-ups. Call them what you will, but here’s just 10 things Premier League clubs might now wish worked out differently.",
      "Some are entirely self-inflicted f*cktastrophes, some are unfortunate circumstance, and the rest some combination of the two.",
      "And then there’s Nottingham Forest, who are currently just some kind of insane f*ck-around-and-f*nd-out machine to the extent we’re not even sure regret has taken hold yet.",
      "",
      "There really is no other word for it. It’s the only word that adequately explains and conveys Nottingham Forest’s behaviour since about halfway through last season. This is a club that got dangerously high on the smell of their own farts and may now pay a ludicrously heavy price.",
      "They were very, very good at what they did last season under Nuno Espirito Santo. There was perhaps no other team in the league with a more clear-headed gameplan, delivered to consistent effect by a squad of players perfectly suited to the task.",
      "Even then, there were occasional glimpses. Occasional momentary lapses where Forest tried to be something different – something more? Something better? – than what had worked so well for them.",
      "There was one particular game against Newcastle, in which Forest had played their usual counter-attacking game to fine effect to lead 1-0 at half-time. Yet in the second they tried to play front-foot football that was not and is not their way and were picked off with ease by a grateful Newcastle, who ran out comfy 3-1 winners.",
      "That one match is now starting to look like a microcosm of these two seasons. The success in the first half has led them to a state of not-yet-earned giddiness and, yes, hubris.",
      "There is an arrogance for any club outside the cosseted elite to assume that their hard-won Premier League status is now entirely secure. The casual manner in which Forest allowed the Nuno situation to develop into an irreparable rift was extremely careless and far more risky than anyone from excitable owner down appeared to accept or even realise.",
      "And quite simply no Premier League team that is even dimly aware of the fact that relegation remains a theoretical possible fate would then bring Ange Postecoglou along into a season that has already begun, less still into a squad so unsuited to his wildly different methods.",
      "And no Premier League team thinking about anything but relegation is even looking at the Dyche button a few weeks later. That sound you can hear is a penny dropping far too late.",
      "A chaotic and potentially ruinous six-week misadventure that may now end with Forest right back with the sort of manager they had before, just a less good one. All while ensuring there is now absolutely no chance of Postecoglou’s undeniably entertaining nonsense ever featuring in Our League again. Cheers, lads.",
      "",
      "We’re not saying it was a bad idea to sign Alexander Isak or that he is anything other than a brilliant player. Even if someone mischievously puts that in the headline, which they might, the pricks.",
      "We’re just saying that signing Alexander Isak might not have been Liverpool’s best use of valuable time and resources as the final hours of the transfer window drained away.",
      "It is still very funny that by the time Liverpool actually got round to completing that Isak move they had already long before that signed Newcastle’s preferred replacement in Hugo Ekitike. But as more time passes, the more it looks like that joke is on Liverpool every bit as much as it was on Newcastle.",
      "Isak was the ultimate luxury signing. Not a player Liverpool needed, but one they could have. But by the time he came through the door Liverpool had already signed Ekitike and Florian Wirtz.",
      "Sure, Liverpool’s attack is stronger with Isak than without and it’s a long season with deep squads needed and all the rest.",
      "But by the time Liverpool were toing and froing to get that deal done it was far, far more necessary to perform some more prosaic but necessary remedial work in the defence.",
      "Sure, the extent of Ibrahima Konate’s struggles might have been hard to predict, but relying entirely on him and Virgil van Dijk – who is older than new Luton manager Jack Wilshere – was always a risk that didn’t need taking.",
      "Marc Guehi was right there. He was up for it, and so too were Palace until Liverpool turned such a fundamental transfer – Guehi wasn’t even a back-up, he’d have been straight in for Konate – into so much of an afterthought that Palace had no time left to get their own Guehi-less squad straight and thus pulled the plug.",
      "It is, obviously, not a straightforward either/or situation. Clubs can and obviously do work on multiple deals at once. But it’s hard to shake the notion that completing the more ostentatious and headline-grabbing deal left Liverpool with their eyes off the less exciting but more necessary prize. It’s a rare mis-step, but a potentially costly one.",
      "Guehi would be more useful and make more tangible positive difference to Liverpool right now than Isak is and does.",
      "READ: Isak, Gyokeres make red-faced return to Liverpool and Arsenal to resume Premier League flop fight",
      "",
      "Sir Jim Ratcliffe continues to paint himself into a distinctly difficult corner over his at-all-costs backing of Ruben Amorim. Maybe he’s right. Maybe it will eventually all come good. But that looks a massive odds-against gamble right now.",
      "Ratcliffe has doubled-down harder than ever with his ‘three years’ daftness, a quote that has a small chance of becoming his ‘I always win something in my second season’ and a very, very high chance of either becoming yet another point of United ridicule or further hindrance to taking a necessary step.",
      "Almost impossible now to believe that anything more than the stubborn refusal of Ratcliffe and INEOS to accept the embarrassing fact of their own error is keeping Amorim in the job, and that really is just a double victory for silliness.",
      "Just own it. Face up to it. It’s not like Forest appointing Postecoglou, is it? It’s not like sacking Erik Ten Hag and appointing Amorim was an obvious mistake literally the world could see from a mile away. Really, the only quibble people could reasonably have with appointing Amorim when United appointed one of the most impressive young coaches in Europe was why had they dallied in the summer rather than make the change then?",
      "Nobody seriously imagined the Amorim Era would be this bad. Lots of people, and we’ll put ourselves in this camp, thought it might be really quite good.",
      "But it isn’t. It’s really sh*t. And the damage in sticking with Amorim is already being done. United have already lost Marcus Rashford for what will ultimately prove to be a pittance, so in thrall are they to Amorim and not wanting to be embarrassed. They might well lose Kobbie Mainoo next.",
      "And nothing in his record at the club suggests he’s worth it. And the comparisons with Mikel Arteta’s early years at Arsenal just don’t hold water. Arteta came under serious pressure and rightly so; he could very easily have been sacked. But he never had Arsenal in anything like the dire straits that have become the new normal at too-big-to-succeed Man United.",
      "",
      "Nottingham Forest’s loss may now prove West Ham’s gain, and at the very least you’d expect Nuno Espirito Santo to get the Hammers playing halfway competent and broadly effective football that keeps them away from relegation unpleasantness.",
      "But they had that. With David Moyes. And they didn’t want that anymore, because they wanted to aim higher and dream bigger. Which is absolutely fine. For what it’s worth, we once again thought similarly. It probably was time for Moyes to move on and West Ham to see what they might be able to do with a more progressive front-foot manager.",
      "But then they appointed Julen Lopetegui, who is the Spanish David Moyes.",
      "When that didn’t work they finally took a more West Ham approach and went for Graham Potter. And then gave him absolutely nothing of what he needed in the summer.",
      "Throughout the struggles in the final weeks and months of last season, it was clear that Potter could not be fairly judged until he’d had a pre-season to get his ideas across, and ideally a few players to help make that transition.",
      "Potter himself is far from blameless. He may well not have succeeded even if given the conditions to do so. But now we’ll never know, because West Ham didn’t just fail to do what was needed during the summer; for large parts of it they didn’t even particularly seem to be trying.",
      "",
      "It may only be slightly exaggerating things to say that Leeds’ entire season on their return to the Premier League may come to be defined by the period between Daniel Farke responding to a creditable 0-0 draw against Newcastle on August 30 by asking for two new attacking players, and the window closing with Leeds bringing in no new attacking players.",
      "The frustration is two-fold. First, because Farke’s request was not unreasonable. This was not a moon-on-a-stick request. He was asking for Harry Wilson and Manor Solomon, not Lamine Yamal and Vini Jr.",
      "Two, Farke’s Leeds had already by then shown proof of concept. They had shown against both Everton and Newcastle that they were capable enough defensively of mounting a serious bid for survival, but were hampered by attacking inadequacies that had seen them manage just one goal in three games – and that a penalty.",
      "While there have been more goals since the closing of the window, with six in their most four Premier League games, three of those came at Wolves. And right now we’re inclined to consider those as roughly as irrelevant to any assessment of Leeds’ long-term survival prospects as conceding five goals at Arsenal.",
      "Leeds definitely still have a decent shot at staying up in a league that offers more opportunity to do so for a competent promoted team than at any other time in the last few years. But it really wouldn’t have taken a lot of activity in those last few days to make that decent shot a truly compelling one.",
      "",
      "We’ve already stretched the concept of ‘this season’ right back to include the entirety of the transfer window that precedes it, and that feels like it’s absolutely fair enough. The transfer window is surely part of the season that follows it far more than it is part of the season that preceded it.",
      "It is upon that following season that its influence is felt. But can we really claim things that happened in May during last season as being this season’s regrets and/or f*ck-ups.",
      "When it comes to Wolves, we’re saying yes. Yes we can. Our reasons are these.",
      "First of all, May is very much a month when cricket is played and is therefore summer. That’s just basic. Second, that very deliberate phrase we used just now about the transfer window: it is upon that following season that its influence is felt.",
      "And that’s exactly how we feel about the last four matches of Wolves’ 24/25 season. They meant absolutely nothing to 2024/25, Wolves having already secured survival with something to spare by winning six games in a row through March and April.",
      "But their influence on 25/26 already feels far more significant. Because this is very familiar Wolves territory: a bad end to one season bleeding into a bad start to the next.",
      "That winning run – albeit against three terrible relegated sides and the other three most ridiculous and feeble Premier League teams at that time in West Ham, Spurs and Man United – offered Wolves the chance to avoid that familiar end-of-season sinking feeling.",
      "They weren’t easy games in that final four, but we’re not asking for them to make that winning run 10 games or anything. Lose to Man City by all means if you really must, but even just a home win against either Brighton or Brentford would have taken Wolves into summer with some wind in their sails.",
      "It might not have been enough. The loss of key players would still have been keenly felt, but the bleak nature of their start, one that leaves them now as the only Premier League team still without a win having declined a Dr Tottenham prescription at the last moment, would have felt far less inevitably self-fulfilling.",
      "",
      "Breaking our own rules a bit here by treating Chelsea as a club where regrets and f*ck-ups are measured in the same way by the same metrics as football clubs, rather than what Chelsea now are.",
      "When correctly treated as a football player trading company, selling Noni Madueke made a fair chunk of sense. He was far from indispensable and even Arsenal’s fans didn’t particularly want him at the time.",
      "But Chelsea have often looked a weary side since their Club World Cup win and, with several attacking players currently underperforming and relying more and more on the increased goal contributions of Moises Caicedo, it might have been nice to keep Madueke around the place.",
      "And that’s before even considering the whole ‘strengthening a direct rival’ angle, one that allowed Arsenal to achieve what was previously thought impossible: suffer a minor Bukayo Saka injury setback without doom-laden proclamations about the sky falling in from long-suffering fans of the only club to ever suffer injuries.",
      "",
      "Not going badly for Spurs at all, really, all things considered, and this one is definitely far more in the ‘slightly irritating’ category than a lot of others on the list.",
      "They did some tidy transfer work in the end this summer, albeit with a couple of cartoonish bits of Spursy slapstick along the way, and so far the idea of replacing Ange Postecoglou’s ludicrous football with Thomas Frank’s not ludicrous football is proving an effective if not always necessarily exhilarating decision.",
      "Where Tottenham might have slightly missed the boat is behind the scenes. In hindsight, we perhaps should have seen Daniel Levy’s departure coming. There was a clear sense this summer of a man attempting to cement his legacy, most notably when even agreeing to sit down for a chat with dangerous far-left Commie firebrand Gary Neville.",
      "But he didn’t actually leave until after the transfer window. And the Lewis Family’s new-found interest in the day-to-day running of Spurs and injection of £100m of fresh capital has also come now specifically at a time when it cannot actually be used to better the on-field situation.",
      "And this is suddenly a season ripe with opportunities for Spurs. Arsenal look too good but are still Arsenal; Chelsea, Liverpool and Man City all look more vulnerable to some extent or other than had been expected, Manchester United are still in full clown-car more, Nottingham Forest have collapsed in on themselves, while neither Aston Villa nor Newcastle appear in quite as good a position to challenge as in the recent past.",
      "The margins between success (i.e. getting back in the Champions League) and failure (not doing that) are likely to be very tight again this season. A chairman who hadn’t actively antagonised every other club in the division and an extra £100m to throw around really might have meant more in August than it does in October. Or even January when it may be too late and, of course, Value Is Hard To Come By.",
      "READ: Five reasons we should all be scared of a post-Daniel Levy Tottenham",
      "",
      "Guess in a way the real one here would be ‘having an entirely unsustainable wages-to-turnover ratio’ but that’s all a bit heavy really.",
      "It feels like Villa spent the entire summer in something of a funk on the back of missing out on Champions League football in the manner that they did and the knock-on effect that had on what they could do and who they could bring in during the summer.",
      "The good news is that there really is a very good chance that, like with Spurs last season, it all ends up working out for the best and they get back in the Champions League anyway with a lovely shiny European trophy ending an uncomfortably long drought.",
      "But right now, despite a four-game winning run that has lifted the gloom and funk to a decent extent, it does look rather more likely that something is ending rather than beginning at Villa, that they will now slink back having so nearly but not quite muscled their way right in to England and thus Europe’s top table.",
      "",
      "Not entirely or even mainly their fault, but Newcastle’s summer was an awkward, distracting and distracted one. In a league where standing still is rarely good enough, theirs was a summer spent inevitably and uncomfortably trying to avoid tumbling backwards.",
      "The uncertainty – or perhaps the long, painfully drawn-out certainty – around Alexander Isak’s departure didn’t help make it any easier for Newcastle to identify and secure a replacement, with those potentially coming in understandably keen to know exactly where they might stand before committing to the club.",
      "They do seem to have just about got there in the end with Nick Woltemade, even if it they had to pay a hefty premium to avoid the catastrophe of bringing in no replacement striker whatsoever. The big German absolutely screams cult hero, but it’s an awful lot to ask for him to come anywhere close to replacing what Isak gave them, and Newcastle weren’t able to even attempt the always entertaining if not perhaps reliably successful ‘Sell Elvis and buy The Beatles’ approach.",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Are Manchester United up for sale? Why did the Saudi General Entertainment Authority chairman get involved? What do the Glazers and Sir Jim Ratcliffe think?"
    ]
  },
  {
    "headline": "Are Manchester United for sale? Is Ratcliffe powerless? And why has one buyer ‘moved on’ from £4.79bn bid?",
    "tags": [
      "Man Utd",
      "Ratcliffe"
    ],
    "link": "https://www.football365.com/news/are-manchester-united-for-sale-ratcliffe-powerless-glazers-saudi",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-14 06:42:48",
    "source": "football365",
    "body": [
      "Are Manchester United up for sale? Why did the Saudi General Entertainment Authority chairman get involved? What do the Glazers and Sir Jim Ratcliffe think?",
      "You wait ages for a bus, then two come along in the space of a couple of years but the first lays everyone off and keeps making silly comments about free lunches, while the second might not actually exist.",
      "The Manchester United takeover machine has left the station again. But have the Glazers finally resolved to cut ties after being hit with a leveraged buyout-shaped guilty conscience two decades in the making? Has Sir Jim Ratcliffe decided he is too old to be willingly dealing with this nonsense? Or is there a mystery third option involving a sort of consortium which ‘can generate billions for the club’ and idolise Ousmane Dembele?",
      "It feels like a good time for a little Q&A session to try and shed some light on precisely what is going on.",
      "Certainly not ostensibly. Ratcliffe’s INEOS only completed the purchase of a 27.7% stake in the club in February 2024 for £1.25billion, increasing that stake to 28.9% in December 2024 when the last payment of a further £238m financial injection to boost the club’s infrastructure was made.",
      "That grants INEOS Limited – owned by Ratcliffe, Andy Currie and Manchester United board director John Reece – 28.9% of outstanding shares and voting rights, plus control over footballing operations, which has been exercised flagrantly and is unlikely to be relinquished soon or easily.",
      "Ratcliffe recently pledged to honour the entirety of Ruben Amorim’s three-year contract; those were not the words, nor have these been the actions, of a man who wishes to sell.",
      "Members of the Glazer family still control 48.9% of total outstanding shares altogether, with 67.9% of voting rights split between the six American siblings.",
      "The Glazers and INEOS are, as the club’s official website puts it, the only ‘two entities [who] hold greater than 10% of the voting rights in Manchester United plc’.",
      "While the changes to that ownership structure have not delivered the success INEOS will have craved or the Glazers perhaps expected, it is vanishingly unlikely either party will want to release their shares and offers are hardly being encouraged either way.",
      "It boils down to a couple of quotes chucked into the void of an international break.",
      "Turki Al-Sheikh, the chairman of the General Entertainment Authority, a government department charged with developing the entertainment sector in Saudi Arabia, sparked the furore by posting on X:",
      "‘The best news I heard today is that Manchester United is now in an advanced stage of completing a deal to sell to a new investor. I hope he’s better than the previous owners.’",
      "He later clarified that he was ‘not the investor, nor are they from my nation’, and the reported deal ‘might not necessarily happen’ anyway.",
      "Then a few days later a familiar name cropped up again in the news cycle: Thomas Zilliacus was back to take any seat at the top table he could find.",
      "Having spent an uncomfortable amount of 2023 arguing with a fellow Manchester United bidder who Ratcliffe later suggested “nobody’s ever seen” and might not actually even “exist”, Zilliacus capitalised on the unexpected commotion to bring his ideas into the equation again.",
      "The Finnish former Nokia head and XXI Century Capital founder teased “joining forces with the right parties with the sole aim of bringing Manchester United back to where it should be as the number one club in the world”.",
      "He felt “the opportunity is still there” to invest, aimed another fan-friendly dig at the Glazers for “not doing what should be done”, said he would “have nothing against working with people like Jim Ratcliffe or any investor, whoever that may be”.",
      "Zilliacus also confessed his love for players like Ballon d’Or winner Ousmane Dembele while saying he would “never have brought a player like Neymar to Manchester United” in a definite blast at Ed Woodward.",
      "It was then claimed on Monday that a ‘United Arab Emirates-based consortium’ was ‘meeting Manchester United officials in London’.",
      "Manchester United have thus far dismissed the rumours privately to sources when asked; it does seem to be that there actually is a lot of smoke without fire here.",
      "It is impossible to know their intentions but there has been no indication that the Glazers are willing to sell any more of their shares.",
      "There is, however, some interesting fine print contained within the INEOS purchase of a minority stake which remains relevant.",
      "As part of that deal was a ‘drag-along rights’ clause which was scheduled to become active 18 months after the initial investment, lasting until February 2027. The mechanism came into effect in August.",
      "In short, it makes the full sale of a company theoretically easier by preventing a minority shareholder from blocking any deal those who hold the majority want to go through. In this case it means that if the Glazers found someone willing to buy 100% of the shares in Manchester United, Ratcliffe would be forced to sell his stake in the deal.",
      "If that deal is made before February 2027, the share price must be above the $33 Ratcliffe paid. After that, it can be lower.",
      "INEOS also had first refusal on any shares the Glazers wanted to sell, although that expired without needing to be activated in August.",
      "There is a belief within the club that the Glazers are more than happy with the ownership situation, providing as it does a useful lightning rod for criticism in INEOS and Ratcliffe while allowing them to maintain overarching control of an incredibly lucrative investment.",
      "There is one bidder conspicuous by his absence in the current speculation: Sheikh Jassim Bin Hamad Al Thani.",
      "His takeover bid failed in 2023 when he attempted to buy 100% of shares in Manchester United for £4.79bn but repeatedly failed to provide proof of funds.",
      "Chris Wheeler of the Daily Mail has suggested that while Jassim ‘has kept an eye on developments and is aware of the clause, there is ‘zero interest’ in acting upon it’.",
      "A few reasons are cited: Qatar’s desire to focus on other projects such as securing the 2036 Olympics; the success PSG have had making buying another club ‘less attractive because someone else has already been there and done it in Europe’; and the media doubt his interest drew – Jassim was said to have sent ‘legal letters’ to Manchester United and Ratcliffe at the time.",
      "The belief is that Jassim has ‘moved on’ but the Middle East would not be short of prospective buyers if given enough encouragement.",
      "If Manchester United were sold now at the $33-per-share minimum that Ratcliffe is legally entitled to, that would give the club a current valuation of £4.3bn – making them the most expensive football club ever sold.",
      "Finance expert Kieran Maguire believes it would cost even more, telling SPORTbible recently: “Manchester United are a premium brand, a complete buyout would be at least £5bn but then a significant spend would be required on and off the pitch.",
      "“Current stock market value is about £3bn which is 15 per cent lower than at the end of June, despite all the rumours circulating [around] the club, which suggests the market is sceptical about whether a full blown bid is likely.”",
      "If this absolute mess is worth at least £5bn, you can certainly see why there is more of a greater appetite to sort the myriad issues rather than sell up.",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams.",
      "Some Man Utd legends have been ‘approached’ by a UAE-based consortium looking to buy the club from the Glazers, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here."
    ]
  },
  {
    "headline": "Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.football365.com/news/world-cup-missing-stars-arsenal-liverpool-man-united",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 20:42:43",
    "source": "football365",
    "body": [
      "As the stagger unwinds across various continents’ World Cup qualifying competitions, we’re starting to get a clearer idea about which countries – and thus which star players – might somehow still be in danger of missing out on a tournament almost everyone (well, 48 countries) now qualifies for.",
      "Fair to say the peril for these guys still ranges from ‘mild’ to ‘extreme’ to ‘confirmed’ and there’s plenty still to keep an eye on across the next international breaks in November and March.",
      "You can check out how World Cup qualifying for the new expanded 48-team tournament works here, because in lots of places it’s now very different to how it was before.",
      "In particular, as you’ll see, there are some huge names from European countries particularly grateful for the whopping great safety net that’s in place for teams who won their most recent Nations League group – at whatever level.",
      "",
      "Let the always entertaining and in no way boring Liverpool-Arsenal arguments begin over who is better out of Isak and Viktor Gyokeres. And then row in, mischief blazing, and insist the answer is in fact Dejan Kulusevski, actually.",
      "But the main point here is that right now all of them are at serious risk of missing the World Cup, with Sweden already looking mighty relieved to have that Nations League-based safety net to get them into the play-offs because they sit forlornly right at the very bottom of their qualifying group at the halfway stage, nine whole points behind perennial qualifiers Switzerland and six behind second-placed Kosovo.",
      "",
      "Having cited ‘mental tiredness’ as he made himself unavailable for June’s international break, Poland’s talisman was replaced as captain by coach Michal Probierz. Lewandowski’s response was to say that he would not play for Poland again until the coach was sacked.",
      "A damaging 2-1 defeat to Finland on the back of the Lewandowki spat meant that by the time the September internationals came along, Probierz was gone and Lewandowski was back for an impressive 1-1 draw in Holland secured by Matty Cash’s late equaliser.",
      "A 3-1 return win over Finland means fears of missing out altogether have now eased, but even a win over Netherlands in the next international break is unlikely to save them from what will be tricky play-off routes in which 16 entrants of assorted quality are whittled down to four qualifiers.",
      "",
      "Getting battered by a ridiculously talented Norway side has cost manager Luciano Spalletti his job but it could also help cost Italy a place at the World Cup, and that includes the new Manchester City goalkeeper.",
      "Already looks like it’s play-offs at best for a team trailing that Haaland-powered Norway machine by six points with three games to play.",
      "",
      "Having gone up another level following his move to PSG and swift treble glory inside six months, Kvaratskhelia is now well established among the very best players in the world.",
      "But he still faces an uphill struggle to qualify for a World Cup with Georgia, having to come through what is the toughest and most competitive qualification region and also the one to benefit the least from the expansion to 48 teams.",
      "Georgia currently trail Spain and Turkey in Group E and must finish in the top two to have any chance.",
      "",
      "Interesting times for the centre-back, dealing with the Angeball whirlwind at club level and now injured and unable to help his Serbia team-mates avoid a 1-0 defeat to Latvia that has left their top-two chances in England’s group looking bleak.",
      "And there’s no Nations League helping hand here either.",
      "",
      "Even with Africa being one of the big winners from the World Cup’s expansion, a couple of traditional big names have got themselves in bother.",
      "Cameroon look set to miss out on qualification to Cape Verde in African Group D, and will then be relying on being one of the four best runners-up from the nine groups just to reach the play-offs. And if they win the play-offs it only gets them to… another play-off – the intercontinental ones that will decide the final two qualifiers in March.",
      "Plenty of familiar names in the Cameroon squad, but Manchester United’s big summer signing from Brentford would be the biggest.",
      "",
      "Out of favour at Tottenham and out of the World Cup after Mali could finish only third in their qualifying group behind Ghana and Madagascar.",
      "And to make matters worse, he left the field on a stretcher during Mali’s final game of the campaign after suffering a nasty-looking ankle injury.",
      "",
      "Another African country with plenty of World Cup pedigree that appear set to miss out is Nigeria. Galatasaray striker and Liverpool mini-crisis contributor Osimhen is perhaps the biggest global star from a squad that has underperformed badly to trail Benin and South Africa with just one match to go to try and salvage the situation, but he is far from alone. Alex Iwobi, Wilfrid Ndidi, Ademola Lookman, Ola Aina and Kelechi Iheanacho have all been involved.",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "While not everyone can be Nottingham Forest, there are still plenty of Premier League clubs with cause to regret and rue how certain things have gone down."
    ]
  },
  {
    "headline": "Matheus Cunha makes three worrying Man Utd admissions – ‘Feels like a long time’",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/opinion-matheus-cunha-three-worrying-man-utd-admissions-long-time",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 20:25:07",
    "source": "football365",
    "body": [
      "Matheus Cunha believes the combination of signing for Manchester United in the summer and playing for Brazil represents a “spectacular personal moment”, and that’s just one of the worrying admissions he made while on international duty.",
      "Cunha joined United for £62.5m in the summer on the back of 15 goals and six assists in an outstanding 2024/2025 season for Wolves. But he’s yet to score or assist in seven games for his new club and was dropped to the bench by Ruben Amorim for the 2-0 win over Sunderland last time, with his replacement, Mason Mount, scoring and impressing in his stead.",
      "The Brazilian will be well aware of the number of quality players who have been signed by United for similarly hefty fees and failed to live up to expectations, and appears to already be feeling the stress.",
      "After leading the Selecao line in their 5-0 win over South Korea on Friday, Cunha admitted it feels as though he’s been at United for far longer than a couple of months amid his and his teammates’ struggle to pick up the positive results required to keep Ruben Amorim in the job.",
      "“I try as much as possible to adapt, to learn… it’s only been two months,” he said. “But it feels like I’ve been here for a long time because of the club’s current situation.”",
      "Christ, imagine how Luke Shaw feels.",
      "And Cunha is also falling into the familiar Old Trafford trap of ramping up the pressure on himself as a player signed for big money to right the United wrongs.",
      "He added: “I have to get results as quickly as possible because I’m a [big] signing… all of this helps a lot to find the adaptation faster and feel as good as possible in the national team.”",
      "But perhaps most worrying of all, and this has been a criticism aimed at innumerable United stars for over a decade since Sir Alex Ferguson left the club, is Cunha’s belief that he has ‘arrived’.",
      "“We live in a constant search for something. Even though a difficult moment when you’re pursuing a dream and encountering some obstacles leaves you feeling a bit lost,” he added.",
      "“You want to understand, and despite having so much, you don’t feel fulfilled by what you’ve achieved.",
      "“You have to constantly remember where you came from to understand where you’ve arrived.",
      "“What I was searching for as a person more than anything else, I’m slowly finding. You constantly want to improve. That’s innate in human nature, but I can’t help but stop and enjoy this moment.",
      "“Feeling privileged to wear the jersey of the greatest national team in the world, one of the greatest clubs in the world… it’s a spectacular personal moment.",
      "“I have an incredible family, another little girl now, everyone is doing well and feeling healthy. I’m enjoying all of this in a positive way.”",
      "All too many players have seen United as an end-game; the point at which they’ve ‘completed football’. And while that was previously because it was the club where trophies were won, it’s more recently been the location to accumulate wealth while resting on laurels.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Real Betis winger Antony has revealed that new Man Utd signing Matheus Cunha asked him to stay at the club over the summer transfer window.",
      "A new Manchester United signing has revealed he feels “horrible all week” when the side loses, more so than at previous clubs, as he implored the side to “do more.”",
      "Liverpool, Manchester City and West Ham have downgraded this summer while Manchester United have weakened relegation rivals.",
      "Manchester United lost against Arsenal and now Sunday v Fulham is absolutely massive. Can they be Premier League title contenders?",
      "An ex-PGMOL chief has given his verdict on Man Utd’s penalty appeal vs Arsenal while slamming the ‘loose and inconsistent’ refereeing of Simon Hooper."
    ]
  },
  {
    "headline": "Rashford’s 15-word Man Utd jibe explains Ratcliffe stance on Amorim sack",
    "tags": [
      "Man Utd",
      "Ratcliffe",
      "Amorim",
      "Rashford"
    ],
    "link": "https://www.football365.com/news/opinion-rashford-15-word-man-utd-jibe-ratcliffe-stance-amorim-sack",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 16:28:03",
    "source": "football365",
    "body": [
      "In 15 damning words, a rejuvenated Marcus Rashford summed up the reason for his and almost all others’ inability to maintain peak performance levels at Manchester United, and why Sir Jim Ratcliffe is clinging to the increasingly false hope of Ruben Amorim turning things around at Old Trafford.",
      "Rashford now has eight goal contributions in nine games for club and country, Barcelona boss Hansi Flick has described him as an “unbelievable” talent and president Joan Laporta can’t believe his luck. The £26m required to make his loan move permanent at the end of the season looks like an absurd bargain.",
      "But we’ve been here before with Rashford. After 43 goals and 22 assists across two seasons under Ole Gunnar Solskjaer he was being linked with £100m moves abroad. 30 goals in all competitions under Erik ten Hag in 2022/2023 saw United hand him a very lucrative five-year contract to ward away the same eager suitors. But troughs have followed those peaks.",
      "Rashford scored just five goals in Solskjaer’s third season and eight in Ten Hag’s second. Suggestions of complacency, overconfidence and distraction have all been aimed at Rashford by people who don’t and can’t know why he’s never been able to sustain the top level required to be labelled a world class footballer. But Rashford himself has perfectly sound justification for his own inconsistency.",
      "“I feel like I have been in an inconsistent environment for a very long time,” he said.",
      "The 27-year-old had been asked by ITV ahead of England’s World Cup qualifier against Latvia on Tuesday what he thought about Thomas Tuchel’s claim that the only thing preventing Rashford from being considered a truly elite footballer was his lack of consistency.",
      "“But I completely agree,” Rashford added. “I think consistency is what I need to bring into my game and I am looking to do that. I want to be at my best, not sometimes, but as often as possible.",
      "“When people talk about consistency, in order to be consistent in anything not just sport, you need consistent variables in your life and the way you train.",
      "“We have just had so many changes so far in my career but I have to look forward and that it definitely one of the things I want to put right and improve on to be at my best more often.",
      "“When I am at my best I really enjoy everything about the sport.”",
      "Ten games for Barcelona is evidently too small a sample size to make any grand claims over Rashford’s consistency, but his comments do speak to the predicament Ratcliffe and Ineos now find themselves in with regards to Amorim’s future at the club.",
      "Whether he will be given this time or – as we suspect – not, Ratcliffe said last week that Amorim needs “three years” at United to prove he’s a “great coach”. And while that felt like an almost farcical vote of confidence in a manager who’s overseen their worst Premier League season ever and has accrued just 37 points in 34 top flight games, the quest for consistency goes a long way to explaining it.",
      "Because having just one player – Bruno Fernandes – you could reasonably pick out as being a consistently good footballer in over a decade isn’t normal, not just for a club like Manchester United, but any football club.",
      "It’s far too simplistic to suggest that the chopping and changing of managers is solely to blame – other top clubs with a similar approach don’t suffer in the same way – and blindly sticking with the latest recruit just because they happen to be in charge when this dawning realisation occurs could be catastrophic.",
      "But it makes sense that Ratcliffe, in a bid to build a team of consistent footballers, is desperate to avoid the inconsistencies that Rashford, and doubtless others who have either left Manchester United or remain in the midst of the madness, see as the cause of their struggle to remain at the pinnacle once it’s been reached at Old Trafford.",
      "According to reports, Marcus Rashford’s hopes of joining FC Barcelona from Manchester United permanently have been given a new ‘massive boost’.",
      "According to reports, FC Barcelona ‘will trigger’ their option to sign Marcus Rashford permanently from Manchester United next summer.",
      "According to reports, Manchester United have already decided whether to give FC Barcelona loanee Marcus Rashford a ‘surprise lifetime’.",
      "We all love to laugh at Man Utd players thriving away from Old Trafford, but Liverpool have more players in the top ten Premier League defectors of the season.",
      "Barcelona president Joan Laporta can’t believe his luck in landing Marcus Rashford from Man Utd over the summer, according to reports.",
      "It has been claimed that Marcus Rashford has given Manchester United a “big issue”, with the Premier League giants “boxed in”."
    ]
  },
  {
    "headline": "Man Utd captain Fernandes ‘consulted’ over Amorim future as Neville is put forward as a replacement",
    "tags": [
      "Man Utd",
      "Amorim",
      "Fernandes"
    ],
    "link": "https://www.football365.com/news/man-utd-fernandes-consulted-amorim-sack-neville-next-manager",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 14:31:18",
    "source": "football365",
    "body": [
      "Gary Neville has been put forward as a potential replacement for Ruben Amorim as Man Utd captain Bruno Fernandes was reportedly ‘consulted’ over the current situation.",
      "The Red Devils have had a nightmare time under Amorim with the Portuguese head coach managing to accumulate just 37 points from 34 Premier League matches since taking over from Erik ten Hag last season.",
      "There were rumours that Amorim could face the sack if he’d lost to Sunderland heavily before the international break with Man Utd sitting in the bottom half.",
      "A report from the Daily Mirror has claimed that members of the Red Devils hierarchy ‘held talks with senior players to discuss the current situation at the club’.",
      "Omar Berrada and Jason Wilcox led ‘recent discussions between the club’s hierarchy and the playing squad’ as they attempted to gauge the mood within the camp.",
      "READ: Man Utd and the ‘shock’ £60m transfer exclusive that’s nothing of the sort…",
      "The report adds: ‘Captain Bruno Fernandes is among those who have been consulted, while other opinions have also been sought. It has been suggested the conversations were casual in nature and not necessarily designed to evaluate Amorim’s standing at the club as such.",
      "‘Nevertheless, it is not the sort of activity one would normally witness at a club where everything is functioning seamlessly.’",
      "If Man Utd do end up sacking Amorim this season, former Red Devils defender Neville has been tipped to replace the Portuguese boss by his former Valencia striker Alvaro Negredo.",
      "Negredo, who played under Neville in the Man Utd legend’s only managerial job, told Coin Poker: “It also depends on the situation at Manchester United. I think he was a very important player for Manchester United. He’s a player who gave a lot to English football.",
      "“Perhaps, similar to Valencia at that time, it’s a United team who haven’t been consistently at the top for a long time, and perhaps now wouldn’t be the best moment.”",
      "Michael Owen thinks it’s “embarrassing” to suggest that all of the Red Devils’ problems under Amorim are over the Man Utd boss playing three at the back.",
      "Owen said recently: “They’re playing a back-three. If I’m not wrong, I watched Erik Ten Hag about a year ago playing a back-four, and it was some of the most awful football I’ve ever seen from a Manchester United team.",
      "“Some great teams over the years have played with a back-three. I’m not saying that’s my favourite formation at all, and I’m not saying that Amorim is right to be steadfast in his beliefs in that formation.",
      "“But I certainly don’t think all of United’s problems now are because they play with the back-three.",
      "“It’s embarrassing if you’re going to say the main reason for the downturn is because they play a back-three. I mean, it really isn’t.",
      "“They could go back to a back-four and play as bad as they did under Ten Hag, then the screams would be equally as loud.”",
      "READ NEXT: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "Man Utd head coach Ruben Amorim is demanding that the Red Devils invest in Inter Milan defender Federico Dimarco, according to reports.",
      "Man Utd are one of two clubs hoping to do a deal for Borussia Dortmund midfielder Jobe Bellingham in the winter transfer market, according to reports.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Man Utd midfielder Kobbie Mainoo has “been found out” under Ruben Amorim, according to former Liverpool defender Steve Nicol.",
      "Germany coach Julian Nagelsmann got it wrong when he said that Florian Wirtz had created the most chances in the Premier League, but…"
    ]
  },
  {
    "headline": "Florian Wirtz damned lies debunked but he is in top 10 PL creators",
    "tags": [],
    "link": "https://www.football365.com/news/florian-wirtz-damned-lies-debunked-but-he-is-in-top-10-pl-creators",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 13:54:12",
    "source": "football365",
    "body": [
      "Germany coach Julian Nagelsmann got it wrong when he said that Florian Wirtz had created the most chances in the Premier League, but there are numbers that suggest he has been the Reds’ most creative player this season.",
      "Nagelsmann attempted to blame Wirtz’s Liverpool teammates for his 007 start but was quoting the wrong statistics; he has actually created the joint-15th-most chances in the Premier League this season, which is not quite so impressive.",
      "But when you look at the statistics for shot-creating actions this season, Wirtz is joint-seventh on the list and ahead of every other Liverpool attacker, including Mo Salah in 80th.",
      "According to Opta, they are the two offensive actions directly leading to a shot, such as passes, take-ons and drawing fouls.",
      "For fairness, we look at SCAs per 90, so that players are not rewarded for just playing all of the football like Bruno Fernandes and Elliot Anderson. Though to be fair, they do not need any help.",
      "So the top 10 creative players in the Premier League by the fairest metric are…",
      "",
      "10) Kiernan Dewsbury-Hall (Everton): 4.33 SCAs per 90\nHaving a bloody lovely time at the right size club and thriving in that No. 10 role with Iliman Ndiaye and Jack Grealish either side. If Everton had a halfway competent striker, they would be flying.",
      "",
      "9) Kieran Trippier (Newcastle United): 4.40 SCAs per 90\nPretty much takes all the set-pieces, putting him behind only Granit Xhaka in terms of SCAs from dead balls this season. But he’s also creating chances from open play, none of which have been taken by a blunt Newcastle attack so far.",
      "",
      "7=) Oscar Bobb (Manchester City): 4.48 SCAs per 90\nWhen you play on the same team as Erling Haaland, you are going to log some serious chances. Bobb may not be a guaranteed starter in this Manchester City team but he is making a serious case for his involvement, notching six SCAs v Brentford in their last fixture before the international break.",
      "",
      "7=) Florian Wirtz (Liverpool): 4.48 SCAs per 90\nThere he is. Not the highest chance-creator in the Premier League, but up there when it comes to involvement in Liverpool moves leading to shots on goal. There were eight such SCAs on his truly competitive debut against Bournemouth but you’re only as good as your last game…and that was poor v Chelsea.",
      "",
      "6) Elliot Anderson (Nottingham Forest): 4.57 SCAs per 90\nHe’s played himself into the England team as a more defensive option but he is Forest’s most creative player this season, which is likely to make him the subject of serious transfer interest (most notably from Manchester United) in 2026. He was involved in all three Forest goals on the opening day of the season, before things went a bit mental.",
      "",
      "5) Bukayo Saka (Arsenal): 4.68 SCAs per 90\nEasing himself back into serious form and back into the England starting XI this season. The next Arsenal player on the list would be Noni Madueke in 22nd, which suggests that Mikel Arteta might have to find a way to get them both in the side.",
      "",
      "4) Jack Grealish (Everton): 4.86 SCAs per 90\nEverton have scored nine Premier League goals this season; Grealish was involved in the build-up of six and scored one more. He is having a bloody lovely time on Merseyside. Again, imagine if Everton had a proper striker.",
      "",
      "3) Amad Diallo (Manchester United): 5.03 SCAs per 90\nInvolved in both Manchester United goals v Sunderland, Amad is one good reason why the club may still be clinging onto the idea that this formation would work under this manager.",
      "",
      "2) Jeremy Doku (Manchester City): 6.03 SCAs per 90\n“I ask the wingers in the final third to go one vs. one or one vs. two and I have the feeling that Jeremy’s decision-making in the final third improved, like, wow!”. Like wow indeed.",
      "",
      "1) Bruno Fernandes (Manchester United): 6.18 SCAs per 90\nNone of it has really come off as yet, but the idea that playing deeper is stymying his creativity is clearly a nonsense. Nobody creates more from open play in the Premier League; he was particularly brilliant against Arsenal on the opening day.",
      "Thomas Tuchel is lying and so too is Jack Grealish, whose snub can only be explained by some sort of ‘personal’ rift between the two…",
      "Gary Neville has been put forward as a potential replacement for Ruben Amorim as Man Utd captain Bruno Fernandes was ‘consulted’ over the current situation.",
      "Florian Wirtz’s record of seven Premier League games for Liverpool without a goal or assist has been defended by Germany coach Julian Nagelsmann using false statistics.",
      "Transfer insider Graeme Bailey has revealed that Manchester United have “held talks” over the sale of Bruno Fernandes, as “things have changed” after a summer move fell through.",
      "Legendary former Liverpool manager Jurgen Klopp has weighed in on the struggles of Florian Wirtz at the moment, revealing what “everyone knows” about the situation.",
      "Manchester United midfielder Bruno Fernandes feels a meeting with Ireland goalkeeper Caoimhin Kelleher is a good opportunity to “settle scores” after he missed a penalty against him earlier this season."
    ]
  },
  {
    "headline": "Antony reveals Man Utd star who asked him to stay as new signing makes honest admission",
    "tags": [
      "Man Utd",
      "Antony"
    ],
    "link": "https://www.football365.com/news/man-utd-antony-reveals-cunha-asked-stay-honest-admission",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 13:34:33",
    "source": "football365",
    "body": [
      "Real Betis winger Antony has revealed that new Man Utd signing Matheus Cunha asked him to stay at the club over the summer transfer window.",
      "The Brazil international will go down as one of the worst signings in the club’s history after signing from Ajax for around £85m in 2022.",
      "Antony has been complaining in the Spanish and Brazilian media in recent weeks over his treatment at Man Utd but insists the experience will make him stronger.",
      "Speaking to Spanish newspaper AS last week, Antony – who joined Real Betis permanently in the summer – said: “I didn’t speak much with Ruben Amorim; there wasn’t much contact.",
      "“His decision to allow me to train separately was a given. But I had to respect it.",
      "“Today I’m fine; I took care of myself by training well even though I was apart. After three months, I played 90 minutes, and that’s the result of what I was working on.”",
      "READ: Man Utd and the ‘shock’ £60m transfer exclusive that’s nothing of the sort…",
      "He added: “The bad things I went through in England really strengthened me mentally.",
      "“Now I take better care of myself mentally because I know that when I’m in a good frame of mind, things turn out well for me.”",
      "And now he has revealed to the same outlet that Brazil team-mate Cunha – who signed for Man Utd from Wolves in the summer – wanted him to remain at Old Trafford.",
      "Antony said: “Matheus Cunha wanted me to play there with him, but the situation was already very difficult. I have a lot of affection for him.”",
      "Man Utd forward Cunha has also been speaking to the media this week with the Brazil international admitting that it feels like he has been at Old Trafford for “a long time because of the club’s current situation”.",
      "Cunha told told Globo Esporte: “Being here now in the national team, and at United, is, without a doubt, a different level, a different moment for me as a player.",
      "“I try as much as possible to adapt, to learn… it’s only been two months [since joining Manchester United], but it feels like I’ve been here for a long time because of the club’s current situation.",
      "“I have to get results as quickly as possible because I’m a [big] signing… all of this helps a lot to find the adaptation faster and feel as good as possible in the national team.”",
      "On whether he has found the happiness he was searching for in his career, Cunha added:",
      "Cunha added: “Without a doubt. We live in a constant search for something. Even though a difficult moment when you’re pursuing a dream and encountering some obstacles leaves you feeling a bit lost.",
      "“You want to understand, and despite having so much, you don’t feel fulfilled by what you’ve achieved.",
      "“You have to constantly remember where you came from to understand where you’ve arrived.”",
      "READ NEXT: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Cunha believes the combination of signing for Man Utd and playing for Brazil represents a “spectacular personal moment” and that was just one of his worrying admissions…",
      "Former Manchester United star Antony has once again spoken out on his exit from the Premier League giants and has revealed a “scary” situation.",
      "Former Man Utd winger Antony claims he suffered from “rudeness” from people at Old Trafford during his final days at the club.",
      "Former Manchester United winger Antony believes the club “disrespected” him by pushing him out of the club in the summer transfer window.",
      "A new Manchester United signing has revealed he feels “horrible all week” when the side loses, more so than at previous clubs, as he implored the side to “do more.”"
    ]
  },
  {
    "headline": "Man Utd ‘watch’ Bayern Munich star ahead of winter move; two sources claim £78m bid is incoming",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/man-utd-watch-bayern-munich-pavlovic-two-sources-yildiz-bid",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 11:15:38",
    "source": "football365",
    "body": [
      "Man Utd have been scouting Bayern Munich midfielder Aleksandar Pavlovic ahead of potentially making a move in January, according to reports.",
      "The Red Devils are showing their inconsistent form from last season once again with Man Utd winning three, losing three and drawing one of their first seven Premier League matches.",
      "Ruben Amorim guided the Red Devils to a 15th-placed finish last campaign and will need to do better this term in order to keep his job after spending over £200m on new players over the summer.",
      "They improved their attack by bringing in Benjamin Sesko, Matheus Cunha and Bryan Mbeumo, while Senne Lammens impressed in goal during his debut against Sunderland before the international break.",
      "But there was one major area that Man Utd failed to improve with many fans and former players hoping to see them strengthen in midfield.",
      "There were some links to Brighton midfielder Carlos Baleba but the Seagulls’ huge asking price ended any realistic chance of the Cameroon international signing over the summer.",
      "READ: Man Utd and the ‘shock’ £60m transfer exclusive that’s nothing of the sort…",
      "And now former Man Utd chief scout Mick Brown – who is still well-connected at Old Trafford – insists that the Red Devils are “watching” 21-year-old Pavlovic as Amorim “wants” a new midfielder in January.",
      "Brown told Football Insider: “We know Amorim wants to sign a midfielder in January.",
      "“They need somebody who gets about the pitch, isn’t afraid to put their foot in, has a drive and energy about him to make a difference all over the pitch.",
      "“But also somebody who can keep possession of the ball and help them advance up the pitch because at the moment they’re relying very much on Bruno Fernandes.",
      "“Ideally they would get somebody like Moises Caicedo who does a bit of everything at Chelsea.",
      "“They’ve been having a look at a lot of options across Europe, we’ve spoken before about players Wharton for example, from the Premier League.",
      "“The Bayern Munich lad Pavlovic is somebody on their radar and somebody they have been looking at.",
      "“Whether or not they’d be willing to let him go, that will be up to United to find out, but they’re watching him and a number of other options for the January window.”",
      "Man Utd could still look at further improving their forward line too with Italian website Tutto Juve insisting that the Red Devils are ‘ready to offer €90 million’ £78m for Juventus forward Kenan Yildiz.",
      "While Quotidiano Sportivo claim that Juventus should be ‘beware of offers’ from the Premier League with the website backing up earlier claims that Man Utd are willing to pay between €85m-€90m for the Turkey international.",
      "READ NEXT: Man United, Liverpool and Arsenal stars in danger of missing out on expanded 48-team World Cup",
      "Chris Sutton has responded to suggestions of Harry Kane stat-padding by stating he is “not the fixtures secretary” and he “can’t help who he plays against.”",
      "According to reports, Bayern Munich have ‘set a demand’ for Liverpool target Michael Olise, who could replace Mohamed Salah at Anfield.",
      "According to reports, Crystal Palace captain Marc Guehi has already made a decision on a potential January transfer amid interest from Liverpool.",
      "Liverpool are facing serious competition from Bayern Munich over the signing of Crystal Palace defender Marc Guehi, according to Florian Plettenberg.",
      "Those associated with Bayern Munich remain bitter over Nick Woltemade and Florian Wirtz, with Newcastle United labelled “idiots” by a former chairman.",
      "Harry Kane’s transfer ‘priority’ has reportedly been revealed as his ‘stance on a return’ to Tottenham Hotspur is a blow for the Premier League side."
    ]
  },
  {
    "headline": "Man Utd and the ‘shock’ £60m transfer exclusive that’s nothing of the sort…",
    "tags": [
      "Exclusive",
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/man-utd-shock-transfer-exclusive-mediawatch",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 10:42:25",
    "source": "football365",
    "body": [
      "Manchester United are being linked with a ‘shock’ £60m Manchester United transfer that’s no ‘shock’ at all.",
      "And it’s been given the ‘green light’ by Jack Grealish.",
      "",
      "Raise your hand if you are remotely shocked that Manchester United are being linked with Adam Wharton?",
      "Even regular readers of Football365 would not be surprised; we reported interest in August and then again in September, when we laughed off suggestions that the Crystal Palace and England midfielder could cost just £60m.",
      "The only shock at the weekend reports of a £60m Wharton deal is that Daily Star Chief Sports Writer Jeremy Cross has the gall to call this an ‘exclusive’. It’s either cheeky as f*** or incredibly lazy as ‘Wharton to Man Utd’ is more olds than news.",
      "We’re told in the headline, sub-headline and opening line that it’s a ‘shock £60m raid’. To who? To Cross? Certainly not to us or anybody else paying attention over the last two months.",
      "Amorim believes Wharton has the technical abilities to be a huge success at United. Palace have not been opposed to selling some of their biggest names, if the price is right.",
      "And United believe a bid in the region of £60m would be good enough to lure Wharton to Old Trafford next summer.",
      "Well they can ‘believe’ all they want, but genuinely…will it balls.",
      "The irritating thing about this ‘exclusive’ is not necessarily that Cross is claiming an ‘exclusive’ on an old story, but that other outlets blindly follow suit, with The Sun saying that ‘MANCHESTER UNITED are reportedly plotting a shock £60million bid for Adam Wharton’.",
      "Literally three days before, they published a piece that said ‘Wharton has long been on the radar of United, Manchester City and Liverpool’. So it’s not a sodding ‘shock’ is it?",
      "Goal also call it a ‘shock’ move because where one leads, everybody follows like click-thirsty sheep.",
      "Obviously, since reports of this ‘shock move’, Palace chief Steve Parish has made it clear that Wharton has shown no interest in moving to another club, while telling talkSPORT: “I think Adam at some point will want to play either in the Champions League with us, if we can make that happen, or probably with another club. He’s an extraordinary talent. I think right now, and I can’t speak for Adam, but I think he’s focused on his time at Crystal Palace.”",
      "Put that through the Reach spin machine at the Mirror and…",
      "Adam Wharton issues Man Utd transfer demand as Crystal Palace star eyed",
      "Adam Wharton has said f*** all. Hell, even Parish says that Wharton has said f*** all. He definitely has not ‘issued Man Utd transfer demand’. In fact, some would say he has done exactly the opposite.",
      "",
      "The phrase ‘green light’, when not referring literally to a green light, means ‘permission to go ahead with a project’. Councils give green lights to planning applications, company directors give green lights to budgets, and in football terms, sporting directors give green lights to transfers.",
      "You know what you absolutely need to give a green light? Control over the lighting system. If you have no power, then you cannot give permission.",
      "Which brings us to the Mirror and this monstrosity of a headline:",
      "Jack Grealish has already given Man Utd green light for huge transfer",
      "Now, Grealish is an excellent footballer but he is not a sporting director at Manchester United so he cannot give the ‘green light’ to a ‘huge transfer’, unless he is the player in question. Which is presumably what we are supposed to think, that United are interested in the Everton loanee and Grealish has understandably given the deal an enthusiastic thumbs-up.",
      "Obviously we know that to be bollocks, so which ‘huge transfer’ has been given the ‘green light’ by a party with absolutely no power to make a decision?",
      "If Manchester United are looking for more reasons to sign Adam Wharton next summer, Jack Grealish has given them one. That’s after the Everton winger came out firing in his admiration of the Crystal Palace midfielder.",
      "FFS.",
      "So the ‘green light’ given by Grealish to a huge Manchester United transfer is that he described Wharton as “the best player on the pitch” when the two teams met eight days ago.",
      "That’s not a ‘green light’ to a transfer; that’s one footballer admiring the work of another footballer.",
      "This was not ‘a glowing review to any potential suitors – including United’; this was one footballer admiring the work of another footballer.",
      "Yes, it’s the international break. But does that mean we have to pretend Jack Grealish is about to join Manchester United? Now that would be a ‘shock’…",
      "Alexander Isak has declared ‘a crisis situation’ with he and his teammates ‘so f***ing dissatisfied’ and one player demanding that ‘the system’ is ‘removed’.",
      "Matheus Cunha says his two months at Man Utd have felt like a lot longer and with a toxic environment and no obvious starting spot, can you blame him?",
      "Thomas Tuchel, Jude Bellingham, a ‘circus’ and an exhortation to ‘be more Roy Keane’. How is that going to help?",
      "Liverpool’s summer of spending had many predicting another easy league title but their difficulty to settle is in stark contrast to other teams.",
      "Manchester United can never dominate with a formation made for counter-punchers for reasons outlined in full here.",
      "While not everyone can be Nottingham Forest, there are still plenty of Premier League clubs with cause to regret and rue how certain things have gone down."
    ]
  },
  {
    "headline": "Why Man Utd ‘double blow’ is actually one ‘blow’ as manager would accept offer to replace Amorim",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.football365.com/news/why-man-utd-double-blow-is-actually-one-blow-as-manager-would-accept-offer-to-replace-amorim",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 09:57:45",
    "source": "football365",
    "body": [
      "Manchester United have supposedly been dealt a ‘double blow’ regarding Adam Wharton and Oliver Glasner, but it’s actually only one ‘blow’…",
      "Crystal Palace are earning admiring glances from many clubs in Europe, including Manchester United, for their sensational rise under Glasner.",
      "The 2024/25 FA Cup winners have gone from strength to strength this season despite losing Eberechi Eze and Michael Olise in recent windows, with Glasner’s side sitting sixth in the Premier League after seven games.",
      "However, problems lie ahead for Crystal Palace, who are at risk of losing more key assets in 2026.",
      "Marc Guehi’s exit upon the expiry of his contract in 2026 already feels certain amid interest from Liverpool and teams across Europe, while they also face a fight to keep Wharton and Glasner.",
      "READ: Liverpool show ‘it’s not hard’ to make Ruben Amorim and his 3-5-2 work for Man United",
      "Unsurprisingly, Man Utd have been thrown in the hat for Wharton and Glasner, though Palace chief Steve Parish has moved to reassure supporters that their futures could lie with the London club.",
      "The Sun have sold this as a ‘double blow’ for Man Utd and I’m about to explain why that is a bit of a stretch…",
      "Firstly, they have a fair point on Wharton as he “will want to play in the Champions League”, thus making a move to rivals Liverpool far more likely at this stage.",
      "“Look, I think Adam at some point will want to play, either in the Champions League with us, if we could make that happen, or probably with another club,” Parish said.",
      "“He’s an extraordinary talent. I think right now, and I can’t speak for Adam, but I think he’s focused on his time at Crystal Palace.",
      "“He had a broken season last season with the groin issues that he had, which a lot of young players get. This season he’s completely focused on putting the games in, getting in the England squad, being a regular for us. I think he’s very committed to the club.",
      "“I mean, if Manchester United want Adam Wharton, that’s nothing surprising really. The fact of the matter is he’s got a long contract to run. There’s no pressure on us to do it and I don’t think there’s any real pressure from the player either.”",
      "The other supposed ‘blow’ for Man Utd is that Parish and Glasner have held talks over a new contract.",
      "“We would love to keep Oliver. We’re building something. I think for Oliver, it’s about the conditions being right,” Parish added on “early conversations” with Glasner.",
      "“It’s about everything being in a way that he enjoys his work, and he finds the conditions favourable to achieve.",
      "“Oliver wants to win things. He makes no secret of that. He’s in football for those days where we give all that pleasure to the fans. And we do as well.",
      "“So, if we can align those interests, then hopefully we can make something happen.”",
      "In reality, these “conversations” mean very little as they certainly do not mean that Glasner will sign a contract extension at Palace beyond next summer.",
      "Glasner “wants to win things” and as good as Palace have been over the past couple of years, he will look elsewhere to give himself a far greater chance of achieving that goal.",
      "It has also been reported that Glasner is “set” on the Man Utd job as Ruben Amorim remains one of the favourites to be the next Premier League manager sacked.",
      "Should Glasner join Man Utd? Probably not, as there are other elite opportunities available as safer bets for the Palace boss.",
      "But football managers are nothing if not egotistical, and Glasner, who is riding the crest of a wave at Palace, would back himself to be the one to fix Man Utd, who proved in the summer that they can still attract their top targets to Old Trafford despite their prolonged period of misery.",
      "Manchester United are being linked with a ‘shock’ £60m Manchester United transfer that’s no ‘shock’ at all.",
      "According to reports, FC Barcelona ‘will trigger’ their option to sign Marcus Rashford permanently from Manchester United next summer.",
      "According to reports, Nottingham Forest could sack Ange Postecoglou ‘this weekend’ as they have already picked out a ‘prime candidate’ to replace him.",
      "Arsenal legend Paul Merson insists Crystal Palace boss Oliver Glasner would not be “a good fit” for Man Utd with his system “all wrong” for the Red Devils.",
      "Crystal Palace manager Oliver Glasner now has his ‘eyes set on’ the Man Utd job as pressure builds on Ruben Amorim at Old Trafford, according to reports.",
      "We can’t spend our whole lives laughing at Manchester United; sometimes we have to doff caps to the clubs smashing this football lark."
    ]
  },
  {
    "headline": "Barton aims X-rated rant at Man Utd legend Rooney over Man City ‘conspiracy theories’",
    "tags": [
      "Man Utd",
      "Rooney"
    ],
    "link": "https://www.football365.com/news/man-utd-barton-x-rated-rant-rooney-man-city-qpr-premier-league-consipiracy-theory",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 09:49:23",
    "source": "football365",
    "body": [
      "Joey Barton has hit out at Man Utd legend Wayne Rooney over his “conspiracy theories” around Man City’s dramatic Premier League title win in 2012.",
      "The Red Devils were beaten to the Premier League title on the final day of the 2012 season despite their 1-0 win over Sunderland.",
      "Man City were losing 2-1 at home to relegation-threatened QPR going into second-half stoppage time before Roberto Mancini’s side scored two goals in two minutes and five seconds to take the victory and the title.",
      "Wayne Rooney has since voiced skepticism around Sergio Aguero’s late winner, while he criticised QPR’s players for “celebrating after the game with the City players”.",
      "Djibril Cisse hit back at those accusations from Rooney last week and insisted it was understandable that he celebrated with compatriot Samir Nasri as both teams had achieved something with QPR staying up.",
      "Cisse told FourFourTwo: “I’m not going to take this accusation any longer. I was celebrating with Samir Nasri.",
      "READ: England fans not behaving like insane headbangers is a plus, Tommy Tuchel",
      "“I didn’t celebrate with Mario Balotelli, Sergio Aguero or anybody else. I celebrated with my brother, Samir, who had been a friend of mine for 15 years.",
      "“I was happy for my friend and also that we managed to stay up. I don’t care about Man City. My friend finally won the Premier League after many years in England and I was happy for him and also for me. That’s all.”",
      "Barton, who made a fool out of himself after being sent off, got involved in the debate after Cisse’s comments, he began: “There’s been a bit of a spat online between Djibril Cisse and Wayne Rooney. Rooney has said that the game was bent and that QPR threw that game.”",
      "On Man Utd legend Rooney, Barton added: “I’m only commenting on it because he referenced me in it. Half of our team knew we were safe and stayed up and half of our team didn’t. You can see when you see it.",
      "“Five or six of the team did. I can hear it getting shouted from the sidelines. We had all been in City’s academy. You had Nedum Onuoha, Shaun Wright-Phillips and myself. So we would have wanted Manchester City to win the league over Man United, make no bones about that.",
      "“But at the time, we were fighting for our own survival, so we had to better other people’s results on that day to stay up. As it was, we all got beat.",
      "“I have to disagree with Wayne. Wayne is trying to say that this game is some kind of bent fixture, that the lads had given up. He does say Paddy Kenny has basically thrown the two goals in that lead to City winning the league. I don’t think Paddy knew.",
      "“You might say Paddy should have done better with the goals, but I don’t think Paddy Kenny is the type of lad to throw a game to help Man City win the league.”",
      "READ: Florian Wirtz defended with nonsense statistic from Nagelsmann blaming Liverpool teammates",
      "He then ramped up the expletives, Barton continued: “So Wayne, and the other Man United fans – and I know loads of Man United fans have come up and asked me – no. I got told by Bobby Zamora to get someone sent off, so I tried. That’s where the book stops with me.",
      "“Your conspiracy theories, Wazza, are untrue. Sometimes people tell you stuff in life and you want to believe it because it fits your narrative and you want to have that cognitive dissonance.",
      "“It might be the same fellas who were saying that if you get one more hair transplant it might come back. This might be the time you get a fringe. As you found out, that is complete nonsense.",
      "“Stop wasting your time on nonsense. The game at Man City was not thrown. Man City won the league, Man United never. Am I happy about that? Abso-f***ing-lutely, because I hate Man United. But I didn’t go out my way to make City win the league.",
      "READ: Man Utd officials ‘meeting’ UAE-based consortium today in London with Glazers ‘open’ to sale",
      "“To say that me, or Djibril Cisse, or Shaun Wright-Phillips, or Nedum Onuoha, or Paddy Kenny have somehow concocted to make sure you don’t win the league is b****cks.",
      "“You should have got yourselves in a better position. You didn’t. Man City had to beat QPR on the last day of the season at home, who were in the bottom four. That’s your fault.",
      "“The fact he’s even had a sniff of winning the league is a testament to the lads at QPR and the battle they put up, because that was an easy f***ing win for City.”",
      "Barton finished by adding: “QPR stayed up, happy days. City won the league, happy days. And you ****s were all crying on the pitch at the f***ing Stadium of f***ing Light or Middlesborough or wherever you was, which is f***ing triple whammy. Get f***ed.”",
      "READ NEXT: World Cup records that could be broken in 2026 as Messi, Mbappe and Ronaldo chase more history",
      "Manchester United legend Wayne Rooney has hit back at former Liverpool star Steven Gerrard after his comments on England’s golden generation.",
      "Wayne Rooney has been slammed for propagating a Manchester United conspiracy theory – Djibril Cisse is “not going to take this accusation any longer”.",
      "Manchester United legend Gary Neville has made a lot of middle-aged white men angry by making a fair point about division in the UK and beyond.",
      "Pundit Wayne Rooney has hit out at “rumours” suggesting Nottingham Forest could sack Ange Postecoglou after only seven games in charge.",
      "Wayne Rooney insists that Liverpool have a “clear problem” that Chelsea “exploited” as the Reds lost 2-1 in the Premier League on Saturday.",
      "Wayne Rooney has criticised Liverpool boss Arne Slot for doing something that Man Utd head coach Ruben Amorim would be “absolutely slaughtered” for."
    ]
  },
  {
    "headline": "Man Utd officials ‘meeting’ UAE-based consortium today in London with Glazers ‘open’ to sale",
    "tags": [
      "Man Utd",
      "Glazer"
    ],
    "link": "https://www.football365.com/news/man-utd-takeover-meeting-today-uae-consortium-very-serious-glazers-open-sale",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 09:24:08",
    "source": "football365",
    "body": [
      "Man Utd officials are holding a ‘meeting’ today with a United Arab Emirates-based consortium who are ‘very serious’ about buying the club, according to reports.",
      "It has been another dramatic few weeks at Old Trafford with rumours Ruben Amorim could have been sacked if Man Utd had lost badly to Sunderland before the international break.",
      "Instead, Amorim hung onto his position by beating the Black Cats 2-0 with Sir Jim Ratcliffe revealing in an interview a few days later that he would love for Amorim to stay for at least three years.",
      "Off the pitch, Saudi government official Turki Al-Sheikh caused a stir by claiming that Man Utd were close to bringing in a potential new investor who is interested in buying the club.",
      "Not revealing too many details of the deal, Al-Sheikh wrote on X: ‘The best news I heard today is that Manchester United is now in an advanced stage of completing a deal to sell to a new investor – I hope he’s better than the previous owners.’",
      "After his message caused lots of speculation, Al-Sheikh insisted he was not involved and that the mystery investor was not from Saudi Arabia.",
      "READ: Liverpool show ‘it’s not hard’ to make Ruben Amorim and his 3-5-2 work for Man United",
      "Clarifying his message earlier in the week, Al-Sheikh wrote on X: “My yesterday’s post about Manchester United’s potential sale meant one thing: the club is in an advanced negotiation phase with a new investor.",
      "“Just to clarify, I am not the investor, nor are they from my nation. I’m posting this as a fan who wishes the deal to happen, though it might not necessarily happen.”",
      "Ratcliffe, who bought 27.7 per cent of Man Utd in February 2024, has been given control of football operations as the Glazer family took more of a backseat.",
      "The INEOS founder has plans to build a new 100,000-seater stadium but has angered many people at the club with club legends, staff and fans impacted by his controversial cost-cutting exercise.",
      "There have been rumours that a UAE-based consortium have been interested in acquiring the club and now it has been confirmed by a respected X account, who broke news of Man Utd’s interest in Brighton midfielder Carlos Baleba.",
      "It is understood that Man Utd ‘officials’ will meet with the group from the UAE on Monday afternoon and the consortium are ‘very serious’ about purchasing the club from the Glazers, who are now ‘open’ to a sale.",
      "The account wrote on X: ‘Our sources at @ManUtd are reporting that United Arab Emirates-based consortium are meeting #mufc officials in London at 1pm. The UAE officials are very serious about purchasing the club. 𝐓𝐡𝐞 𝐆𝐥𝐚𝐳𝐞𝐫𝐬 𝐚𝐫𝐞 𝐨𝐩𝐞𝐧 𝐭𝐨 𝐚𝐥𝐥 𝐩𝐨𝐬𝐬𝐢𝐛𝐢𝐥𝐢𝐭𝐢𝐞𝐬.’",
      "Some Man Utd legends have been ‘approached’ by a UAE-based consortium looking to buy the club from the Glazers, according to reports.",
      "Danny Murphy has used Arne Slot’s situation at Liverpool to explain why Sir Jim Ratcliffe’s comments about Man Utd boss Ruben Amorim were “ill advised”.",
      "Are Manchester United up for sale? Why did the Saudi General Entertainment Authority chairman get involved? What do the Glazers and Sir Jim Ratcliffe think?",
      "It could be in the Glazer family’s interest to sell Man Utd ‘before February 2027’ amid takeover rumours, according to reports.",
      "Man Utd co-owner Sir Jim Ratcliffe could be “forced” to sack Ruben Amorim over results despite his claim that he’s ready to give him three years.",
      "Man Utd boss Ruben Amorim will not be sacked yet but there are reportedly still dissenting voices who want the Red Devils to talk to other managers."
    ]
  },
  {
    "headline": "Man Utd transfer ‘will’ be ‘triggered’ as Barcelona ‘shocked’ amid ‘offer to steal’ Real Madrid target",
    "tags": [
      "Man Utd"
    ],
    "link": "https://www.football365.com/news/man-utd-transfer-will-triggered-barcelona-shocked-offer-steal-real-madrid-target",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 07:57:51",
    "source": "football365",
    "body": [
      "According to reports, FC Barcelona ‘will trigger’ their option to sign Marcus Rashford permanently from Manchester United next summer.",
      "Barcelona took a punt on Rashford in this summer’s transfer window as they signed him from Man Utd on loan with an option to buy.",
      "The Spanish giants sanctioned a move for Rashford after failing to land Nico Williams and Luis Diaz following his return to form on loan at Aston Villa.",
      "Rashford’s versatility also tempted Barcelona to secure his services and this has been useful this season as the England international has played on either flank and up front this term.",
      "The 27-year-old has also overcome a slow start to this season to sparkle for Barcelona in recent weeks, grabbing three goals and five assists in his ten appearances across all competitions.",
      "READ: Liverpool show ‘it’s not hard’ to make Ruben Amorim and his 3-5-2 work for Man United",
      "Now, a report from The Sun claims Barcelona are ‘ecstatic’ with Rashford and they ‘will trigger’ a permanent deal next year which will be worth around £30m.",
      "Barcelona chiefs are said to be ‘impressed with his work ethic and talent’ as they ‘initially feared that there must be something wrong with him’.",
      "A source for The Sun said: “Barcelona had an issue with signing Marcus initially, which was the club’s financial situation. But they also thought United were playing a game because they were willing to let him go.",
      "“They thought it was too good to be true — there must be something wrong with him. His brother Dwaine persuaded them there was nothing wrong — and that he wasn’t going to mess them about.",
      "“Barca are now really shocked that they could sign him for what they see as a bargain.”",
      "The exit of Rashford raises funds for necessary signings next year and Crystal Palace standout Adam Wharton is reportedly one of their key targets.",
      "A report from Fichajes claims Real Madrid are also in for Wharton, Man Utd ‘want to steal’ the signing and are ‘willing to offer’ around £60m to secure his services.",
      "The report claims:",
      "‘Manchester United are looking to strengthen their midfield and see Wharton as an ideal option for the future. With players like Casemiro and Kobbie Mainoo likely to leave, the club believes a £60 million offer could be enough to convince Crystal Palace to sell the young midfielder.",
      "‘On the other hand, Real Madrid has also shown interest in Wharton, seeing him as a possible successor to Toni Kroos. However, Crystal Palace has set an exit clause of over 80 million euros, which could make an immediate transfer difficult. Despite this, the Spanish club continues to closely monitor his development.’",
      "According to reports, Marcus Rashford’s hopes of joining FC Barcelona from Manchester United permanently have been given a new ‘massive boost’.",
      "In 15 damning words, Rashford summed up his struggles at Man Utd and why Sir Jim Ratcliffe hasn’t already sacked Ruben Amorim.",
      "Manchester United are being linked with a ‘shock’ £60m Manchester United transfer that’s no ‘shock’ at all.",
      "Manchester United have supposedly been dealt a ‘double blow’ regarding Adam Wharton and Oliver Glasner, but it’s actually only one ‘blow’…",
      "According to reports, Manchester United have already decided whether to give FC Barcelona loanee Marcus Rashford a ‘surprise lifetime’.",
      "We all love to laugh at Man Utd players thriving away from Old Trafford, but Liverpool have more players in the top ten Premier League defectors of the season."
    ]
  },
  {
    "headline": "Roy Keane reveals one Man Utd decision he was ‘ashamed’ of under Sir Alex Ferguson",
    "tags": [
      "Man Utd",
      "Ferguson",
      "Roy Keane"
    ],
    "link": "https://www.football365.com/news/man-utd-roy-keane-decision-ashamed-fa-cup-sir-alex-ferguson",
    "image": "https://www.football365.com/content/themes/f365-sportsui/img/png/placeholder.png",
    "date": "2025-10-13 07:20:24",
    "source": "football365",
    "body": [
      "Roy Keane insists everyone at Man Utd should feel “pretty ashamed” about pulling out of the FA Cup to compete in the Club World Cup in 2000.",
      "The Red Devils won the Treble in the previous season with Sir Alex Ferguson’s side beating Bayern Munich in that famous Champions League final, to add that prize to the Premier League and FA Cup trophies they had already won.",
      "However, they accepted the Football Association’s invitation to withdraw from the FA Cup in 2000 in order to compete in the inaugural World Team Championship, which went on to be called the Club World Cup.",
      "Chelsea beat Aston Villa in the FA Cup final that year as Man Utd failed to defend their title with the FA believing the Red Devils’ participation at the Club World Cup could help England’s bid for the 2006 World Cup, which was awarded to Germany.",
      "Man Utd could not make it out the group stage with Brazilian giants Vasco da Gama and Mexican outfit Necaxa qualifying ahead of them as they won just one match.",
      "Keane, who was captain of Man Utd during the controversial move under Ferguson, insists that Man Utd “should be pretty ashamed” of their decision.",
      "READ: How Man Utd failed to land Viktor Gyokeres as agent and Fabrizio Romano explain transfer failure",
      "Neville said on the Stick to Football podcast: “I think one thing that was definitely better back in the day was the FA Cup. That was magic when we were playing.”",
      "Before Keane said: “I think the magic has come back a bit the last few years now.",
      "“When you think of it when we were at United, we should be pretty ashamed because we pulled out of the FA Cup.",
      "“I know it wasn’t down to us but we accepted it as players. How mad was that, your team pulling out of the FA Cup.”",
      "Former Man Utd chairman Martin Edwards said in June 1999: “We realise that many of our supporters will be as disappointed as we are with our decision not to compete in the FA Cup.",
      "“Manchester United see this as an opportunity to compete for the ultimate honour of being the very first world club champions.”",
      "Before legendary manager Ferguson added: “We can’t go for them all. We can’t play in the FA Cup and in Brazil. That would be impossible.",
      "“We’re in a no-win situation here. The criticism we would have received if we hadn’t gone [to Brazil] would have been unthinkable – and that’s a Scotsman speaking.”",
      "Speaking years later, Ferguson admitted he regretted the decision, he told Inside United: “It turned out to be a disaster for us. We did it to help England’s World Cup bid. That was the political situation.",
      "“I regretted it because we got nothing but stick and terrible criticism for not being in the FA Cup when really, it wasn’t our fault.",
      "“The FA and the government felt that playing in this tournament would help England’s bid to host the 2006 World Cup. There was a lot of undue criticism – but it was a great two-week break.”",
      "Former Manchester United midfielders Roy Keane and Paul Scholes have disagreed who the best in the league is, with the former picking an Arsenal man “every day of the week.”",
      "Ruben Amorim’s future at Manchester United remains precarious and there have been no shortage of potential candidates to take over.",
      "Roy Keane has named a manager who would “create havoc” as his preferred option replace under-fire Ruben Amorim at Man Utd.",
      "Why hasn’t Sir Jim Ratcliffe picked up the phone to Roy Keane about the Manchester United manager’s job? Erm. How long have you got?",
      "Manchester United legend Rio Ferdinand has made a prediction relating to Luke Shaw after the England international was heavily criticised by Roy Keane.",
      "Mikel Arteta isn’t a gambler like Sir Alex Ferguson was, and that could cost Arsenal the Premier League title, says Man Utd legend Roy Keane."
    ]
  },
  {
    "headline": "Man Utd latest: Leaving for Barcelona has boosted my WC chances, says Rashford",
    "tags": [
      "Man Utd",
      "Rashford"
    ],
    "link": "https://www.skysports.com/football/live-blog/11667/13025492/man-utd-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-man-utd-news-club_7039262.jpg?20251002160459",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 14 October 2025 22:43, UK"
    ]
  },
  {
    "headline": "Greatest PL goals | Liverpool v Man Utd",
    "tags": [
      "Man Utd",
      "LIVE"
    ],
    "link": "https://www.skysports.com/football/video/16460/11837781/man-utd-vs-liverpool-greatest-goals",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-liverpool-manchester-united_7050710.jpg?20251014121121",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 14 October 2025 12:14, UK"
    ]
  },
  {
    "headline": "Man Utd squad 'behind Amorim and his philosophy'",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11095/13447108/ruben-amorim-has-man-utd-squads-support-as-sir-jim-ratcliffe-takes-patient-approach-with-head-coach",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-ruben-amorim-man-utd_7046129.jpg?20251008174820",
    "date": null,
    "source": "skysports",
    "body": [
      "Man Utd director of football Jason Wilcox has canvassed the opinion of some of the players - as he would in normal conversations around the training ground - and the consensus is that the squad are happy with Ruben Amorim",
      "Wednesday 8 October 2025 20:34, UK",
      "Sir Jim Ratcliffe, the minority owner at United, has said he wants to give his first managerial appointment at Old Trafford three years to prove himself as a \"great coach\" and that patience extends to the players.",
      "United's director of football Jason Wilcox has canvassed the opinion of some of the United players - as he would in normal conversations around the training ground - and the consensus is that the squad are happy with Amorim.",
      "Of course, there is empathy and understanding that perhaps the likes of Kobbie Mainoo and Joshua Zirkzee, for example, may not be fully content with the lack of game time they have had so far this season.",
      "But, for the most part, it seems clear, as of now, that the Portuguese has the backing of the group - some of whom, most notably Bryan Mbeumo and Mason Mount, have said so publicly in recent interviews.",
      "Ultimately, this is a United side that is suffering from scars from a mentally tough previous season - finishing 15th as well as losing a European final. They have lost a lot of games as well, 21 of Ruben Amorim's 50 in charge.",
      "But despite disappointing losses and performances to the likes of Grimsby and Brentford, there is still a feeling of optimism inside the walls of Carrington.",
      "United feel, despite some of the poor results, that their data and metrics show that this side are improving. The eye test suggests that they are as well, looking at the performance against Arsenal, and first halves against Burnley and Sunderland.",
      "The Sunderland performance demonstrated flexibility from Amorim, something he has been accused of lacking. The team defended in a 4-4-2 and attacked in a 3-4-3.",
      "They look like they have a potential emerging No 1 in Senne Lammens. Benjamin Sesko had by far his best game for United so far, his pressing and ability to bring others into play were particularly impressive.",
      "United's ultimate aim for this season is a return to European football. Whether that is the Champions League, Europa League or Conference League - we will have to wait and see where this team can end up, but the reality is this team is still being rebuilt.",
      "The next run of fixtures will give all watching a better indication of what will be possible this season - with away trips to Liverpool, Nottingham Forest and Tottenham and just the one home fixture to Brighton before the next break - no matter how the results go, we will learn a lot.",
      "The £200m new look front line of Bryan Mbeumo, Benjamin Sesko, Matheus Cunha all look back to match fitness, as well as Mount, who scored a lovely goal against Sunderland before the break.",
      "If United can rescue a positive season from a rollercoaster start, there is room for optimism next summer in what could be an intriguing transfer window for United.",
      "With big contracts set to expire, there will have to be decisions made on the likes of Harry Maguire and Casemiro.",
      "There is a realistic prospect that the Brazilian's contract won't be renewed next summer and his three-year stay at United could come to an end.",
      "If that does happen, the freed-up space on the wage bill would represent an opportunity for United to strengthen in that area of the pitch.",
      "A midfielder remains a key area for United to strengthen next summer and although they have been long-term admirers of Brighton's Carlos Baleba, he is just one of a number of players they have looked at in the position.",
      "After a £50m redevelopment of the men's first-team training facility completed in the summer, United's next aim at Carrington is to upgrade their academy facilities.",
      "United have gone through change at their academy leadership level - with new academy director Stephen Torpey succeeding Nick Cox, who has joined Everton as technical director.",
      "With Torpey's recent arrival, United, led by director of football Wilcox, are keen to accelerate plans to rebuild the academy in the hope the facilities will match some of the best in the world.",
      "United decided not to develop the academy facilities at the same time as the men's first team as it would have been too disruptive on site, but having invested in both the men's and women's facilities in recent years, their next focus is the academy.",
      "United have some exciting emerging talents such as 15-year-old JJ Gabriel, who has been starring for Darren Fletcher's U18 side.",
      "Closer to the first team, U21 attacking midfielder Shea Lacey was seen training with the England first team during this international break.",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Amorim vs Arteta: How do their records in first 50 games compare?",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11661/13447450/ruben-amorim-vs-mikel-arteta-sir-jim-ratcliffe-backs-man-utd-boss-but-how-does-his-record-at-50-games-compare",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-ruben-amorim-mikel-arteta_7046708.jpg?20251009122234",
    "date": null,
    "source": "skysports",
    "body": [
      "Sir Jim Ratcliffe mentioned Arsenal's faith in Mikel Arteta when saying he would like to give Ruben Amorim three years at Man Utd, but how does his record in his first 50 games in charge compare? Have your say in our poll",
      "Thursday 9 October 2025 13:10, UK",
      "Sir Jim Ratcliffe has cited Mikel Arteta's \"miserable\" start as Arsenal boss as a reason to have patience with Manchester United's under-fire head coach Ruben Amorim. But how do their first 50 games in charge really compare?",
      "\"Ruben needs to demonstrate he is a great coach over three years,\" the Manchester United minority owner told The Business podcast. \"Football is not overnight. It's three years. You also look at Arteta. He had a miserable time over the first couple of years.\"",
      "Arteta has gone on to justify the club's faith by turning Arsenal into consistent Premier League title challengers. But does Amorim have Manchester United on the same path to long-term success? And what do their records after 50 games in charge tell us?",
      "While Arsenal were a long way below their current level in Arteta's first 50 games between December 2019 and April 2021, their record was much better than that of Amorim's Manchester United.",
      "Arteta won 27 of his first 50 games compared to Amorim's 19, giving him a win rate of 54 per cent to Amorim's 38 per cent. Arteta lost 13 games to Amorim's 19, drawing 12 to Amorim's 10.",
      "The goals scored columns are nearly identical, with Arsenal scoring 79 times to Manchester United's 78 under Amorim. But there is a big difference in goals conceded, with Amorim's side having let in nearly 60 per cent more than Arsenal, on 76.",
      "Arsenal kept 18 clean sheets in Arteta's first 50 games, hinting at his capacity to make the side more difficult to beat. Manchester United, by contrast, have only managed eight shut-outs under Amorim. They have conceded three or more goals on nine occasions, something that only happened three times in Arteta's first 50 games at Arsenal.",
      "Arteta inherited a team sitting 10th in the Premier League when he took the Arsenal job in December 2019. Manchester United were lower, in 14th, when Amorim took over at Manchester United.",
      "Arteta oversaw slight improvement relative to his starting position, although Arsenal's eighth-placed finish at the end of his first campaign, which included the interruption of the Covid pandemic, was the club's lowest since coming 10th in 1992/93.",
      "Manchester United finished even lower than the position in which Amorim found them at the end of his first season, coming 15th in a record-low for the club, with a points total of 42 to Arsenal's 56 in Arsenal's first season under Arteta.",
      "Both managers reached cup finals at the end of their first seasons. But while Arteta guided Arsenal to FA Cup success, beating Chelsea in the final having overcome Manchester City in the last four, Amorim suffered Europa League disappointment against Spurs.",
      "Arteta was unable to improve on Arsenal's eighth-placed finish in his first full season in charge, with Arsenal ending up in the same spot in the table. They were ninth at the time of his 50th game, a 3-0 loss to Liverpool at the Emirates Stadium in April 2021, only a place higher than Manchester United's position at Amorim's half-century.",
      "Arteta showed pragmatism in winning the FA Cup, moving away from his favoured 4-2-3-1, which has subsequently evolved into a 4-3-3, and instead using a back three, a change he said was intended to make the most of the players at his disposal at that time.",
      "Amorim has taken a more rigid approach, sticking to his favoured 3-4-2-1, despite external pressure to adapt his system. While Arteta showed variation in his starting formations in his first 50 games, Amorim has used a back three consistently, the only variation from 3-4-2-1 being 3-4-3, which he has used five times.",
      "Bukayo Saka is the only player from Arteta's first Arsenal line-up still at the club this season. The England international was used as a left-back in their 1-1 draw with Bournemouth on Boxing Day in 2019.",
      "There has been turnover at Manchester United under Amorim too, albeit in a shorter time frame, with five players who started the 1-1 draw with Ipswich in his first game in November of last year having gone, either on loan or permanently, in Andre Onana, Jonny Evans, Christian Eriksen, Alejandro Garnacho and Marcus Rashford.",
      "The pace of change was relatively slow initially for Arteta at Arsenal, although he was able to include Gabriel Magalhaes, Martin Odegaard and Thomas Partey in his team for the defeat to Liverpool at the Emirates Stadium in his 50th game.",
      "Amorim enjoyed a win to mark his half-century as Manchester United beat Sunderland 2-0 last weekend with a starting line-up which included three new signings.",
      "Arsenal's transfer spending has ramped up in recent years, culminating in this summer's record £257m spend. But the club's outlay was more modest over the course of Arteta's first 50 games.",
      "Arteta mostly had to rely on loan signings and free transfers, with spending totalling only £81.5m across two transfer windows. Partey and Gabriel were the only players signed for significant fees.",
      "Manchester United have brought in fewer players under Amorim but spent considerably more in transfer fees, with Benjamin Sesko, Bryan Mbeumo, Matheus Cunha, Senne Lemmens, Diego Leon and Ayden Heaven arriving for a combined £232.4m, dwarfing Arsenal's figure in Arteta's first two transfer windows.",
      "As for sales, Arsenal only received a fee for one player during Arteta's first 50 games, with Emiliano Martinez sold to Aston Villa for £17m.",
      "Manchester United have been more successful on that front, recouping £61.7m from the sales of Garnacho and Antony.",
      "Have your say on which manager has done a better job in his first 50 games in charge in the poll below.",
      "Let us know whether you think Amorim will come good long-term.",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Ratcliffe: I want to give Amorim three years to prove himself at Man Utd",
    "tags": [
      "Man Utd",
      "Ratcliffe",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11667/13446960/ruben-amorim-sir-jim-ratcliffe-wants-to-give-under-pressure-manchester-united-head-coach-three-years-to-prove-himself",
    "image": "https://e0.365dm.com/25/09/768x432/skysports-premier-league-manchester-united_7036176.jpg?20250929140654",
    "date": null,
    "source": "skysports",
    "body": [
      "Man Utd head coach Ruben Amorim is under pressure after a mixed start to the season followed last term's 15th-placed finish; Man Utd's minority owner Sir Jim Ratcliffe has given him a huge vote of support: \"Ruben needs to demonstrate he is a great coach over three years.\"",
      "Thursday 9 October 2025 07:24, UK",
      "Manchester United minority owner Sir Jim Ratcliffe has said he wants to give under-pressure head coach Ruben Amorim three years in the job to prove himself.",
      "Amorim is approaching the first anniversary of his appointment at Old Trafford, but his position has been under constant scrutiny since he took over on November 1 last year.",
      "He has failed to record back-to-back Premier League wins during that time, coming 15th last season - their worst top-flight finish since 1974 - and things have not improved much since the summer as United were knocked out of the Carabao Cup by League Two Grimsby in August.",
      "That has led to suggestions Amorim's job is under threat, but Ratcliffe said the 40-year-old is a \"good guy\" and has time to turn things around.",
      "\"Ruben needs to demonstrate he is a great coach over three years,\" he told The Business podcast, produced by The Times and The Sunday Times.",
      "Asked if Amorim is going to get three years, Ratcliffe replied: \"Yes. That is where I would be. Three years. Because football is not overnight.",
      "\"It's three years. You also look at [Mikel] Arteta at Arsenal. He had a miserable time over the first couple of years.",
      "\"We have to be patient. We have a long-term plan. It isn't a light switch.",
      "\"You can't run a club like Manchester United on knee-jerk reactions to some journalist who goes off on one every week.\"",
      "Ratcliffe has owned just under 30 per cent of United through his chemicals company INEOS since February 2024, taking over control of football operations at the club.",
      "That still left the Glazer family, who have been the subject of numerous fan protests over their handling of the club since taking over in 2005, in overall charge.",
      "Asked what would happen if the Glazers told him to sack Amorim, Ratcliffe said: \"It's not going to happen.\"",
      "The INEOS boss added the Glazers were happy for him to take charge, adding: \"That probably sums it up. We're local and they're the other side of the pond.",
      "\"That's a long way away to try and manage a football club as big and complex as Manchester United. We're here with feet on the ground.",
      "\"They [the Glazers] get a bad rap... but they are really nice people and they are really passionate about the club.\"",
      "Ratcliffe has come in for criticism of his own after controversial cuts designed to drive down costs saw around 450 jobs axed and the removal of perks like subsidised staff lunches.",
      "\"The costs were just too high. There are some fantastic people at Manchester United, but there was also a level of mediocrity and it had become bloated,\" he said.",
      "\"I got a lot of flak for the free lunches, but no one's ever given me a free lunch.",
      "\"The biggest correlation, like it or not, between results and any external factor - is profitability. The more cash you have got, the better squad you can build.",
      "\"So a lot of what we have done in the first year is spend an awful lot of time putting the club on a sustainable, healthy footing.",
      "\"We're not seeing all the benefits of the restructuring that we've done in this set of (financial) results (United last month reported record revenues of £666.5million for last season but a loss of £33million for the financial year) and we were not in the Champions League.",
      "\"Those numbers will get better. Manchester United will become the most profitable football club in the world, in my view, and from that will stem, I hope, a long-term, sustainable, high-level of football.\"",
      "Ratcliffe says he wants to give his first managerial appointment at Old Trafford three years to prove himself as a \"great coach\" and that patience extends to the players.",
      "United's director of football Jason Wilcox has canvassed the opinion of some of the United players - as he would in normal conversations around the training ground - and the consensus is that the squad are happy with Amorim.",
      "Of course, there is empathy and understanding that perhaps the likes of Kobbie Mainoo and Joshua Zirkzee, for example, may not be fully content with the lack of game time they have had so far this season.",
      "But, for the most part, it seems clear, as of now, that the Portuguese has the backing of the group - some of whom, most notably Bryan Mbeumo and Mason Mount, have said so publicly in recent interviews.",
      "\"We all know how football works. Before the next international break, Man Utd have got four games, Liverpool, Brighton, Forest and Spurs.",
      "\"What happens if they lose all those games? There will be another international break. Everybody will be talking about Ruben Amorim's future again.",
      "\"This is a very significant intervention by Jim Ratcliffe to come out and back Ruben Amorim. I personally think the backing is not 100 per cent. If you actually look at the quotes, he's not coming out and saying come what may, Ruben Amorim is not leaving. He will be the head coach for the next three years.",
      "\"He's just saying 'Ruben needs to demonstrate he's a great coach over three years'. 'We have to be patient'. 'We have a long-term plan'. 'It isn't a light switch'.",
      "\"It's not a light switch, but Manchester United are one of the biggest clubs in the world. I would say the only clubs that really compare to them on a worldwide basis are Real Madrid and Barcelona.",
      "\"What would journalists in Spain who cover Real Madrid or Barcelona be saying if Real Madrid finished 15th in the table? What would they be saying if their new manager was bottom of the table when it came to results since he'd taken over?\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Maguire's retrial in Greece postponed again due to 'untranslated documents'",
    "tags": [
      "Maguire"
    ],
    "link": "https://www.skysports.com/football/news/11667/13447088/harry-maguire-manchester-united-defenders-retrial-in-greece-postponed-again-due-to-untranslated-documents",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-harry-maguire-man-utd_7046051.jpg?20251008164916",
    "date": null,
    "source": "skysports",
    "body": [
      "Harry Maguire's retrial over an altercation in Mykonos has been postponed for a fourth time due to untranslated documents; hearing in Syros, Greece, was due to start on October 8 but has been rescheduled to March 4, 2026",
      "By Danyal Khan and Amar Mehta",
      "Wednesday 8 October 2025 16:21, UK",
      "Harry Maguire's retrial over an altercation in Mykonos has been postponed for a fourth time because \"court documents have not been translated into English\".",
      "The hearing in Syros, Greece, was due to start on October 8 but has been rescheduled to March 4, 2026.",
      "Maguire, who was not required to attend in person, was arrested after a fight involving his family outside a bar in August 2020.",
      "The Manchester United defender was convicted of attacking and attempting to bribe police officers in 2020, but a retrial was granted on appeal, and his conviction was \"nullified\" in accordance with Greek law.",
      "Maguire and his team are understood to have done everything necessary for the trial to go ahead.",
      "Dr Paradissis is confident the case will conclude next year, before the Statute of Limitations expires in 2028."
    ]
  },
  {
    "headline": "Transfer Centre LIVE! 'Not his fault' - Nagelsmann defends Wirtz",
    "tags": [
      "LIVE"
    ],
    "link": "https://www.skysports.com/football/live-blog/31771/12476234/transfer-centre-live-football-transfer-news-updates-and-rumours",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-wirtz-liverpool-chelsea_7042225.jpg?20251004231148",
    "date": null,
    "source": "skysports",
    "body": [
      "Tuesday 14 October 2025 22:57, UK"
    ]
  },
  {
    "headline": "Neville: Amorim 'not off the hook' despite win",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11667/13444733/gary-neville-on-manchester-united-ruben-amorim-not-off-the-hook-despite-sunderland-win",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-ruben-amorim-manchester-united_7042217.jpg?20251004225537",
    "date": null,
    "source": "skysports",
    "body": [
      "Saturday 4 October 2025 23:14, UK",
      "Gary Neville thinks Ruben Amorim is \"not off the hook\" despite Manchester United's important 2-0 win over Sunderland.",
      "\"It was a must-win game and I don't think it lets him off the hook,\" Neville said on the Gary Neville Podcast.",
      "\"There's too many defeats, the record's too poor so I don't think anybody will be celebrating too much tonight at Manchester United but I think they'll be relieved that there is a victory which allows a little bit of peace going into the international break.",
      "\"Manchester United win the odd game but that's nowhere near enough. I don't think anybody would be kidded on by the fact that Manchester United beat Sunderland at home. The fact that it was even in doubt before the game is probably the problem in itself.\"",
      "Amorim said ahead of the game that he is convinced criticism from within the media is affecting his players and their confidence in his much-maligned 3-4-3 system. He said: \"My players, I guarantee you, they are listening to all the opinions and they are putting that inside because we are not winning games. They have to believe in me. So my biggest problem is that my players believe in you guys when you say the problem of our team is the system.\"",
      "That view was put to Neville, who hit back.",
      "He said: \"If pundits are getting into your head then you shouldn't be playing for the club.",
      "\"Do people not remember Alan Hanson criticising us when we broke in as young kids saying that you can't win anything with kids. That was the greatest centre-back of all time at that moment talking about us as if we were, you know, inferior and nowhere near good enough.",
      "\"Did they not think that we got criticised during our football careers. I'm sorry you're playing for Manchester United - it comes with the territory, you've got to step up.",
      "\"They've been hopeless in the system. If it's not the system, then the players are a problem, the manager is a problem, the whole thing's a problem if you're losing football matches to the level that they've been doing.",
      "\"I never blamed anybody else when we lost football matches and I played in a dressing room that when you lost football matches you came in and you said sorry. There was accountability. Why would you blame other people. I've not got any time for excuse mentality shortcuts blaming other people - it's the worst thing that you can do in life.",
      "\"I think they just need to concentrate on doing their jobs and doing it well and winning football matches. The only thing that's going to shut anybody up is winning football matches and they've not won anywhere near enough.\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Papers: Maguire wants Man Utd stay - but must take pay cut",
    "tags": [
      "Man Utd",
      "Maguire"
    ],
    "link": "https://www.skysports.com/football/transfer-paper-talk/12709/13446722/harry-maguire-wants-to-stay-at-manchester-united-but-will-have-to-accept-a-pay-cut-paper-talk",
    "image": "https://e0.365dm.com/25/03/768x432/skysports-paper-talk-brand-refresh_6852897.jpg?20250311094415",
    "date": null,
    "source": "skysports",
    "body": [
      "Plus: Bournemouth are prepared for serious interest in Antoine Semenyo after his strong start to the season; former Arsenal midfielder Jack Wilshere is being linked with the Luton Town job; Danny Rohl is keen for managerial return amid Rangers links",
      "Wednesday 8 October 2025 23:16, UK",
      "The top stories and transfer rumours from Wednesday's newspapers...",
      "talkSPORT",
      "Harry Maguire wants to stay at Manchester United - but is likely to have to take a hefty pay-cut in order to do so, with his current deal expiring next summer.",
      "Bournemouth are braced for serious interest from England's biggest clubs in Antoine Semenyo if he continues his stunning form.",
      "Former Sheffield Wednesday manager Danny Rohl is keen to return to the dugout at the earliest opportunity.",
      "DAILY MAIL",
      "Joshua Zirkzee's frustration with his current situation at Manchester United has reached a point where he is looking for an exit route in January.",
      "DAILY MIRROR",
      "Former Arsenal and England star Jack Wilshere is one of the leading contenders for the top job at Luton Town after the Hatters parted ways with Matt Bloomfield on Monday.",
      "THE ATHLETIC",
      "Manchester United's under-21s and U18s set to be housed in temporary cabins in the players' car park as no plans were made for their inclusion in the revamped training complex.",
      "THE TELEGRAPH",
      "Gregor Townsend has begun spearheading recruitment at Newcastle Red Bulls, with Tom Willis and Ben White emerging as players of interest.",
      "EDINBURGH EVENING NEWS",
      "Hearts plan to resist any attempt by Rangers to lure head coach Derek McInnes to Ibrox.",
      "Dharmesh Sheth is joined by the best journalists from the Sunday papers to offer their expert insight.",
      "Join them from 9am to 11am every Sunday for the new-look Sunday Supplement."
    ]
  },
  {
    "headline": "Sesko scores first Old Trafford goal in huge win for Amorim",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/premier-league-highlights/video/36504/13444525/man-united-2-0-sunderland-premier-league-highlights",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-man-united-sunderland_7041706.jpg?20251004171804",
    "date": null,
    "source": "skysports",
    "body": [
      "Saturday 4 October 2025 17:29, UK"
    ]
  },
  {
    "headline": "Amorim pressure eased as Man Utd beat Sunderland",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/man-utd-vs-sunderland/report/531196",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-benjamin-sesko-man-utd_7041455.jpg?20251004153952",
    "date": null,
    "source": "skysports",
    "body": [
      "Sunday 5 October 2025 10:48, UK",
      "Manchester United made it three wins in a row at Old Trafford as they eased the pressure on Ruben Amorim with a 2-0 win over Sunderland.",
      "Mason Mount, selected ahead of Matheus Cunha, scored a fine opening goal before Benjamin Sesko netted at Old Trafford for the first time in front of his home supporters. Sunderland struggled to cope and even switched to 3-4-3 in a bid to alter the flow.",
      "There were flashes from Regis Le Bris' side that hinted at their confident start to the campaign, Bertrand Traore almost opening the scoring and Granit Xhaka firing off a shot. They also thought they had a penalty against Sesko but VAR rightly overruled it.",
      "Man Utd: Lammens (7), Shaw (6), De Ligt (7), Yoro (6), Dalot (7), Amad (7), Casemiro (6), Fernandes (7), Mount (8), Mbeumo (7), Sesko (8).\n\n\nSubs: Dorgu (6), Cunha (6), Mainoo (6), Ugarte (n/a), Maguire (n/a).\n\n\nSunderland: Roefs (7), Hume (5), Mukiele (6), Alderete (5), Masuaku (6), Xhaka (7), Sadiki (6), Le Fee (6), Traore (5), Adingra (6), Isidor (6).\n\n\nSubs: Ballard (6), Mayenda (5), Talbi (6), Brobbey (6), Geertruida (7).\n\n\nPlayer of the Match: Mason Mount.",
      "But United were the better side and could have punished the visitors even more but for Robin Roefs pulling off some good saves, including a fingertip effort to deny Bruno Fernandes. Senne Lammens, making his United debut, was less busy at the other end.",
      "Mason Mount's opener for Manchester United against Sunderland rounded off an 18-pass move, the joint-most for a goal in the Premier League this season.",
      "Lammens' best save came late in the game when he kept out a Chemsdine Talbi effort with his legs but the Belgian goalkeeper was hardly overworked. There were bigger cheers when he claimed a cross in stoppage time, his second good claim of the game.",
      "Manchester United kept their first clean sheet of the season in what was also Senne Lammens' debut for the club.",
      "How United need that sort of commanding presence in goal with supporters unconvinced by the performances of Altay Bayindir. Lammens, signed from Antwerp late in the window, also looked composed when kicking with his right and left foot.",
      "There was one hairy moment when he chased out of his goal on the angle only to see Traore get there first amid some uncertainty with Fernandes. But as debuts go, this was a fine effort from a 23-year-old goalkeeper with a huge task ahead of him.",
      "Manchester United head coach Ruben Amorim in the press conference:",
      "\"I think he looked confident in the first game. But the important thing is that the teammates helped Senne to have a good game. Because everyone was focused, not a lot of mistakes against a team that was really comfortable playing football.\"",
      "Asked why he delayed starting him, Amorim added: \"He arrives and you can feel it that he needs to adapt. New country, new training, the pressure that you guys put on the goalkeepers are massive. So it was like a little preparation for the guy to be ready to start his first game.",
      "\"But now it's just one game and he needs to work. Because he needs to be prepared that in our club things are really hard. But he did well in the game. He was comfortable during the game and that is a very good sign.\"",
      "Asked whether the international break denies United the opportunity to build momentum, Amorim joked that \"there is no momentum with our team\" - a reference to the fact that they are still looking for back-to-back Premier League wins under him.",
      "But Amorim was encouraged by the performance. When asked about Mount's comments that the players were 100 per cent behind their coach, the Portuguese suggested that the performance was proof of that.",
      "\"I saw it today. And I know they want to do the best and I know they don't want to change the coach all the time.",
      "\"We need to show with actions. Sometimes when we look at our team, I know for sure that when we see the games in the end I know sometimes we can do better. I feel it during the week but we need to show it on the pitch.\"",
      "It is easy to talk about heart, about shape, about defending with your lives - something which has provided the platform for some impressive results for Sunderland against Crystal Palace and Nottingham Forest. But resolve only gets you so far.",
      "At some point, you have to hurt teams and possess quality in the final third. And at Old Trafford, Sunderland looked woefully short in that department, creating just 0.71 worth of expected goals and rarely testing Lammens, who would have been feeling it ahead of his United debut.",
      "And while it's fair to say United were efficient rather than exceptional once racing into their 2-0, the gap in quality was undeniable. This was a bit of a reality check. A performance that strips back the optimism and lays bare the challenge ahead of survival.",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  },
  {
    "headline": "Amorim: We have no momentum | 'We’re a different team home and away!'",
    "tags": [
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/video/34070/13444724/ruben-amorim-we-have-no-momentum-we-re-a-different-team-home-and-away",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-ruben-amorim-man_7042046.jpg?20251004194647",
    "date": null,
    "source": "skysports",
    "body": [
      "Saturday 4 October 2025 19:58, UK"
    ]
  },
  {
    "headline": "'I won't resign!' Amorim comes out fighting on system and Man Utd future",
    "tags": [
      "Man Utd",
      "Amorim"
    ],
    "link": "https://www.skysports.com/football/news/11667/13443543/ruben-amorim-says-he-wont-resign-from-man-utd-job-and-insists-his-system-is-not-the-problem-as-pressure-builds",
    "image": "https://e0.365dm.com/25/10/768x432/skysports-ruben-amorim-man-utd_7040133.jpg?20251003135425",
    "date": null,
    "source": "skysports",
    "body": [
      "Saturday 4 October 2025 14:54, UK",
      "Ruben Amorim said he has no plans to walk away from the Manchester United job and insisted his system is not to blame for their struggles in an impassioned press conference.",
      "HIs side face Sunderland on Saturday having suffered a third Premier League loss of the season against Brentford which left them 14th in the table and increased the pressure on the head coach.",
      "Ahead of Saturday's game at Old Trafford, read the full transcript as Amorim outlines his determination to turn Manchester United's form around, denies reports he is unhappy in Manchester, and argues that he used 4-4-2, rather than a back three, against Brentford.",
      "AMORIM: \"Because the worst thing in this job is to not win games. That is the same feeling I had in Casa Pia when I lost in the third division.",
      "\"And then it's a job. Of course, it's a dream to be here. And I want to continue here. And I want to fight for this. But the problem is now, what makes me suffer is to lose games, not to lose my job.",
      "\"You fear to lose your job when you have to pay the bills and I don't have that feeling. I just want to continue this. But when we don't win games, that is the suffering that I have. It is not the fear of losing the job. I don't care.",
      "\"I'm telling you when we finish the game and you can see me, I don't care about my job. That hurt of not winning games or failing. That is the thing that hurts me the most.\"",
      "AMORIM: \"That is a decision of the board. I cannot do that. Sometimes I have that feeling and losing is hard. It's so frustrating when you create the momentum, go to the next game, and something happens.",
      "\"That feeling sometimes hurts me a lot. Also the players and especially the staff here.",
      "\"But that is not my decision. And I think it would be really hard to leave if I don't do everything to follow my career here.\"",
      "AMORIM: \"It's really important because there is no one in the world that can read everything and listen to everything about people that understand football and not be influenced by that.",
      "\"So I'm trying to listen and to see all the games because I know that I see the game more times than all those guys together because they have to see all the games in the Premier League and give an opinion.",
      "\"My opinion is completely different because I see the games, I see the training, I understand my players, I understand what I'm doing and I follow my job this way because it's impossible to survive in this club, listening to all the things.",
      "\"I see a lot of things that my wife is talking with the media. That is such nonsense.",
      "\"Nobody in my family talks about that. We love living in England. You have no idea what is abuse here because you are so polite compared to my country where we are losing. So you have no idea. My family is really happy.",
      "\"It's just me and my family that is struggling because I hate losing and I hate failing.\"",
      "AMORIM: \"I'm not concerned about that and nobody here is naive. We understand that we need results to continue the project.",
      "\"We will reach a point that is impossible for everyone because this is a very big club with a lot of sponsors, with two owners. So it's hard. That balance is really hard. So I'm not concerned about that.",
      "\"What I want is to see my team winning or losing playing the same way and we are not doing that, in the simple things of playing football that anyone can do.",
      "\"So my biggest problem is [if] my players believe in you guys when they say the problem of our team is the system.",
      "\"I get crazy about that because I can see the team, I see this team playing in a different system.",
      "\"We need to play the same way with the same power with the same intensity with the same focus. If you do that, the system doesn't matter.\"",
      "AMORIM: \"It doesn't matter. I just need one more game because football is like that. We need one more game, we win, we get some hope and then in the next game we'll see.",
      "\"That is always the same thing, so I don't need a lot of time. It doesn't matter for me, it's just the next game that matters and the next game is [Saturday]. We just have to perform and we need to win.\"",
      "AMORIM: \"It's the results. Imagine that we won the first game against Arsenal and then you don't miss the penalty and you win against Fulham, even without playing really well. Imagine that this happened.",
      "\"The trust in everything about our club, the system, the way we play, would be completely different.",
      "\"So, if you win, everything is okay. If you lose, you are doubting everything about yourself, about your team-mates, about the coach, everything. And that is normal.",
      "\"There is no back three against Brentford. Lately we play with Luke Shaw, two centre-backs and the right back. They play in different positions in the beginning.",
      "\"So it's not three centre-backs, it's the same thing with a little bit different positions. Against Brentford, second half, it was like a 4-4-2. The problem is that we were not good with the ball, we were soft without the ball and we lose.",
      "\"But imagine that we score the penalty. In the final goal we are trying to win the game, everyone is out of position. That can happen in the 4-3-3 or the 3-4-3. So I think the details matter more than the system.\"",
      "AMORIM: \"No. Guys, I'm the manager of the club, the big club. Is the media going to dictate what I'm going to do? It cannot be. It's not possible to sustain that.",
      "\"I talk with the players every day and I explain point by point what is happening with our team. So again, it's not a 3-4-3 all the time.",
      "\"I think we are thinking about the system but I think we need to look at all of the parts of the game. This team play in the different systems for many years, and you were talking about the lack of identity, no idea, whatever.",
      "\"So it's not the system. It's the small details, the way we play the game. And I understand what people think. 'What would this team be in a different system?' I don't know. Maybe this team would win more games.",
      "\"But if we don't change certain things, we are not going to win titles whether we change to 4-3-3 or 4-4-2.",
      "\"And that is my point with the players - not with you, I don't want to change your mind - but my players. I guarantee you they are listening to you. All those opinions, they are putting that inside because we are not winning games.",
      "\"And they have to believe in me because I watch more [Man Utd] games than you guys combined.\"",
      "Super 6 are starting the season by guaranteeing a £1,000,000 winner! Play for free."
    ]
  }
]