[
  {
    "headline": "Rasmus Hojlund opens up on \"little group\" that's formed inside Man Utd dressing room",
    "tags": ["Man Utd", "Hojlund"],
    "link": "https://www.mirror.co.uk/sport/football/news/rasmus-hojlund-manutd-kobbie-mainoo-32034798",
    "image": null,
    "date": "2024-02-02 19:07:00",
    "source": "mirror",
    "body": [
      "Rasmus Hojlund has now scored four goals in his last five games for Manchester United and the striker is confident that Erik ten Hag's can enjoy a much improved second half of the season",
      "Rasmus Hojlund never had any doubts that he would score goals for Manchester United.",
      "‌United’s £72 million striker had to wait until December to break his Premier League duck - but has now found the target in four of his last five outings. Hojlund’s tally for the season now stands at a respectable nine, although the Danish international also started to weigh in with assists as Erik ten Hag has rescued the Reds’ season by plotting a five-game unbeaten run.",
      "Hojlund said: “Of course, if you asked me, I would have loved to score my first goal in September or October. I knew I could score goals. I had shown it in the Champions League and at my previous clubs.",
      "“But, of course, opening the account means it’s like ‘Okay, I can do it’. It’s good to see. I hope we can keep going, keep the confidence in the team and keep providing for each other. I think that’s the key. We’re all being selfish when we have to but we also play for each other.”",
      "‌Hojlund has become best pals with Kobbie Mainoo, the Manchester-born teenage midfielder who is enjoying a breakthrough season. Mainoo scored the dramatic injury-time winner that secured a 4-3 victory at Wolves on Tuesday night after United had squandered a 3-1 lead.",
      "‌Hojlund said: “We enjoy spending time together. The young guys have a little group where we're chatting to each other and it's very cool to have other young players around the team. Hopefully we can set an era for the club and be here many years together.",
      "“If you're good enough, you're old enough and I think that's a good thing. We're here for a reason. You can see Kobbie’s composure. He is so relaxed on the ball. Now he's also starting to show that he has the scoring parts of his game as well. He's a complete player.”",
      "“The way he manoeuvres in tight situations and the way he manipulates this ball and uses his body at times. He shifts it, pops it through [Max] Kilman’s legs – beautiful.",
      "“He’s elusive at times as well and the control and the awareness to pick his spot. Some players see the headlines there and the back pages and think ‘I’m going to go for it’. But he just caresses it.”"
    ]
  }
]
